{
  "storage" : "model.espresso.weights",
  "analyses" : {

  },
  "properties" : {

  },
  "format_version" : 200,
  "layers" : [
    {
      "top" : "input0.3_lstm_h0_reshaped",
      "w" : 64,
      "h" : 20,
      "name" : "input0.3_lstm_h0_reshaped",
      "nd_rank" : 2,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "input0.3_lstm_h0_reshaped",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 1
    },
    {
      "top" : "input0.3_lstm_c0_reshaped",
      "w" : 64,
      "h" : 20,
      "name" : "input0.3_lstm_c0_reshaped",
      "nd_rank" : 2,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "input0.3_lstm_c0_reshaped",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 3
    },
    {
      "size_of_axes" : 2,
      "bottom" : "embedded_content",
      "axes_0" : 3,
      "axes_1" : 4,
      "weights" : {

      },
      "nd_axis" : 0,
      "debug_info" : "embedded_content_expanded",
      "top" : "embedded_content_expanded",
      "type" : "expand_dims",
      "name" : "embedded_content_expanded"
    },
    {
      "size_of_axes" : 3,
      "bottom" : "input0.3_lstm_h0_reshaped",
      "axes_0" : 0,
      "axes_1" : 3,
      "axes_2" : 4,
      "nd_axis" : 0,
      "weights" : {

      },
      "debug_info" : "input0.3_lstm_h0_reshaped_expanded_3",
      "top" : "input0.3_lstm_h0_reshaped_expanded_3",
      "type" : "expand_dims",
      "name" : "input0.3_lstm_h0_reshaped_expanded_3"
    },
    {
      "size_of_axes" : 3,
      "bottom" : "input0.3_lstm_c0_reshaped",
      "axes_0" : 0,
      "axes_1" : 3,
      "axes_2" : 4,
      "nd_axis" : 0,
      "weights" : {

      },
      "debug_info" : "input0.3_lstm_c0_reshaped_expanded2_3",
      "top" : "input0.3_lstm_c0_reshaped_expanded2_3",
      "type" : "expand_dims",
      "name" : "input0.3_lstm_c0_reshaped_expanded2_3"
    },
    {
      "begin_104" : 0,
      "begin_63" : 0,
      "begin_59" : 0,
      "begin_64" : 0,
      "begin_105" : 0,
      "begin_65" : 0,
      "begin_0" : 0,
      "begin_70" : 0,
      "begin_66" : 0,
      "begin_106" : 0,
      "begin_110" : 0,
      "begin_2" : 0,
      "begin_71" : 0,
      "begin_67" : 0,
      "begin_68" : 0,
      "begin_107" : 0,
      "begin_111" : 0,
      "begin_4" : 0,
      "begin_72" : 0,
      "begin_73" : 0,
      "begin_69" : 0,
      "begin_6" : 0,
      "begin_74" : 0,
      "begin_108" : 0,
      "type" : "split_nd",
      "begin_8" : 0,
      "begin_112" : 0,
      "begin_75" : 0,
      "begin_10" : 0,
      "begin_80" : 0,
      "begin_76" : 0,
      "begin_109" : 0,
      "begin_113" : 0,
      "begin_11" : 0,
      "nd_axis" : 2,
      "begin_81" : 0,
      "begin_77" : 0,
      "begin_114" : 0,
      "begin_12" : 0,
      "begin_78" : 0,
      "begin_82" : 0,
      "begin_13" : 0,
      "begin_83" : 0,
      "begin_79" : 0,
      "begin_115" : 0,
      "begin_14" : 0,
      "begin_84" : 0,
      "begin_15" : 0,
      "begin_85" : 0,
      "begin_116" : 0,
      "begin_120" : 0,
      "begin_20" : 0,
      "begin_86" : 0,
      "begin_16" : 0,
      "begin_90" : 0,
      "begin_21" : 0,
      "begin_91" : 0,
      "begin_87" : 0,
      "begin_17" : 0,
      "begin_117" : 0,
      "begin_121" : 0,
      "begin_18" : 0,
      "begin_92" : 0,
      "begin_88" : 0,
      "begin_22" : 0,
      "begin_23" : 0,
      "begin_89" : 0,
      "begin_19" : 0,
      "begin_93" : 0,
      "begin_118" : 0,
      "begin_122" : 0,
      "begin_24" : 0,
      "begin_94" : 0,
      "begin_25" : 0,
      "begin_95" : 0,
      "begin_119" : 0,
      "begin_123" : 0,
      "begin_30" : 0,
      "begin_26" : 0,
      "begin_96" : 0,
      "begin_124" : 0,
      "begin_31" : 0,
      "begin_97" : 0,
      "begin_27" : 0,
      "begin_28" : 0,
      "begin_98" : 0,
      "begin_32" : 0,
      "begin_125" : 0,
      "begin_33" : 0,
      "begin_29" : 0,
      "begin_99" : 0,
      "begin_1" : 0,
      "weights" : {

      },
      "begin_34" : 0,
      "bottom" : "input0.3_lstm_h0_reshaped_expanded_3",
      "begin_3" : 0,
      "begin_126" : 0,
      "begin_35" : 0,
      "begin_5" : 0,
      "begin_36" : 0,
      "begin_40" : 0,
      "begin_127" : 0,
      "name" : "input0.3_split_h",
      "begin_41" : 0,
      "begin_37" : 0,
      "begin_7" : 0,
      "begin_42" : 0,
      "begin_38" : 0,
      "begin_9" : 0,
      "begin_39" : 0,
      "begin_43" : 0,
      "begin_44" : 0,
      "begin_45" : 0,
      "begin_50" : 0,
      "begin_46" : 0,
      "begin_51" : 0,
      "begin_47" : 0,
      "begin_100" : 0,
      "begin_52" : 0,
      "debug_info" : "input0.3_split_h",
      "begin_48" : 0,
      "top" : "input0.3_lstm_h0_reshaped_expanded_3_forward,input0.3_lstm_h0_reshaped_expanded_3_reverse",
      "begin_101" : 0,
      "begin_53" : 0,
      "begin_49" : 0,
      "begin_54" : 0,
      "begin_55" : 0,
      "begin_102" : 0,
      "begin_60" : 0,
      "begin_56" : 0,
      "begin_103" : 0,
      "begin_57" : 0,
      "begin_61" : 0,
      "begin_62" : 0,
      "begin_58" : 0
    },
    {
      "begin_104" : 0,
      "begin_63" : 0,
      "begin_59" : 0,
      "begin_64" : 0,
      "begin_105" : 0,
      "begin_65" : 0,
      "begin_0" : 0,
      "begin_70" : 0,
      "begin_66" : 0,
      "begin_106" : 0,
      "begin_110" : 0,
      "begin_2" : 0,
      "begin_71" : 0,
      "begin_67" : 0,
      "begin_68" : 0,
      "begin_107" : 0,
      "begin_111" : 0,
      "begin_4" : 0,
      "begin_72" : 0,
      "begin_73" : 0,
      "begin_69" : 0,
      "begin_6" : 0,
      "begin_74" : 0,
      "begin_108" : 0,
      "type" : "split_nd",
      "begin_8" : 0,
      "begin_112" : 0,
      "begin_75" : 0,
      "begin_10" : 0,
      "begin_80" : 0,
      "begin_76" : 0,
      "begin_109" : 0,
      "begin_113" : 0,
      "begin_11" : 0,
      "nd_axis" : 2,
      "begin_81" : 0,
      "begin_77" : 0,
      "begin_114" : 0,
      "begin_12" : 0,
      "begin_78" : 0,
      "begin_82" : 0,
      "begin_13" : 0,
      "begin_83" : 0,
      "begin_79" : 0,
      "begin_115" : 0,
      "begin_14" : 0,
      "begin_84" : 0,
      "begin_15" : 0,
      "begin_85" : 0,
      "begin_116" : 0,
      "begin_120" : 0,
      "begin_20" : 0,
      "begin_86" : 0,
      "begin_16" : 0,
      "begin_90" : 0,
      "begin_21" : 0,
      "begin_91" : 0,
      "begin_87" : 0,
      "begin_17" : 0,
      "begin_117" : 0,
      "begin_121" : 0,
      "begin_18" : 0,
      "begin_92" : 0,
      "begin_88" : 0,
      "begin_22" : 0,
      "begin_23" : 0,
      "begin_89" : 0,
      "begin_19" : 0,
      "begin_93" : 0,
      "begin_118" : 0,
      "begin_122" : 0,
      "begin_24" : 0,
      "begin_94" : 0,
      "begin_25" : 0,
      "begin_95" : 0,
      "begin_119" : 0,
      "begin_123" : 0,
      "begin_30" : 0,
      "begin_26" : 0,
      "begin_96" : 0,
      "begin_124" : 0,
      "begin_31" : 0,
      "begin_97" : 0,
      "begin_27" : 0,
      "begin_28" : 0,
      "begin_98" : 0,
      "begin_32" : 0,
      "begin_125" : 0,
      "begin_33" : 0,
      "begin_29" : 0,
      "begin_99" : 0,
      "begin_1" : 0,
      "weights" : {

      },
      "begin_34" : 0,
      "bottom" : "input0.3_lstm_c0_reshaped_expanded2_3",
      "begin_3" : 0,
      "begin_126" : 0,
      "begin_35" : 0,
      "begin_5" : 0,
      "begin_36" : 0,
      "begin_40" : 0,
      "begin_127" : 0,
      "name" : "input0.3_split_c",
      "begin_41" : 0,
      "begin_37" : 0,
      "begin_7" : 0,
      "begin_42" : 0,
      "begin_38" : 0,
      "begin_9" : 0,
      "begin_39" : 0,
      "begin_43" : 0,
      "begin_44" : 0,
      "begin_45" : 0,
      "begin_50" : 0,
      "begin_46" : 0,
      "begin_51" : 0,
      "begin_47" : 0,
      "begin_100" : 0,
      "begin_52" : 0,
      "debug_info" : "input0.3_split_c",
      "begin_48" : 0,
      "top" : "input0.3_lstm_c0_reshaped_expanded2_3_forward,input0.3_lstm_c0_reshaped_expanded2_3_reverse",
      "begin_101" : 0,
      "begin_53" : 0,
      "begin_49" : 0,
      "begin_54" : 0,
      "begin_55" : 0,
      "begin_102" : 0,
      "begin_60" : 0,
      "begin_56" : 0,
      "begin_103" : 0,
      "begin_57" : 0,
      "begin_61" : 0,
      "begin_62" : 0,
      "begin_58" : 0
    },
    {
      "input_size" : 300,
      "arch" : 1,
      "quantization_scale_h" : 1,
      "internal_nonlinearity_bidir_beta" : 1,
      "quantization_scale_x" : 1,
      "hidden_size" : 32,
      "nonlinearity_alpha" : 1,
      "nonlinearity_bidir_type" : 0,
      "lstm_forget_bias" : 0,
      "coupled_input_forget" : 0,
      "quantization_simple_mode" : false,
      "internal_nonlinearity_bidir_alpha" : 1,
      "mode" : 0,
      "bias_vector_flag" : 1,
      "cell_clip_threshold" : 500,
      "type" : "rnn_arch",
      "internal_nonlinearity_second_beta" : 1,
      "internal_nonlinearity_second_bidir_type" : 0,
      "internal_nonlinearity_alpha" : 1,
      "internal_nonlinearity_beta" : 1,
      "forget_bias" : 0,
      "weights" : {
        "W_h" : 5,
        "b" : 13,
        "b_reverse" : 15,
        "W_x_reverse" : 11,
        "W_x" : 9,
        "W_h_reverse" : 7
      },
      "lstm_has_peepholes" : 0,
      "beta" : 1,
      "quantization_mode" : 0,
      "name" : "input0.3",
      "quantization_scale_h_reverse" : 0,
      "top" : "input0.3:0_5d,input0.3:1_5d_foward,input0.3:2_5d_forward,input0.3:1_5d_reverse,input0.3:2_5d_reverse",
      "alpha" : 1,
      "internal_nonlinearity_second_bidir_alpha" : 1,
      "quantization_scale_x_reverse" : 0,
      "internal_nonlinearity_second_bidir_beta" : 1,
      "max_batch_size" : 1,
      "debug_info" : "input0.3",
      "nonlinearity_bidir_alpha" : 1,
      "nonlinearity_beta" : 1,
      "internal_nonlinearity_bidir_type" : 2,
      "internal_nonlinearity_second_alpha" : 1,
      "encoder_bidirectional_mode" : 1,
      "internal_nonlinearity_type" : 2,
      "bottom" : "embedded_content_expanded,input0.3_lstm_h0_reshaped_expanded_3_forward,input0.3_lstm_c0_reshaped_expanded2_3_forward,input0.3_lstm_h0_reshaped_expanded_3_reverse,input0.3_lstm_c0_reshaped_expanded2_3_reverse",
      "nonlinearity_type" : 0,
      "nonlinearity_bidir_beta" : 1,
      "encoder_output_sequence" : 1,
      "internal_nonlinearity_second_type" : 0
    },
    {
      "size_of_axes" : 2,
      "bottom" : "input0.3:0_5d",
      "axes_0" : 3,
      "axes_1" : 4,
      "weights" : {

      },
      "nd_axis" : 0,
      "debug_info" : "input0.3:0",
      "version" : 1,
      "top" : "input0.3:0",
      "type" : "squeeze",
      "name" : "input0.3:0"
    },
    {
      "weights" : {

      },
      "debug_info" : "input0.3:1_5d",
      "top" : "input0.3:1_5d",
      "type" : "concat",
      "name" : "input0.3:1_5d",
      "bottom" : "input0.3:1_5d_foward,input0.3:1_5d_reverse"
    },
    {
      "weights" : {

      },
      "debug_info" : "input0.3:2_5d",
      "top" : "input0.3:2_5d",
      "type" : "concat",
      "name" : "input0.3:2_5d",
      "bottom" : "input0.3:2_5d_forward,input0.3:2_5d_reverse"
    },
    {
      "name" : "input0.3:1",
      "version" : 1,
      "axes_2" : 4,
      "axes_1" : 3,
      "type" : "squeeze",
      "axes_0" : 0,
      "nd_axis" : 0,
      "bottom" : "input0.3:1_5d",
      "debug_info" : "input0.3:1",
      "size_of_axes" : 3,
      "weights" : {

      },
      "top" : "input0.3:1"
    },
    {
      "name" : "input0.3:2",
      "version" : 1,
      "axes_2" : 4,
      "axes_1" : 3,
      "type" : "squeeze",
      "axes_0" : 0,
      "nd_axis" : 0,
      "bottom" : "input0.3:2_5d",
      "debug_info" : "input0.3:2",
      "size_of_axes" : 3,
      "weights" : {

      },
      "top" : "input0.3:2"
    },
    {
      "name" : "input0.2",
      "weights" : {

      },
      "dst_w" : 1280,
      "version" : 1,
      "dst_n" : 1,
      "dst_nd_rank" : 2,
      "type" : "reshape",
      "dst_h" : 1,
      "mode" : 0,
      "dynamic_shape" : false,
      "bottom" : "input0.3:0",
      "debug_info" : "input0.2",
      "dst_seq" : 1,
      "dst_k" : 1,
      "top" : "input0.2"
    },
    {
      "nB" : 1280,
      "top" : "input0.1",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 4,
      "blob_weights" : 19,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "input0.2",
      "blob_biases" : 17,
      "has_tanh" : 0,
      "debug_info" : "input0.1",
      "name" : "input0.1",
      "has_prelu" : 0
    },
    {
      "bottom" : "input0.1",
      "weights" : {

      },
      "nd_axis" : 1,
      "debug_info" : "38",
      "top" : "probabilities",
      "type" : "softmax_nd",
      "name" : "38",
      "attributes" : {
        "is_output" : 1
      }
    }
  ]
}