{
  "storage" : "model.espresso.weights",
  "analyses" : {

  },
  "properties" : {

  },
  "format_version" : 200,
  "metadata_in_weights" : [

  ],
  "layers" : [
    {
      "has_prelu" : 0,
      "top" : "Identity",
      "has_biases" : 0,
      "weights" : {

      },
      "nC" : 2,
      "blob_weights" : 1,
      "type" : "inner_product",
      "has_relu" : 0,
      "attributes" : {
        "is_output" : 1
      },
      "bottom" : "featureVector",
      "debug_info" : "sgmi_model\/saliency\/MatMul",
      "has_tanh" : 0,
      "nd_mode" : true,
      "name" : "sgmi_model\/saliency\/MatMul",
      "nB" : 8
    }
  ]
}