W
3
5de9546e80a57e00399f8f01model.espresso.netd – ¢assets_150/dummy_empty_file[
7
5de954816406950047ec3060model.espresso.weightsd – ¢assets_150/dummy_empty_fileY
5
5de954916406950047ec3062model.espresso.shaped – ¢assets_150/dummy_empty_fileP
,
5de954ac6406950047ec3063lexiconFiled – ¢assets_150/dummy_empty_fileW
3
5deedc1cf1a11d003eb799dbmodel.espresso.bind – ¢assets_150/dummy_empty_fileD
*
5c9c0966a1ad1500492d2900	modelName –ZDEFAULT_RESPONSE_KITN
*
5c9c097373d1f6004a3b254b	modelFiled – ¢assets_150/dummy_empty_fileP
,
5c9c0980a1ad1500492d2902modelConfigd – ¢assets_150/dummy_empty_file