{
  "storage" : "model.espresso.weights",
  "analyses" : {

  },
  "properties" : {

  },
  "format_version" : 200,
  "layers" : [
    {
      "bottom" : "constant_step",
      "alpha" : 0,
      "operation" : 1,
      "beta" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Identity",
      "top" : "uncertainty_prompt_prediction_score",
      "type" : "elementwise",
      "name" : "Identity",
      "attributes" : {
        "is_output" : 1
      }
    },
    {
      "bottom" : "constant_step",
      "alpha" : 1,
      "operation" : 1,
      "beta" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Identity_1",
      "top" : "uncertainty_prompt_prediction_threshold",
      "type" : "elementwise",
      "name" : "Identity_1",
      "attributes" : {
        "is_output" : 1
      }
    },
    {
      "bottom" : "constant_step",
      "alpha" : 0,
      "operation" : 1,
      "beta" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Identity_2",
      "top" : "uncertainty_prompt_prediction_decision",
      "type" : "elementwise",
      "name" : "Identity_2",
      "attributes" : {
        "is_output" : 1
      }
    }
  ]
}