{
  "storage": "model.espresso.weights",
  "properties": {
    "ane_compiler_batch": "1",
    "espresso.dispatch.v3_enable": "0"
  },
  "configurations": {
    "img_input_1_4_1_32_1700_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 1700,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_400_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 400,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_1950_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 1950,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_850_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 850,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_2200_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 2200,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_2450_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 2450,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_500_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 500,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_1600_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 1600,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_950_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 950,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_1850_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 1850,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_2100_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 2100,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_600_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 600,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_2350_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 2350,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_1500_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 1500,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_1750_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 1750,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_700_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 700,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_2000_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 2000,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_2250_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 2250,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_1400_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 1400,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_800_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 800,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_1650_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 1650,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_2150_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 2150,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_900_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 900,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_1300_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 1300,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_1550_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 1550,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_2050_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 2050,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_1200_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 1200,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_2900_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 2900,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_1450_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 1450,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_2800_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 2800,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_1100_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 1100,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_1350_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 1350,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_9_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 9,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_150_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 150,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_2700_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 2700,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_1000_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 1000,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_1250_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 1250,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_2950_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 2950,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_250_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 250,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_2600_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 2600,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_2850_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 2850,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_350_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 350,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_1150_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 1150,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_450_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 450,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_2500_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 2500,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_2750_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 2750,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_1050_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 1050,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_100_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 100,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_1900_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 1900,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_3000_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 3000,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_550_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 550,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_2400_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 2400,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_2650_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 2650,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_200_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 200,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_650_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 650,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_1800_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 1800,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_300_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 300,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_2300_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 2300,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_2550_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 2550,
          "n": 4,
          "h": 32
        }
      }
    },
    "img_input_1_4_1_32_750_": {
      "input_shapes": {
        "img_input": {
          "k": 1,
          "w": 750,
          "n": 4,
          "h": 32
        }
      }
    }
  },
  "format_version": 200,
  "analyses": {},
  "layers": [
    {
      "pad_r": 1,
      "fused_relu": 1,
      "fused_tanh": 0,
      "debug_info": "cnn_block1_conv1",
      "pad_fill_mode": 0,
      "pad_b": 1,
      "pad_l": 1,
      "top": "cnn_block1_conv1__activation___output",
      "blob_weights": 3,
      "K": 1,
      "blob_biases": 1,
      "name": "cnn_block1_conv1",
      "has_batch_norm": 0,
      "type": "convolution",
      "n_groups": 1,
      "pad_t": 1,
      "has_biases": 1,
      "C": 16,
      "bottom": "img_input",
      "weights": {},
      "Nx": 3,
      "pad_mode": 0,
      "pad_value": 0,
      "Ny": 3,
      "n_parallel": 1
    },
    {
      "pad_r": 0,
      "debug_info": "cnn_block1_pool",
      "pad_fill_mode": 0,
      "pad_b": 0,
      "pad_l": 0,
      "size_x": 2,
      "top": "cnn_block1_pool_output",
      "top_shape_style": 0,
      "stride_x": 2,
      "avg_or_max": 1,
      "average_count_exclude_padding": 1,
      "type": "pool",
      "name": "cnn_block1_pool",
      "pad_t": 0,
      "stride_y": 2,
      "bottom": "cnn_block1_conv1__activation___output",
      "weights": {},
      "pad_mode": 0,
      "size_y": 2,
      "pad_value": 0
    },
    {
      "pad_r": 1,
      "fused_relu": 1,
      "fused_tanh": 0,
      "debug_info": "cnn_block2_conv1",
      "pad_fill_mode": 0,
      "pad_b": 1,
      "pad_l": 1,
      "top": "cnn_block2_conv1__activation___output",
      "blob_weights": 7,
      "K": 16,
      "blob_biases": 5,
      "name": "cnn_block2_conv1",
      "has_batch_norm": 0,
      "type": "convolution",
      "n_groups": 1,
      "pad_t": 1,
      "has_biases": 1,
      "C": 32,
      "bottom": "cnn_block1_pool_output",
      "weights": {},
      "Nx": 3,
      "pad_mode": 0,
      "pad_value": 0,
      "Ny": 3,
      "n_parallel": 1
    },
    {
      "pad_r": 0,
      "debug_info": "cnn_block2_pool",
      "pad_fill_mode": 0,
      "pad_b": 0,
      "pad_l": 0,
      "size_x": 2,
      "top": "cnn_block2_pool_output",
      "top_shape_style": 0,
      "stride_x": 2,
      "avg_or_max": 1,
      "average_count_exclude_padding": 1,
      "type": "pool",
      "name": "cnn_block2_pool",
      "pad_t": 0,
      "stride_y": 2,
      "bottom": "cnn_block2_conv1__activation___output",
      "weights": {},
      "pad_mode": 0,
      "size_y": 2,
      "pad_value": 0
    },
    {
      "pad_r": 1,
      "fused_relu": 1,
      "fused_tanh": 0,
      "debug_info": "cnn_block3_conv1",
      "pad_fill_mode": 0,
      "pad_b": 1,
      "pad_l": 1,
      "top": "cnn_block3_act1_output",
      "blob_weights": 11,
      "K": 32,
      "blob_biases": 9,
      "name": "cnn_block3_conv1",
      "has_batch_norm": 0,
      "type": "convolution",
      "n_groups": 1,
      "pad_t": 1,
      "has_biases": 1,
      "C": 64,
      "bottom": "cnn_block2_pool_output",
      "weights": {},
      "Nx": 3,
      "pad_mode": 0,
      "pad_value": 0,
      "Ny": 3,
      "n_parallel": 1
    },
    {
      "pad_r": 1,
      "fused_relu": 1,
      "fused_tanh": 0,
      "debug_info": "cnn_block3_conv2",
      "pad_fill_mode": 0,
      "pad_b": 1,
      "pad_l": 1,
      "top": "cnn_block3_conv2__activation___output",
      "blob_weights": 15,
      "K": 64,
      "blob_biases": 13,
      "name": "cnn_block3_conv2",
      "has_batch_norm": 0,
      "type": "convolution",
      "n_groups": 1,
      "pad_t": 1,
      "has_biases": 1,
      "C": 64,
      "bottom": "cnn_block3_act1_output",
      "weights": {},
      "Nx": 3,
      "pad_mode": 0,
      "pad_value": 0,
      "Ny": 3,
      "n_parallel": 1
    },
    {
      "pad_r": 1,
      "debug_info": "cnn_block3_pool",
      "pad_fill_mode": 0,
      "pad_b": 0,
      "pad_l": 0,
      "size_x": 2,
      "top": "cnn_block3_pool_output",
      "top_shape_style": 0,
      "stride_x": 1,
      "avg_or_max": 1,
      "average_count_exclude_padding": 1,
      "type": "pool",
      "name": "cnn_block3_pool",
      "pad_t": 0,
      "stride_y": 2,
      "bottom": "cnn_block3_conv2__activation___output",
      "weights": {},
      "pad_mode": 0,
      "size_y": 2,
      "pad_value": 0
    },
    {
      "pad_r": 1,
      "fused_relu": 1,
      "fused_tanh": 0,
      "debug_info": "cnn_block4_conv1",
      "pad_fill_mode": 0,
      "pad_b": 1,
      "pad_l": 1,
      "top": "cnn_block4_act1_output",
      "blob_weights": 19,
      "K": 64,
      "blob_biases": 17,
      "name": "cnn_block4_conv1",
      "has_batch_norm": 0,
      "type": "convolution",
      "n_groups": 1,
      "pad_t": 1,
      "has_biases": 1,
      "C": 128,
      "bottom": "cnn_block3_pool_output",
      "weights": {},
      "Nx": 3,
      "pad_mode": 0,
      "pad_value": 0,
      "Ny": 3,
      "n_parallel": 1
    },
    {
      "pad_r": 1,
      "fused_relu": 1,
      "fused_tanh": 0,
      "debug_info": "cnn_block4_conv2",
      "pad_fill_mode": 0,
      "pad_b": 1,
      "pad_l": 1,
      "top": "cnn_block4_conv2__activation___output",
      "blob_weights": 23,
      "K": 128,
      "blob_biases": 21,
      "name": "cnn_block4_conv2",
      "has_batch_norm": 0,
      "type": "convolution",
      "n_groups": 1,
      "pad_t": 1,
      "has_biases": 1,
      "C": 128,
      "bottom": "cnn_block4_act1_output",
      "weights": {},
      "Nx": 3,
      "pad_mode": 0,
      "pad_value": 0,
      "Ny": 3,
      "n_parallel": 1
    },
    {
      "pad_r": 1,
      "debug_info": "cnn_block4_pool",
      "pad_fill_mode": 0,
      "pad_b": 0,
      "pad_l": 0,
      "size_x": 2,
      "top": "cnn_block4_pool_output",
      "top_shape_style": 0,
      "stride_x": 1,
      "avg_or_max": 1,
      "average_count_exclude_padding": 1,
      "type": "pool",
      "name": "cnn_block4_pool",
      "pad_t": 0,
      "stride_y": 2,
      "bottom": "cnn_block4_conv2__activation___output",
      "weights": {},
      "pad_mode": 0,
      "size_y": 2,
      "pad_value": 0
    },
    {
      "pad_r": 0,
      "fused_relu": 1,
      "fused_tanh": 0,
      "debug_info": "cnn_block5_conv1",
      "pad_fill_mode": 0,
      "pad_b": 0,
      "pad_l": 0,
      "top": "cnn_feature_map_output",
      "blob_weights": 27,
      "K": 128,
      "blob_biases": 25,
      "name": "cnn_block5_conv1",
      "has_batch_norm": 0,
      "type": "convolution",
      "n_groups": 1,
      "pad_t": 0,
      "has_biases": 1,
      "C": 128,
      "bottom": "cnn_block4_pool_output",
      "weights": {},
      "Nx": 2,
      "pad_mode": 0,
      "pad_value": 0,
      "Ny": 2,
      "n_parallel": 1
    },
    {
      "axis_seq": 0,
      "top": "map_to_sequence_output",
      "name": "map_to_sequence",
      "axis_n": 3,
      "axis_h": 1,
      "type": "transpose",
      "axis_w": 4,
      "bottom": "cnn_feature_map_output",
      "axis_k": 2,
      "debug_info": "map_to_sequence",
      "weights": {},
      "hint_fallback_from_ane": 1
    },
    {
      "input_size": 128,
      "arch": 1,
      "quantization_scale_h": 1,
      "internal_nonlinearity_bidir_beta": 1,
      "quantization_scale_x": 1,
      "hidden_size": 128,
      "lstm_forget_bias": 1,
      "nonlinearity_alpha": 1,
      "nonlinearity_bidir_type": 0,
      "attributes": {
        "is_output": 1
      },
      "coupled_input_forget": 0,
      "quantization_simple_mode": false,
      "internal_nonlinearity_bidir_alpha": 1,
      "mode": 0,
      "bias_vector_flag": 1,
      "cell_clip_threshold": 50000,
      "type": "rnn_arch",
      "override_eng": 1,
      "internal_nonlinearity_second_beta": 1,
      "internal_nonlinearity_second_bidir_type": 0,
      "internal_nonlinearity_alpha": 1,
      "internal_nonlinearity_beta": 1,
      "forget_bias": 0,
      "weights": {
        "W_h": 29,
        "b": 37,
        "b_reverse": 39,
        "W_x_reverse": 35,
        "W_x": 33,
        "W_h_reverse": 31
      },
      "lstm_has_peepholes": 0,
      "beta": 1,
      "quantization_mode": 0,
      "name": "rnn_block1_bilstm",
      "quantization_scale_h_reverse": 0,
      "top": "rnn_block1_bilstm_output_concatenated_bilstm_output,rnn_block1_bilstm_h_out,rnn_block1_bilstm_c_out,rnn_block1_bilstm_h_out_rev,rnn_block1_bilstm_c_out_rev",
      "alpha": 1,
      "internal_nonlinearity_second_bidir_alpha": 1,
      "quantization_scale_x_reverse": 0,
      "internal_nonlinearity_second_bidir_beta": 1,
      "max_batch_size": 1,
      "debug_info": "rnn_block1_bilstm",
      "nonlinearity_bidir_alpha": 1,
      "nonlinearity_beta": 1,
      "internal_nonlinearity_bidir_type": 3,
      "internal_nonlinearity_second_alpha": 1,
      "encoder_bidirectional_mode": 1,
      "internal_nonlinearity_type": 3,
      "bottom": "map_to_sequence_output",
      "nonlinearity_type": 0,
      "encoder_output_sequence": 1,
      "nonlinearity_bidir_beta": 1,
      "internal_nonlinearity_second_type": 0
    },
    {
      "bottom": "rnn_block1_bilstm_output_concatenated_bilstm_output",
      "cut": 0,
      "weights": {},
      "debug_info": "rnn_block1_bilstm_split",
      "n_outputs": 2,
      "top": "rnn_block1_bilstm_output_forward,rnn_block1_bilstm_output_backward",
      "type": "split",
      "name": "rnn_block1_bilstm_split"
    },
    {
      "bottom": "rnn_block1_bilstm_output_forward,rnn_block1_bilstm_output_backward",
      "alpha": 1,
      "operation": 0,
      "weights": {},
      "fused_relu": 0,
      "debug_info": "rnn_block1_bilstm_elementwise",
      "top": "rnn_block1_bilstm_output",
      "type": "elementwise",
      "name": "rnn_block1_bilstm_elementwise",
      "beta": 0
    },
    {
      "input_size": 128,
      "arch": 1,
      "quantization_scale_h": 1,
      "internal_nonlinearity_bidir_beta": 1,
      "quantization_scale_x": 1,
      "hidden_size": 128,
      "lstm_forget_bias": 1,
      "nonlinearity_alpha": 1,
      "nonlinearity_bidir_type": 0,
      "attributes": {
        "is_output": 1
      },
      "coupled_input_forget": 0,
      "quantization_simple_mode": false,
      "internal_nonlinearity_bidir_alpha": 1,
      "mode": 0,
      "bias_vector_flag": 1,
      "cell_clip_threshold": 50000,
      "type": "rnn_arch",
      "override_eng": 1,
      "internal_nonlinearity_second_beta": 1,
      "internal_nonlinearity_second_bidir_type": 0,
      "internal_nonlinearity_alpha": 1,
      "internal_nonlinearity_beta": 1,
      "forget_bias": 0,
      "weights": {
        "W_h": 41,
        "b": 49,
        "b_reverse": 51,
        "W_x_reverse": 47,
        "W_x": 45,
        "W_h_reverse": 43
      },
      "lstm_has_peepholes": 0,
      "beta": 1,
      "quantization_mode": 0,
      "name": "rnn_block2_bilstm",
      "quantization_scale_h_reverse": 0,
      "top": "rnn_block2_bilstm_output_concatenated_bilstm_output,rnn_block2_bilstm_h_out,rnn_block2_bilstm_c_out,rnn_block2_bilstm_h_out_rev,rnn_block2_bilstm_c_out_rev",
      "alpha": 1,
      "internal_nonlinearity_second_bidir_alpha": 1,
      "quantization_scale_x_reverse": 0,
      "internal_nonlinearity_second_bidir_beta": 1,
      "max_batch_size": 1,
      "debug_info": "rnn_block2_bilstm",
      "nonlinearity_bidir_alpha": 1,
      "nonlinearity_beta": 1,
      "internal_nonlinearity_bidir_type": 3,
      "internal_nonlinearity_second_alpha": 1,
      "encoder_bidirectional_mode": 1,
      "internal_nonlinearity_type": 3,
      "bottom": "rnn_block1_bilstm_output",
      "nonlinearity_type": 0,
      "encoder_output_sequence": 1,
      "nonlinearity_bidir_beta": 1,
      "internal_nonlinearity_second_type": 0
    },
    {
      "bottom": "rnn_block2_bilstm_output_concatenated_bilstm_output",
      "cut": 0,
      "weights": {},
      "debug_info": "rnn_block2_bilstm_split",
      "n_outputs": 2,
      "top": "rnn_block2_bilstm_output_forward,rnn_block2_bilstm_output_backward",
      "type": "split",
      "name": "rnn_block2_bilstm_split"
    },
    {
      "bottom": "rnn_block2_bilstm_output_forward,rnn_block2_bilstm_output_backward",
      "alpha": 1,
      "operation": 0,
      "weights": {},
      "fused_relu": 0,
      "debug_info": "rnn_block2_bilstm_elementwise",
      "top": "rnn_block2_bilstm_output",
      "type": "elementwise",
      "name": "rnn_block2_bilstm_elementwise",
      "beta": 0
    },
    {
      "nB": 128,
      "top": "ip_clusters",
      "has_biases": 1,
      "blob_biases": 53,
      "nC": 6356,
      "blob_weights": 55,
      "weights": {},
      "type": "inner_product",
      "has_relu": 0,
      "bottom": "rnn_block2_bilstm_output",
      "debug_info": "",
      "has_tanh": 0,
      "name": "inner_product_0",
      "has_prelu": 0,
      "hint_fallback_from_ane": 1
    },
    {
      "nB": 128,
      "top": "output_label_prob_map_after_topk,topk_indices",
      "has_biases": 1,
      "argmax_tree_n_clusters": 6356,
      "nC": 19879,
      "fused_activation_mode": 100002,
      "fused_activation_alpha": 20,
      "weights": {
        "4411/2/b": 22817,
        "5740/1/scatter_index": 31675,
        "5038/1/scatter_index": 26995,
        "1746/4/scatter_index": 5047,
        "1947/4/W": 6381,
        "3590/2/b": 17339,
        "5816/1/W": 32175,
        "3045/3/b": 13709,
        "5252/1/b": 28421,
        "4720/1/scatter_index": 24877,
        "2788/3/W": 11985,
        "4995/1/W": 26697,
        "879/5/W": 37389,
        "3725/2/W": 18237,
        "2974/3/scatter_index": 13231,
        "1453/5/b": 3095,
        "5210/1/scatter_index": 28147,
        "5183/1/scatter_index": 27961,
        "1891/4/scatter_index": 6013,
        "4566/1/W": 23841,
        "2294/4/b": 8699,
        "1308/5/scatter_index": 2131,
        "1024/5/b": 239,
        "3231/3/b": 14951,
        "824/5/W": 37029,
        "5338/1/scatter_index": 28993,
        "6163/1/b": 34493,
        "2974/3/W": 13227,
        "1704/4/W": 4767,
        "3911/2/W": 19479,
        "2429/4/W": 9597,
        "4255/2/scatter_index": 21775,
        "4072/2/b": 20555,
        "422/6/scatter_index": 21541,
        "967/5/b": 37979,
        "2545/3/W": 10371,
        "3172/3/scatter_index": 14557,
        "164/8/b": 4337,
        "468/6/b": 24599,
        "4752/1/W": 25083,
        "5477/1/W": 29913,
        "4207/2/W": 21453,
        "5928/1/b": 32921,
        "5483/1/scatter_index": 29959,
        "1210/5/b": 1481,
        "761/6/scatter_index": 36613,
        "3837/2/b": 18983,
        "599/6/W": 33327,
        "5048/1/W": 27057,
        "912/5/b": 37619,
        "2051/4/b": 7085,
        "2244/4/scatter_index": 8371,
        "5638/1/scatter_index": 30991,
        "1794/4/W": 5361,
        "413/6/b": 20939,
        "4678/1/b": 24587,
        "2731/3/W": 11613,
        "1249/5/W": 1731,
        "3456/3/W": 16443,
        "126/8/scatter_index": 1807,
        "1161/5/scatter_index": 1153,
        "5663/1/W": 31155,
        "186/7/scatter_index": 5803,
        "544/6/W": 29667,
        "3572/2/W": 17217,
        "984/5/scatter_index": 38095,
        "4297/2/W": 22047,
        "1816/4/b": 5513,
        "3027/3/W": 13587,
        "35/9/scatter_index": 16735,
        "5234/1/W": 28299,
        "3535/2/scatter_index": 16975,
        "5783/1/scatter_index": 31957,
        "5108/1/scatter_index": 27463,
        "1816/4/scatter_index": 5515,
        "1789/4/scatter_index": 5329,
        "2657/3/b": 11117,
        "1980/4/W": 6603,
        "4864/1/b": 25829,
        "5589/1/b": 30659,
        "687/6/b": 36113,
        "188/7/b": 5933,
        "349/7/scatter_index": 16669,
        "4319/2/b": 22199,
        "4025/2/scatter_index": 20245,
        "1435/5/W": 2973,
        "5938/1/scatter_index": 32989,
        "4763/1/scatter_index": 25159,
        "3498/2/b": 16721,
        "1551/4/W": 3747,
        "2276/4/W": 8577,
        "1461/5/scatter_index": 3151,
        "4483/2/W": 23289,
        "3680/2/scatter_index": 17941,
        "1006/5/W": 117,
        "3213/3/W": 14829,
        "5420/1/W": 29541,
        "6145/1/W": 34371,
        "632/6/b": 35537,
        "2843/3/b": 12359,
        "4054/2/W": 20433,
        "5775/1/b": 31901,
        "3835/2/scatter_index": 18973,
        "763/6/W": 36621,
        "4505/2/b": 23441,
        "928/5/scatter_index": 37723,
        "2014/4/scatter_index": 6841,
        "5408/1/scatter_index": 29461,
        "264/7/W": 11001,
        "2752/3/scatter_index": 11755,
        "3684/2/b": 17963,
        "4621/1/b": 24215,
        "3139/3/b": 14333,
        "2462/4/W": 9819,
        "4298/2/scatter_index": 22057,
        "5346/1/b": 29045,
        "6136/1/scatter_index": 34315,
        "6331/1/W": 35613,
        "3819/2/W": 18861,
        "1096/5/W": 711,
        "3980/2/scatter_index": 19939,
        "2033/4/W": 6963,
        "4240/2/W": 21675,
        "1059/5/scatter_index": 469,
        "5961/1/b": 33143,
        "1663/4/b": 4493,
        "3870/2/b": 19205,
        "2388/4/b": 9323,
        "5081/1/W": 27279,
        "2600/3/b": 10745,
        "1118/5/b": 863,
        "3325/3/b": 15575,
        "5532/1/b": 30287,
        "6281/1/scatter_index": 35281,
        "2314/4/scatter_index": 8839,
        "2287/4/scatter_index": 8653,
        "352/7/b": 16871,
        "5708/1/scatter_index": 31459,
        "6257/1/b": 35117,
        "4166/2/b": 21179,
        "1231/5/scatter_index": 1621,
        "1282/5/W": 1953,
        "5103/1/b": 27431,
        "5261/1/scatter_index": 28483,
        "313/7/scatter_index": 14275,
        "2639/3/W": 10995,
        "4846/1/W": 25707,
        "1359/5/scatter_index": 2467,
        "3605/2/scatter_index": 17443,
        "3578/2/scatter_index": 17257,
        "1304/5/b": 2105,
        "3060/3/W": 13809,
        "57/9/scatter_index": 31399,
        "2522/3/scatter_index": 10225,
        "2495/3/scatter_index": 10039,
        "2690/3/b": 11339,
        "2145/4/b": 7709,
        "4352/2/b": 22421,
        "1888/4/W": 5985,
        "536/6/scatter_index": 29137,
        "6014/1/b": 33503,
        "2825/3/W": 12237,
        "5757/1/W": 31779,
        "5193/1/b": 28025,
        "875/5/b": 37367,
        "5561/1/scatter_index": 30481,
        "3666/2/W": 17841,
        "1567/4/scatter_index": 3853,
        "4603/1/W": 24093,
        "5328/1/W": 28923,
        "1394/5/b": 2699,
        "3905/2/scatter_index": 19441,
        "3878/2/scatter_index": 19255,
        "2331/4/b": 8951,
        "4958/1/b": 26453,
        "2822/3/scatter_index": 12223,
        "2795/3/scatter_index": 12037,
        "6200/1/b": 34745,
        "820/5/b": 37007,
        "5943/1/W": 33021,
        "3172/3/b": 14555,
        "6206/1/scatter_index": 34783,
        "6179/1/scatter_index": 34597,
        "5031/1/scatter_index": 26953,
        "319/7/b": 14669,
        "1645/4/W": 4371,
        "3852/2/W": 19083,
        "951/5/W": 37875,
        "41/9/b": 20735,
        "3307/3/W": 15453,
        "5514/1/W": 30165,
        "1129/5/scatter_index": 937,
        "5861/1/scatter_index": 32479,
        "452/6/W": 23535,
        "6239/1/W": 34995,
        "5159/1/scatter_index": 27799,
        "2486/3/W": 9975,
        "1867/4/scatter_index": 5851,
        "4693/1/W": 24687,
        "2937/3/b": 12983,
        "4148/2/W": 21057,
        "5869/1/b": 32525,
        "4103/2/scatter_index": 20767,
        "4076/2/scatter_index": 20581,
        "1151/5/b": 1085,
        "4841/1/scatter_index": 25681,
        "595/6/b": 33065,
        "6290/1/b": 35339,
        "3778/2/b": 18587,
        "3020/3/scatter_index": 13549,
        "2508/3/b": 10127,
        "1831/4/W": 5613,
        "4715/1/b": 24839,
        "879/5/scatter_index": 37393,
        "5331/1/scatter_index": 28951,
        "5700/1/W": 31407,
        "2672/3/W": 11217,
        "3397/3/W": 16047,
        "2127/4/W": 7587,
        "4334/2/W": 22299,
        "1429/5/scatter_index": 2935,
        "500/6/scatter_index": 26743,
        "540/6/b": 29405,
        "5459/1/scatter_index": 29797,
        "1757/4/b": 5117,
        "3964/2/b": 19829,
        "5175/1/W": 27903,
        "4403/2/scatter_index": 22765,
        "4376/2/scatter_index": 22579,
        "3419/3/b": 16199,
        "4901/1/b": 26081,
        "5626/1/b": 30911,
        "671/6/W": 36009,
        "172/7/W": 4869,
        "2598/3/b": 10721,
        "3320/3/scatter_index": 15547,
        "3293/3/scatter_index": 15361,
        "3535/2/b": 16973,
        "1376/5/W": 2577,
        "5790/1/W": 32001,
        "2313/4/W": 8829,
        "4520/2/W": 23541,
        "1637/4/scatter_index": 4321,
        "918/5/W": 37653,
        "1943/4/b": 6359,
        "3154/3/W": 14433,
        "5361/1/W": 29145,
        "6086/1/W": 33975,
        "115/8/W": 1071,
        "2365/4/scatter_index": 9175,
        "264/7/scatter_index": 11005,
        "419/6/W": 21333,
        "4584/1/scatter_index": 23965,
        "4611/1/scatter_index": 24151,
        "5759/1/scatter_index": 31795,
        "2784/3/b": 11963,
        "4991/1/b": 26675,
        "5812/1/b": 32153,
        "3721/2/b": 18215,
        "2239/4/b": 8333,
        "1282/5/scatter_index": 1957,
        "260/7/b": 10739,
        "4446/2/b": 23045,
        "6108/1/b": 34127,
        "2919/3/W": 12861,
        "4562/1/b": 23819,
        "5287/1/b": 28649,
        "4017/2/b": 20189,
        "3340/3/W": 15675,
        "3656/2/scatter_index": 17779,
        "1133/5/W": 963,
        "487/6/scatter_index": 25867,
        "5229/1/scatter_index": 28267,
        "1937/4/scatter_index": 6319,
        "6272/1/W": 35217,
        "2600/3/scatter_index": 10747,
        "2573/3/scatter_index": 10561,
        "2970/3/b": 13205,
        "1488/5/b": 3323,
        "4181/2/W": 21279,
        "4146/2/scatter_index": 21049,
        "1700/4/b": 4745,
        "2425/4/b": 9575,
        "507/6/b": 27203,
        "4911/1/scatter_index": 26149,
        "4884/1/scatter_index": 25963,
        "2541/3/b": 10349,
        "1059/5/b": 467,
        "3266/3/b": 15179,
        "5473/1/b": 29891,
        "638/6/W": 35787,
        "6198/1/b": 34721,
        "4203/2/b": 21431,
        "1739/4/W": 4995,
        "3946/2/W": 19707,
        "3218/3/scatter_index": 14863,
        "5608/1/W": 30789,
        "3956/2/scatter_index": 19777,
        "2160/4/W": 7809,
        "5044/1/b": 27035,
        "2135/4/scatter_index": 7645,
        "37/9/b": 18065,
        "4787/1/W": 25311,
        "5529/1/scatter_index": 30265,
        "3517/2/W": 16851,
        "2900/3/scatter_index": 12745,
        "2873/3/scatter_index": 12559,
        "1790/4/b": 5339,
        "1052/5/scatter_index": 427,
        "1245/5/b": 1709,
        "3452/3/b": 16421,
        "5082/1/scatter_index": 27289,
        "1790/4/scatter_index": 5341,
        "6257/1/scatter_index": 35119,
        "726/6/b": 36377,
        "1925/4/W": 6237,
        "4809/1/b": 25463,
        "2086/4/b": 7313,
        "1207/5/scatter_index": 1459,
        "4293/2/b": 22025,
        "227/7/b": 8537,
        "3023/3/b": 13565,
        "5230/1/b": 28277,
        "2766/3/W": 11841,
        "4973/1/W": 26553,
        "5698/1/W": 31383,
        "3703/2/W": 18093,
        "4428/2/W": 22923,
        "358/7/W": 17265,
        "2435/4/scatter_index": 9643,
        "1431/5/b": 2951,
        "5829/1/scatter_index": 32263,
        "451/6/scatter_index": 23473,
        "5269/1/W": 28527,
        "1352/5/scatter_index": 2425,
        "2272/4/b": 8555,
        "5382/1/scatter_index": 29287,
        "1002/5/b": 95,
        "802/6/W": 36885,
        "4809/1/scatter_index": 25465,
        "4899/1/b": 26057,
        "6141/1/b": 34349,
        "3629/2/b": 17597,
        "2952/3/W": 13083,
        "303/7/W": 13605,
        "5884/1/W": 32625,
        "1507/5/scatter_index": 3457,
        "2407/4/W": 9453,
        "3726/2/scatter_index": 18247,
        "3699/2/scatter_index": 18061,
        "4050/2/b": 20411,
        "614/6/scatter_index": 34339,
        "790/6/scatter_index": 36805,
        "1586/4/W": 3975,
        "3793/2/W": 18687,
        "2643/3/scatter_index": 11029,
        "2523/3/W": 10227,
        "3248/3/W": 15057,
        "4730/1/W": 24939,
        "5455/1/W": 29769,
        "5906/1/b": 32777,
        "6027/1/scatter_index": 33589,
        "1560/4/scatter_index": 3811,
        "155/8/scatter_index": 3739,
        "2878/3/b": 12587,
        "4089/2/W": 20661,
        "1608/4/b": 4127,
        "3815/2/b": 18839,
        "5026/1/W": 26913,
        "1092/5/b": 689,
        "5682/1/scatter_index": 31285,
        "5007/1/scatter_index": 26791,
        "1715/4/scatter_index": 4843,
        "1688/4/scatter_index": 4657,
        "837/5/scatter_index": 37117,
        "1772/4/W": 5217,
        "4656/1/b": 24443,
        "1227/5/W": 1587,
        "3434/3/W": 16299,
        "3999/2/scatter_index": 20059,
        "5641/1/W": 31011,
        "378/7/scatter_index": 18601,
        "826/5/W": 37041,
        "2943/3/scatter_index": 13027,
        "3550/2/W": 17073,
        "2068/4/W": 7191,
        "4275/2/W": 21903,
        "5996/1/b": 33371,
        "3005/3/W": 13443,
        "5212/1/W": 28155,
        "6327/1/scatter_index": 35587,
        "5152/1/scatter_index": 27757,
        "1860/4/scatter_index": 5809,
        "1698/4/b": 4721,
        "969/5/b": 37991,
        "2635/3/b": 10973,
        "4842/1/b": 25685,
        "166/8/b": 4469,
        "5567/1/b": 30515,
        "5982/1/scatter_index": 33283,
        "1413/5/W": 2829,
        "5307/1/scatter_index": 28789,
        "1988/4/scatter_index": 6655,
        "3476/2/b": 16577,
        "957/5/scatter_index": 37915,
        "4224/2/scatter_index": 21571,
        "2254/4/W": 8433,
        "4461/2/W": 23145,
        "4197/2/scatter_index": 21385,
        "5138/1/b": 27659,
        "4962/1/scatter_index": 26485,
        "914/5/b": 37631,
        "6123/1/W": 34227,
        "3141/3/scatter_index": 14353,
        "111/8/b": 809,
        "415/6/b": 21071,
        "3095/3/W": 14037,
        "222/7/scatter_index": 8209,
        "2821/3/b": 12215,
        "1339/5/b": 2333,
        "4032/2/W": 20289,
        "1884/4/b": 5963,
        "5452/1/scatter_index": 29755,
        "5753/1/b": 31757,
        "546/6/W": 29799,
        "3662/2/b": 17819,
        "4387/2/b": 22649,
        "6180/1/scatter_index": 34609,
        "3117/3/b": 14189,
        "2440/4/W": 9675,
        "2213/4/scatter_index": 8167,
        "5324/1/b": 28901,
        "5607/1/scatter_index": 30787,
        "6049/1/b": 33731,
        "689/6/b": 36125,
        "1130/5/scatter_index": 949,
        "4524/2/scatter_index": 23569,
        "4497/2/scatter_index": 23383,
        "1074/5/W": 567,
        "3281/3/W": 15279,
        "2011/4/W": 6819,
        "3441/3/scatter_index": 16351,
        "4638/1/W": 24321,
        "1641/4/b": 4349,
        "342/7/scatter_index": 16207,
        "3504/2/scatter_index": 16771,
        "2366/4/b": 9179,
        "3303/3/b": 15431,
        "5510/1/b": 30143,
        "634/6/b": 35669,
        "1758/4/scatter_index": 5125,
        "6235/1/b": 34973,
        "2482/3/b": 9953,
        "5978/1/W": 33249,
        "1260/5/W": 1809,
        "4144/2/b": 21035,
        "5907/1/scatter_index": 32785,
        "4732/1/scatter_index": 24955,
        "765/6/W": 36633,
        "3887/2/W": 19311,
        "2617/3/W": 10851,
        "4824/1/W": 25563,
        "1430/5/scatter_index": 2947,
        "266/7/W": 11133,
        "5549/1/W": 30393,
        "565/6/scatter_index": 31069,
        "3039/3/scatter_index": 13669,
        "3909/2/b": 19463,
        "1186/5/b": 1313,
        "3393/3/b": 16025,
        "3804/2/scatter_index": 18769,
        "3777/2/scatter_index": 18583,
        "2123/4/b": 7565,
        "4330/2/b": 22277,
        "710/6/W": 36273,
        "1866/4/W": 5841,
        "211/7/W": 7473,
        "2721/3/scatter_index": 11551,
        "2694/3/scatter_index": 11365,
        "2803/3/W": 12093,
        "728/6/scatter_index": 36391,
        "28/10/W": 12063,
        "4267/2/scatter_index": 21853,
        "5171/1/b": 27881,
        "5735/1/W": 31635,
        "6078/1/scatter_index": 33925,
        "6105/1/scatter_index": 34111,
        "354/7/b": 17003,
        "3644/2/W": 17697,
        "4369/2/W": 22527,
        "1028/5/scatter_index": 265,
        "5306/1/W": 28779,
        "1372/5/b": 2555,
        "3999/2/b": 20057,
        "3339/3/scatter_index": 15667,
        "2729/3/b": 11597,
        "4936/1/b": 26309,
        "6250/1/scatter_index": 35077,
        "1507/5/W": 3453,
        "5921/1/W": 32877,
        "3150/3/b": 14411,
        "2256/4/scatter_index": 8449,
        "6082/1/b": 33953,
        "2893/3/W": 12687,
        "2994/3/scatter_index": 13363,
        "1623/4/W": 4227,
        "3830/2/W": 18939,
        "1200/5/scatter_index": 1417,
        "1173/5/scatter_index": 1231,
        "2348/4/W": 9057,
        "5230/1/scatter_index": 28279,
        "6217/1/W": 34851,
        "1978/4/b": 6587,
        "4671/1/W": 24543,
        "3189/3/W": 14661,
        "5396/1/W": 29373,
        "2915/3/b": 12839,
        "113/8/scatter_index": 943,
        "1328/5/scatter_index": 2263,
        "4126/2/W": 20913,
        "3547/2/scatter_index": 17053,
        "5847/1/b": 32381,
        "877/5/b": 37379,
        "173/7/scatter_index": 4939,
        "1549/4/b": 3731,
        "3756/2/b": 18443,
        "95/8/scatter_index": 37867,
        "5418/1/b": 29525,
        "4597/1/b": 24047,
        "2650/3/W": 11073,
        "1168/5/W": 1191,
        "1500/5/scatter_index": 3415,
        "1473/5/scatter_index": 3229,
        "3375/3/W": 15903,
        "2105/4/W": 7443,
        "4312/2/W": 22155,
        "2619/3/scatter_index": 10867,
        "5530/1/scatter_index": 30277,
        "5582/1/W": 30615,
        "1536/4/scatter_index": 3649,
        "822/5/b": 37019,
        "3491/2/W": 16677,
        "1735/4/b": 4973,
        "3942/2/b": 19685,
        "5153/1/W": 27759,
        "3847/2/scatter_index": 19051,
        "953/5/W": 37887,
        "5604/1/b": 30767,
        "6329/1/b": 35597,
        "150/8/W": 3405,
        "454/6/W": 23667,
        "2576/3/b": 10577,
        "2764/3/scatter_index": 11833,
        "293/7/scatter_index": 12937,
        "4783/1/b": 25289,
        "3513/2/b": 16829,
        "4238/2/b": 21659,
        "1354/5/W": 2433,
        "6148/1/scatter_index": 34393,
        "915/5/scatter_index": 37639,
        "1681/4/scatter_index": 4615,
        "597/6/b": 33197,
        "4918/1/W": 26187,
        "2919/3/scatter_index": 12865,
        "2195/4/W": 8037,
        "5079/1/b": 27263,
        "1921/4/b": 6215,
        "5830/1/scatter_index": 32275,
        "3132/3/W": 14289,
        "5128/1/scatter_index": 27595,
        "1836/4/scatter_index": 5647,
        "6064/1/W": 33831,
        "2762/3/b": 11819,
        "4045/2/scatter_index": 20377,
        "5694/1/b": 31361,
        "2217/4/b": 8189,
        "4424/2/b": 22901,
        "4810/1/scatter_index": 25477,
        "542/6/b": 29537,
        "5829/1/W": 32259,
        "3058/3/b": 13793,
        "2381/4/W": 9279,
        "5265/1/b": 28505,
        "673/6/W": 36021,
        "1111/5/W": 819,
        "1981/4/scatter_index": 6613,
        "5273/1/scatter_index": 28561,
        "679/6/scatter_index": 36061,
        "6250/1/W": 35073,
        "3738/2/W": 18321,
        "174/7/W": 5001,
        "1466/5/b": 3179,
        "5880/1/b": 32603,
        "2034/4/scatter_index": 6973,
        "2403/4/b": 9431,
        "4579/1/W": 23925,
        "300/7/scatter_index": 13411,
        "5428/1/scatter_index": 29593,
        "1582/4/b": 3953,
        "4345/2/scatter_index": 22375,
        "1037/5/b": 323,
        "3244/3/b": 15035,
        "5451/1/b": 29747,
        "6176/1/b": 34577,
        "2987/3/W": 13311,
        "3262/3/scatter_index": 15157,
        "117/8/W": 1203,
        "1717/4/W": 4851,
        "3924/2/W": 19563,
        "761/6/b": 36611,
        "4085/2/b": 20639,
        "5573/1/scatter_index": 30559,
        "5022/1/b": 26891,
        "262/7/b": 10871,
        "1606/4/scatter_index": 4117,
        "1579/4/scatter_index": 3931,
        "3417/3/scatter_index": 16189,
        "2558/3/W": 10455,
        "4765/1/W": 25167,
        "799/6/scatter_index": 36859,
        "2334/4/scatter_index": 8971,
        "1223/5/b": 1565,
        "3430/3/b": 16277,
        "4553/1/scatter_index": 23761,
        "5728/1/scatter_index": 31591,
        "1251/5/scatter_index": 1753,
        "1903/4/W": 6093,
        "2064/4/b": 7169,
        "4271/2/b": 21881,
        "509/6/b": 27335,
        "480/6/scatter_index": 25405,
        "3001/3/b": 13421,
        "4708/1/scatter_index": 24793,
        "2744/3/W": 11697,
        "4951/1/W": 26409,
        "3469/3/W": 16527,
        "5676/1/W": 31239,
        "3625/2/scatter_index": 17575,
        "4406/2/W": 22779,
        "1906/4/scatter_index": 6115,
        "1879/4/scatter_index": 5929,
        "3585/2/W": 17301,
        "2542/3/scatter_index": 10357,
        "1829/4/b": 5597,
        "643/6/scatter_index": 35827,
        "5247/1/W": 28383,
        "4088/2/scatter_index": 20659,
        "2250/4/b": 8411,
        "4853/1/scatter_index": 25759,
        "1993/4/W": 6687,
        "4877/1/b": 25913,
        "3607/2/b": 17453,
        "2930/3/W": 12939,
        "1448/5/W": 3057,
        "3770/2/scatter_index": 18541,
        "5862/1/W": 32481,
        "3091/3/b": 14015,
        "806/6/scatter_index": 36913,
        "1564/4/W": 3831,
        "3771/2/W": 18543,
        "2289/4/W": 8661,
        "4496/2/W": 23373,
        "2501/3/W": 10083,
        "3925/2/scatter_index": 19573,
        "3898/2/scatter_index": 19387,
        "1019/5/W": 201,
        "3226/3/W": 14913,
        "5433/1/W": 29625,
        "2104/4/scatter_index": 7441,
        "2077/4/scatter_index": 7255,
        "229/7/b": 8669,
        "6071/1/scatter_index": 33883,
        "6158/1/W": 34455,
        "2842/3/scatter_index": 12355,
        "728/6/b": 36389,
        "2856/3/b": 12443,
        "861/5/W": 37275,
        "4067/2/W": 20517,
        "1021/5/scatter_index": 223,
        "4388/2/scatter_index": 22657,
        "5788/1/b": 31985,
        "4518/2/b": 23525,
        "5004/1/W": 26769,
        "1070/5/b": 545,
        "5051/1/scatter_index": 27085,
        "6199/1/scatter_index": 34729,
        "6226/1/scatter_index": 34915,
        "866/5/scatter_index": 37309,
        "3697/2/b": 18047,
        "10/10/W": 69,
        "1750/4/W": 5073,
        "4634/1/b": 24299,
        "2475/4/W": 9903,
        "1149/5/scatter_index": 1069,
        "5359/1/b": 29129,
        "1205/5/W": 1443,
        "3412/3/W": 16155,
        "6344/1/W": 35697,
        "804/6/W": 36897,
        "2591/3/W": 10677,
        "2046/4/W": 7047,
        "4253/2/W": 21759,
        "305/7/W": 13737,
        "5974/1/b": 33227,
        "2404/4/scatter_index": 9439,
        "2377/4/scatter_index": 9253,
        "986/5/scatter_index": 38107,
        "3040/3/scatter_index": 13681,
        "1676/4/b": 4577,
        "3883/2/b": 19289,
        "1321/5/scatter_index": 2221,
        "1294/5/scatter_index": 2035,
        "450/6/b": 23405,
        "2613/3/b": 10829,
        "3338/3/b": 15659,
        "4820/1/b": 25541,
        "251/7/scatter_index": 10141,
        "5094/1/W": 27363,
        "5351/1/scatter_index": 29083,
        "5545/1/b": 30371,
        "1295/5/W": 2037,
        "4179/2/b": 21263,
        "1449/5/scatter_index": 3067,
        "3668/2/scatter_index": 17857,
        "2232/4/W": 8289,
        "5116/1/b": 27515,
        "581/6/W": 32133,
        "4859/1/W": 25791,
        "6101/1/W": 34083,
        "2612/3/scatter_index": 10825,
        "2585/3/scatter_index": 10639,
        "1862/4/b": 5819,
        "3073/3/W": 13893,
        "5280/1/W": 28605,
        "1317/5/b": 2189,
        "4010/2/W": 20145,
        "5731/1/b": 31613,
        "830/5/scatter_index": 37075,
        "3340/3/scatter_index": 15679,
        "828/5/W": 37053,
        "3640/2/b": 17675,
        "2158/4/b": 7793,
        "1481/5/W": 3279,
        "4365/2/b": 22505,
        "5651/1/scatter_index": 31081,
        "5302/1/b": 28757,
        "1657/4/scatter_index": 4453,
        "6027/1/b": 33587,
        "371/7/scatter_index": 18139,
        "2838/3/W": 12321,
        "3968/2/scatter_index": 19855,
        "1052/5/W": 423,
        "168/8/b": 4601,
        "4631/1/scatter_index": 24283,
        "1503/5/b": 3431,
        "3679/2/W": 17925,
        "6191/1/W": 34677,
        "2912/3/scatter_index": 12823,
        "2885/3/scatter_index": 12637,
        "4616/1/W": 24177,
        "4/11/W": 20061,
        "2344/4/b": 9035,
        "5094/1/scatter_index": 27367,
        "6269/1/scatter_index": 35197,
        "916/5/b": 37643,
        "594/6/scatter_index": 33001,
        "6213/1/b": 34829,
        "418/6/scatter_index": 21271,
        "3185/3/b": 14639,
        "417/6/b": 21203,
        "1219/5/scatter_index": 1537,
        "113/8/b": 941,
        "4122/2/b": 20891,
        "1957/4/scatter_index": 6451,
        "31/10/scatter_index": 14071,
        "5249/1/scatter_index": 28399,
        "1658/4/W": 4455,
        "3865/2/W": 19167,
        "5392/1/b": 29351,
        "5951/1/scatter_index": 33079,
        "5956/1/W": 33105,
        "4802/1/W": 25419,
        "4166/2/scatter_index": 21181,
        "548/6/W": 29931,
        "5527/1/W": 30249,
        "4931/1/scatter_index": 26281,
        "757/6/scatter_index": 36583,
        "2499/3/W": 10059,
        "3110/3/scatter_index": 14149,
        "3083/3/scatter_index": 13963,
        "1164/5/b": 1169,
        "3371/3/b": 15881,
        "5394/1/scatter_index": 29365,
        "2101/4/b": 7421,
        "1844/4/W": 5697,
        "4728/1/b": 24923,
        "1519/5/scatter_index": 3535,
        "5713/1/W": 31491,
        "2155/4/scatter_index": 7777,
        "5549/1/scatter_index": 30397,
        "2685/3/W": 11301,
        "4892/1/W": 26013,
        "636/6/b": 35777,
        "3622/2/W": 17553,
        "1072/5/scatter_index": 559,
        "4466/2/scatter_index": 23179,
        "4347/2/W": 22383,
        "1350/5/b": 2411,
        "6009/1/W": 33465,
        "3410/3/scatter_index": 16147,
        "3383/3/scatter_index": 15961,
        "3977/2/b": 19913,
        "767/6/W": 36645,
        "5188/1/W": 27987,
        "2707/3/b": 11453,
        "4914/1/b": 26165,
        "5639/1/b": 30995,
        "2191/4/b": 8015,
        "268/7/W": 11265,
        "5694/1/scatter_index": 31363,
        "5019/1/scatter_index": 26869,
        "1727/4/scatter_index": 4921,
        "142/8/scatter_index": 2875,
        "6060/1/b": 33809,
        "3548/2/b": 17057,
        "2871/3/W": 12543,
        "1389/5/W": 2661,
        "1601/4/W": 4083,
        "2326/4/W": 8913,
        "4533/2/W": 23625,
        "2455/4/scatter_index": 9775,
        "4701/1/scatter_index": 24751,
        "4674/1/scatter_index": 24565,
        "5849/1/scatter_index": 32395,
        "712/6/W": 36285,
        "1956/4/b": 6443,
        "1372/5/scatter_index": 2557,
        "3167/3/W": 14517,
        "3591/2/scatter_index": 17347,
        "213/7/W": 7605,
        "5374/1/W": 29229,
        "4104/2/W": 20769,
        "5825/1/b": 32237,
        "6099/1/W": 34059,
        "4829/1/scatter_index": 25597,
        "2797/3/b": 12047,
        "3008/3/scatter_index": 13465,
        "721/6/scatter_index": 36349,
        "1527/4/b": 3587,
        "3734/2/b": 18299,
        "356/7/b": 17135,
        "4459/2/b": 23129,
        "3746/2/scatter_index": 18379,
