{
    "storage": "model.espresso.weights",
    "analyses": {},
    "properties": {},
    "format_version": 200,
    "metadata_in_weights": [],
    "layers": [
        {
            "nB": 80,
            "top": "Gemm_174",
            "has_biases": 1,
            "weights": {},
            "nC": 320,
            "blob_weights": 3,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "hx_in",
            "blob_biases": 1,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_174",
            "has_prelu": 0
        },
        {
            "top": "285",
            "w": 65,
            "h": 65,
            "name": "285",
            "nd_rank": 2,
            "type": "load_constant",
            "k": 1,
            "bottom": "",
            "debug_info": "",
            "n": 1,
            "weights": {},
            "constant_blob": 5
        },
        {
            "bottom": "x,285",
            "weights": {},
            "debug_info": "",
            "top": "MatMul_0",
            "type": "batch_matmul",
            "name": "MatMul_0",
            "channel_mode": false
        },
        {
            "bottom": "MatMul_0",
            "alpha": -360,
            "operation": 2,
            "weights": {},
            "fused_relu": 0,
            "debug_info": "",
            "top": "Sub_2",
            "type": "elementwise",
            "name": "Sub_2",
            "beta": 0
        },
        {
            "bottom": "Sub_2",
            "alpha": 1,
            "operation": 24,
            "weights": {},
            "fused_relu": 0,
            "debug_info": "",
            "top": "Abs_3",
            "type": "elementwise",
            "name": "Abs_3",
            "beta": 0
        },
        {
            "bottom": "Abs_3",
            "alpha": -180,
            "operation": 2,
            "weights": {},
            "fused_relu": 0,
            "debug_info": "",
            "top": "Sub_5",
            "type": "elementwise",
            "name": "Sub_5",
            "beta": 0
        },
        {
            "bottom": "Sub_5",
            "alpha": 0,
            "operation": 119,
            "weights": {},
            "fused_relu": 0,
            "debug_info": "",
            "top": "Clip_6",
            "type": "elementwise",
            "name": "Clip_6",
            "beta": 1
        },
        {
            "bottom": "Clip_6",
            "alpha": -1,
            "operation": 2,
            "weights": {},
            "fused_relu": 0,
            "debug_info": "",
            "top": "Sub_8",
            "type": "elementwise",
            "name": "Sub_8",
            "beta": 0
        },
        {
            "bottom": "Sub_8",
            "alpha": 360,
            "operation": 3,
            "weights": {},
            "fused_relu": 0,
            "debug_info": "",
            "top": "Mul_10",
            "type": "elementwise",
            "name": "Mul_10",
            "beta": 0
        },
        {
            "bottom": "x,Mul_10",
            "alpha": 1,
            "operation": 0,
            "weights": {},
            "fused_relu": 0,
            "debug_info": "",
            "top": "Add_11",
            "type": "elementwise",
            "name": "Add_11",
            "beta": 0
        },
        {
            "nB": 65,
            "top": "Gemm_12",
            "has_biases": 1,
            "weights": {},
            "nC": 65,
            "blob_weights": 9,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "Add_11",
            "blob_biases": 7,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_12",
            "has_prelu": 0
        },
        {
            "nB": 65,
            "top": "Gemm_20",
            "has_biases": 1,
            "weights": {},
            "nC": 65,
            "blob_weights": 13,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "Gemm_12",
            "blob_biases": 11,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_20",
            "has_prelu": 0
        },
        {
            "bottom": "Gemm_20,Gemm_12",
            "alpha": 1,
            "operation": 1,
            "weights": {},
            "fused_relu": 0,
            "debug_info": "",
            "top": "Mul_21",
            "type": "elementwise",
            "name": "Mul_21",
            "beta": 0
        },
        {
            "top": "286",
            "w": 65,
            "h": 65,
            "name": "286",
            "nd_rank": 2,
            "type": "load_constant",
            "k": 1,
            "bottom": "",
            "debug_info": "",
            "n": 1,
            "weights": {},
            "constant_blob": 15
        },
        {
            "bottom": "Gemm_12,286",
            "weights": {},
            "debug_info": "",
            "top": "MatMul_13",
            "type": "batch_matmul",
            "name": "MatMul_13",
            "channel_mode": false
        },
        {
            "bottom": "MatMul_13",
            "alpha": 0,
            "operation": 119,
            "weights": {},
            "fused_relu": 0,
            "debug_info": "",
            "top": "Clip_14",
            "type": "elementwise",
            "name": "Clip_14",
            "beta": 0.00027777778450399637
        },
        {
            "bottom": "Clip_14",
            "alpha": 10000,
            "operation": 3,
            "weights": {},
            "fused_relu": 0,
            "debug_info": "",
            "top": "Mul_16",
            "type": "elementwise",
            "name": "Mul_16",
            "beta": 0
        },
        {
            "bottom": "Mul_16",
            "alpha": 0,
            "operation": 119,
            "weights": {},
            "fused_relu": 0,
            "debug_info": "",
            "top": "Clip_17",
            "type": "elementwise",
            "name": "Clip_17",
            "beta": 1
        },
        {
            "alpha": -1,
            "bottom": "Clip_17",
            "weights": {},
            "mode": 6,
            "debug_info": "",
            "top": "Sub_19",
            "type": "activation",
            "name": "Sub_19",
            "beta": 0
        },
        {
            "bottom": "Sub_19",
            "alpha": 1,
            "operation": 2,
            "weights": {},
            "fused_relu": 0,
            "debug_info": "",
            "top": "Sub_19_NEW2",
            "type": "elementwise",
            "name": "Sub_19_NEW2",
            "beta": 0
        },
        {
            "bottom": "Mul_21,Sub_19_NEW2",
            "alpha": 1,
            "operation": 1,
            "weights": {},
            "fused_relu": 0,
            "debug_info": "",
            "top": "Mul_22",
            "type": "elementwise",
            "name": "Mul_22",
            "beta": 0
        },
        {
            "nB": 65,
            "top": "Gemm_23",
            "has_biases": 1,
            "weights": {},
            "nC": 65,
            "blob_weights": 19,
            "type": "inner_product",
            "has_relu": 1,
            "bottom": "Mul_22",
            "blob_biases": 17,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_23",
            "has_prelu": 0
        },
        {
            "nB": 65,
            "top": "Gemm_25",
            "has_biases": 1,
            "weights": {},
            "nC": 64,
            "blob_weights": 23,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "Gemm_23",
            "blob_biases": 21,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_25",
            "has_prelu": 0
        },
        {
            "nB": 65,
            "top": "Gemm_26",
            "has_biases": 1,
            "weights": {},
            "nC": 64,
            "blob_weights": 27,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "Mul_22",
            "blob_biases": 25,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_26",
            "has_prelu": 0
        },
        {
            "bottom": "Gemm_25,Gemm_26",
            "alpha": 1,
            "operation": 0,
            "weights": {},
            "fused_relu": 0,
            "debug_info": "",
            "top": "Add_27",
            "type": "elementwise",
            "name": "Add_27",
            "beta": 0
        },
        {
            "nB": 65,
            "top": "Gemm_31",
            "has_biases": 1,
            "weights": {},
            "nC": 64,
            "blob_weights": 31,
            "type": "inner_product",
            "has_relu": 1,
            "bottom": "Mul_22",
            "blob_biases": 29,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_31",
            "has_prelu": 0
        },
        {
            "nB": 64,
            "top": "Gemm_30",
            "has_biases": 1,
            "weights": {},
            "nC": 64,
            "blob_weights": 35,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "Gemm_31",
            "blob_biases": 33,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_30",
            "has_prelu": 0
        },
        {
            "nB": 65,
            "top": "Gemm_31_NEW15",
            "has_biases": 1,
            "weights": {},
            "nC": 64,
            "blob_weights": 39,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "Mul_22",
            "blob_biases": 37,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_31_NEW15",
            "has_prelu": 0
        },
        {
            "bottom": "Gemm_30,Gemm_31_NEW15",
            "alpha": 1,
            "operation": 0,
            "weights": {},
            "fused_relu": 0,
            "debug_info": "",
            "top": "Add_32",
            "type": "elementwise",
            "name": "Add_32",
            "beta": 0
        },
        {
            "bottom": "Add_32,mask",
            "alpha": 1,
            "operation": 1,
            "weights": {},
            "fused_relu": 0,
            "debug_info": "",
            "nd_mode": true,
            "top": "Mul_33",
            "type": "elementwise",
            "name": "Mul_33",
            "beta": 0
        },
        {
            "nB": 64,
            "top": "Gemm_35",
            "has_biases": 1,
            "weights": {},
            "nC": 16,
            "blob_weights": 43,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "Mul_33,Mul_33",
            "blob_biases": 41,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_35",
            "has_prelu": 0
        },
        {
            "axis_mode": 1,
            "bottom": "Gemm_35",
            "weights": {},
            "mode": 0,
            "debug_info": "",
            "use_version": 1,
            "top": "ReduceSum_36",
            "type": "reduce",
            "name": "ReduceSum_36"
        },
        {
            "nB": 65,
            "top": "Gemm_40",
            "has_biases": 1,
            "weights": {},
            "nC": 64,
            "blob_weights": 47,
            "type": "inner_product",
            "has_relu": 1,
            "bottom": "Mul_22",
            "blob_biases": 45,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_40",
            "has_prelu": 0
        },
        {
            "nB": 64,
            "top": "Gemm_39",
            "has_biases": 1,
            "weights": {},
            "nC": 64,
            "blob_weights": 51,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "Gemm_40",
            "blob_biases": 49,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_39",
            "has_prelu": 0
        },
        {
            "nB": 65,
            "top": "Gemm_40_NEW14",
            "has_biases": 1,
            "weights": {},
            "nC": 64,
            "blob_weights": 55,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "Mul_22",
            "blob_biases": 53,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_40_NEW14",
            "has_prelu": 0
        },
        {
            "bottom": "Gemm_39,Gemm_40_NEW14",
            "alpha": 1,
            "operation": 0,
            "weights": {},
            "fused_relu": 0,
            "debug_info": "",
            "top": "Add_41",
            "type": "elementwise",
            "name": "Add_41",
            "beta": 0
        },
        {
            "bottom": "Add_41,mask",
            "alpha": 1,
            "operation": 1,
            "weights": {},
            "fused_relu": 0,
            "debug_info": "",
            "nd_mode": true,
            "top": "Mul_42",
            "type": "elementwise",
            "name": "Mul_42",
            "beta": 0
        },
        {
            "nB": 64,
            "top": "Gemm_44",
            "has_biases": 1,
            "weights": {},
            "nC": 16,
            "blob_weights": 59,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "Mul_42,Mul_42",
            "blob_biases": 57,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_44",
            "has_prelu": 0
        },
        {
            "axis_mode": 1,
            "bottom": "Gemm_44",
            "weights": {},
            "mode": 0,
            "debug_info": "",
            "use_version": 1,
            "top": "ReduceSum_45",
            "type": "reduce",
            "name": "ReduceSum_45"
        },
        {
            "nB": 65,
            "top": "Gemm_49",
            "has_biases": 1,
            "weights": {},
            "nC": 64,
            "blob_weights": 63,
            "type": "inner_product",
            "has_relu": 1,
            "bottom": "Mul_22",
            "blob_biases": 61,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_49",
            "has_prelu": 0
        },
        {
            "nB": 64,
            "top": "Gemm_48",
            "has_biases": 1,
            "weights": {},
            "nC": 64,
            "blob_weights": 67,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "Gemm_49",
            "blob_biases": 65,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_48",
            "has_prelu": 0
        },
        {
            "nB": 65,
            "top": "Gemm_49_NEW13",
            "has_biases": 1,
            "weights": {},
            "nC": 64,
            "blob_weights": 71,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "Mul_22",
            "blob_biases": 69,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_49_NEW13",
            "has_prelu": 0
        },
        {
            "bottom": "Gemm_48,Gemm_49_NEW13",
            "alpha": 1,
            "operation": 0,
            "weights": {},
            "fused_relu": 0,
            "debug_info": "",
            "top": "Add_50",
            "type": "elementwise",
            "name": "Add_50",
            "beta": 0
        },
        {
            "bottom": "Add_50,mask",
            "alpha": 1,
            "operation": 1,
            "weights": {},
            "fused_relu": 0,
            "debug_info": "",
            "nd_mode": true,
            "top": "Mul_51",
            "type": "elementwise",
            "name": "Mul_51",
            "beta": 0
        },
        {
            "nB": 64,
            "top": "Gemm_53",
            "has_biases": 1,
            "weights": {},
            "nC": 16,
            "blob_weights": 75,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "Mul_51,Mul_51",
            "blob_biases": 73,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_53",
            "has_prelu": 0
        },
        {
            "axis_mode": 1,
            "bottom": "Gemm_53",
            "weights": {},
            "mode": 0,
            "debug_info": "",
            "use_version": 1,
            "top": "ReduceSum_54",
            "type": "reduce",
            "name": "ReduceSum_54"
        },
        {
            "nB": 65,
            "top": "Gemm_58",
            "has_biases": 1,
            "weights": {},
            "nC": 64,
            "blob_weights": 79,
            "type": "inner_product",
            "has_relu": 1,
            "bottom": "Mul_22",
            "blob_biases": 77,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_58",
            "has_prelu": 0
        },
        {
            "nB": 64,
            "top": "Gemm_57",
            "has_biases": 1,
            "weights": {},
            "nC": 64,
            "blob_weights": 83,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "Gemm_58",
            "blob_biases": 81,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_57",
            "has_prelu": 0
        },
        {
            "nB": 65,
            "top": "Gemm_58_NEW12",
            "has_biases": 1,
            "weights": {},
            "nC": 64,
            "blob_weights": 87,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "Mul_22",
            "blob_biases": 85,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_58_NEW12",
            "has_prelu": 0
        },
        {
            "bottom": "Gemm_57,Gemm_58_NEW12",
            "alpha": 1,
            "operation": 0,
            "weights": {},
            "fused_relu": 0,
            "debug_info": "",
            "top": "Add_59",
            "type": "elementwise",
            "name": "Add_59",
            "beta": 0
        },
        {
            "bottom": "Add_59,mask",
            "alpha": 1,
            "operation": 1,
            "weights": {},
            "fused_relu": 0,
            "debug_info": "",
            "nd_mode": true,
            "top": "Mul_60",
            "type": "elementwise",
            "name": "Mul_60",
            "beta": 0
        },
        {
            "nB": 64,
            "top": "Gemm_62",
            "has_biases": 1,
            "weights": {},
            "nC": 16,
            "blob_weights": 91,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "Mul_60,Mul_60",
            "blob_biases": 89,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_62",
            "has_prelu": 0
        },
        {
            "axis_mode": 1,
            "bottom": "Gemm_62",
            "weights": {},
            "mode": 0,
            "debug_info": "",
            "use_version": 1,
            "top": "ReduceSum_63",
            "type": "reduce",
            "name": "ReduceSum_63"
        },
        {
            "nB": 65,
            "top": "Gemm_67",
            "has_biases": 1,
            "weights": {},
            "nC": 64,
            "blob_weights": 95,
            "type": "inner_product",
            "has_relu": 1,
            "bottom": "Mul_22",
            "blob_biases": 93,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_67",
            "has_prelu": 0
        },
        {
            "nB": 64,
            "top": "Gemm_66",
            "has_biases": 1,
            "weights": {},
            "nC": 64,
            "blob_weights": 99,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "Gemm_67",
            "blob_biases": 97,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_66",
            "has_prelu": 0
        },
        {
            "nB": 65,
            "top": "Gemm_67_NEW11",
            "has_biases": 1,
            "weights": {},
            "nC": 64,
            "blob_weights": 103,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "Mul_22",
            "blob_biases": 101,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_67_NEW11",
            "has_prelu": 0
        },
        {
            "bottom": "Gemm_66,Gemm_67_NEW11",
            "alpha": 1,
            "operation": 0,
            "weights": {},
            "fused_relu": 0,
            "debug_info": "",
            "top": "Add_68",
            "type": "elementwise",
            "name": "Add_68",
            "beta": 0
        },
        {
            "bottom": "Add_68,mask",
            "alpha": 1,
            "operation": 1,
            "weights": {},
            "fused_relu": 0,
            "debug_info": "",
            "nd_mode": true,
            "top": "Mul_69",
            "type": "elementwise",
            "name": "Mul_69",
            "beta": 0
        },
        {
            "nB": 64,
            "top": "Gemm_71",
            "has_biases": 1,
            "weights": {},
            "nC": 16,
            "blob_weights": 107,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "Mul_69,Mul_69",
            "blob_biases": 105,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_71",
            "has_prelu": 0
        },
        {
            "axis_mode": 1,
            "bottom": "Gemm_71",
            "weights": {},
            "mode": 0,
            "debug_info": "",
            "use_version": 1,
            "top": "ReduceSum_72",
            "type": "reduce",
            "name": "ReduceSum_72"
        },
        {
            "nB": 65,
            "top": "Gemm_76",
            "has_biases": 1,
            "weights": {},
            "nC": 64,
            "blob_weights": 111,
            "type": "inner_product",
            "has_relu": 1,
            "bottom": "Mul_22",
            "blob_biases": 109,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_76",
            "has_prelu": 0
        },
        {
            "nB": 64,
            "top": "Gemm_75",
            "has_biases": 1,
            "weights": {},
            "nC": 64,
            "blob_weights": 115,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "Gemm_76",
            "blob_biases": 113,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_75",
            "has_prelu": 0
        },
        {
            "nB": 65,
            "top": "Gemm_76_NEW10",
            "has_biases": 1,
            "weights": {},
            "nC": 64,
            "blob_weights": 119,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "Mul_22",
            "blob_biases": 117,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_76_NEW10",
            "has_prelu": 0
        },
        {
            "bottom": "Gemm_75,Gemm_76_NEW10",
            "alpha": 1,
            "operation": 0,
            "weights": {},
            "fused_relu": 0,
            "debug_info": "",
            "top": "Add_77",
            "type": "elementwise",
            "name": "Add_77",
            "beta": 0
        },
        {
            "bottom": "Add_77,mask",
            "alpha": 1,
            "operation": 1,
            "weights": {},
            "fused_relu": 0,
            "debug_info": "",
            "nd_mode": true,
            "top": "Mul_78",
            "type": "elementwise",
            "name": "Mul_78",
            "beta": 0
        },
        {
            "nB": 64,
            "top": "Gemm_80",
            "has_biases": 1,
            "weights": {},
            "nC": 16,
            "blob_weights": 123,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "Mul_78,Mul_78",
            "blob_biases": 121,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_80",
            "has_prelu": 0
        },
        {
            "axis_mode": 1,
            "bottom": "Gemm_80",
            "weights": {},
            "mode": 0,
            "debug_info": "",
            "use_version": 1,
            "top": "ReduceSum_81",
            "type": "reduce",
            "name": "ReduceSum_81"
        },
        {
            "nB": 65,
            "top": "Gemm_85",
            "has_biases": 1,
            "weights": {},
            "nC": 64,
            "blob_weights": 127,
            "type": "inner_product",
            "has_relu": 1,
            "bottom": "Mul_22",
            "blob_biases": 125,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_85",
            "has_prelu": 0
        },
        {
            "nB": 64,
            "top": "Gemm_84",
            "has_biases": 1,
            "weights": {},
            "nC": 64,
            "blob_weights": 131,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "Gemm_85",
            "blob_biases": 129,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_84",
            "has_prelu": 0
        },
        {
            "nB": 65,
            "top": "Gemm_85_NEW9",
            "has_biases": 1,
            "weights": {},
            "nC": 64,
            "blob_weights": 135,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "Mul_22",
            "blob_biases": 133,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_85_NEW9",
            "has_prelu": 0
        },
        {
            "bottom": "Gemm_84,Gemm_85_NEW9",
            "alpha": 1,
            "operation": 0,
            "weights": {},
            "fused_relu": 0,
            "debug_info": "",
            "top": "Add_86",
            "type": "elementwise",
            "name": "Add_86",
            "beta": 0
        },
        {
            "bottom": "Add_86,mask",
            "alpha": 1,
            "operation": 1,
            "weights": {},
            "fused_relu": 0,
            "debug_info": "",
            "nd_mode": true,
            "top": "Mul_87",
            "type": "elementwise",
            "name": "Mul_87",
            "beta": 0
        },
        {
            "nB": 64,
            "top": "Gemm_89",
            "has_biases": 1,
            "weights": {},
            "nC": 16,
            "blob_weights": 139,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "Mul_87,Mul_87",
            "blob_biases": 137,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_89",
            "has_prelu": 0
        },
        {
            "axis_mode": 1,
            "bottom": "Gemm_89",
            "weights": {},
            "mode": 0,
            "debug_info": "",
            "use_version": 1,
            "top": "ReduceSum_90",
            "type": "reduce",
            "name": "ReduceSum_90"
        },
        {
            "nB": 65,
            "top": "Gemm_94",
            "has_biases": 1,
            "weights": {},
            "nC": 64,
            "blob_weights": 143,
            "type": "inner_product",
            "has_relu": 1,
            "bottom": "Mul_22",
            "blob_biases": 141,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_94",
            "has_prelu": 0
        },
        {
            "nB": 64,
            "top": "Gemm_93",
            "has_biases": 1,
            "weights": {},
            "nC": 64,
            "blob_weights": 147,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "Gemm_94",
            "blob_biases": 145,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_93",
            "has_prelu": 0
        },
        {
            "nB": 65,
            "top": "Gemm_94_NEW8",
            "has_biases": 1,
            "weights": {},
            "nC": 64,
            "blob_weights": 151,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "Mul_22",
            "blob_biases": 149,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_94_NEW8",
            "has_prelu": 0
        },
        {
            "bottom": "Gemm_93,Gemm_94_NEW8",
            "alpha": 1,
            "operation": 0,
            "weights": {},
            "fused_relu": 0,
            "debug_info": "",
            "top": "Add_95",
            "type": "elementwise",
            "name": "Add_95",
            "beta": 0
        },
        {
            "bottom": "Add_95,mask",
            "alpha": 1,
            "operation": 1,
            "weights": {},
            "fused_relu": 0,
            "debug_info": "",
            "nd_mode": true,
            "top": "Mul_96",
            "type": "elementwise",
            "name": "Mul_96",
            "beta": 0
        },
        {
            "nB": 64,
            "top": "Gemm_98",
            "has_biases": 1,
            "weights": {},
            "nC": 16,
            "blob_weights": 155,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "Mul_96,Mul_96",
            "blob_biases": 153,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_98",
            "has_prelu": 0
        },
        {
            "axis_mode": 1,
            "bottom": "Gemm_98",
            "weights": {},
            "mode": 0,
            "debug_info": "",
            "use_version": 1,
            "top": "ReduceSum_99",
            "type": "reduce",
            "name": "ReduceSum_99"
        },
        {
            "nB": 65,
            "top": "Gemm_103",
            "has_biases": 1,
            "weights": {},
            "nC": 64,
            "blob_weights": 159,
            "type": "inner_product",
            "has_relu": 1,
            "bottom": "Mul_22",
            "blob_biases": 157,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_103",
            "has_prelu": 0
        },
        {
            "nB": 64,
            "top": "Gemm_102",
            "has_biases": 1,
            "weights": {},
            "nC": 64,
            "blob_weights": 163,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "Gemm_103",
            "blob_biases": 161,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_102",
            "has_prelu": 0
        },
        {
            "nB": 65,
            "top": "Gemm_103_NEW7",
            "has_biases": 1,
            "weights": {},
            "nC": 64,
            "blob_weights": 167,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "Mul_22",
            "blob_biases": 165,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_103_NEW7",
            "has_prelu": 0
        },
        {
            "bottom": "Gemm_102,Gemm_103_NEW7",
            "alpha": 1,
            "operation": 0,
            "weights": {},
            "fused_relu": 0,
            "debug_info": "",
            "top": "Add_104",
            "type": "elementwise",
            "name": "Add_104",
            "beta": 0
        },
        {
            "bottom": "Add_104,mask",
            "alpha": 1,
            "operation": 1,
            "weights": {},
            "fused_relu": 0,
            "debug_info": "",
            "nd_mode": true,
            "top": "Mul_105",
            "type": "elementwise",
            "name": "Mul_105",
            "beta": 0
        },
        {
            "nB": 64,
            "top": "Gemm_107",
            "has_biases": 1,
            "weights": {},
            "nC": 16,
            "blob_weights": 171,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "Mul_105,Mul_105",
            "blob_biases": 169,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_107",
            "has_prelu": 0
        },
        {
            "axis_mode": 1,
            "bottom": "Gemm_107",
            "weights": {},
            "mode": 0,
            "debug_info": "",
            "use_version": 1,
            "top": "ReduceSum_108",
            "type": "reduce",
            "name": "ReduceSum_108"
        },
        {
            "nB": 65,
            "top": "Gemm_112",
            "has_biases": 1,
            "weights": {},
            "nC": 64,
            "blob_weights": 175,
            "type": "inner_product",
            "has_relu": 1,
            "bottom": "Mul_22",
            "blob_biases": 173,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_112",
            "has_prelu": 0
        },
        {
            "nB": 64,
            "top": "Gemm_111",
            "has_biases": 1,
            "weights": {},
            "nC": 64,
            "blob_weights": 179,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "Gemm_112",
            "blob_biases": 177,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_111",
            "has_prelu": 0
        },
        {
            "nB": 65,
            "top": "Gemm_112_NEW6",
            "has_biases": 1,
            "weights": {},
            "nC": 64,
            "blob_weights": 183,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "Mul_22",
            "blob_biases": 181,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_112_NEW6",
            "has_prelu": 0
        },
        {
            "bottom": "Gemm_111,Gemm_112_NEW6",
            "alpha": 1,
            "operation": 0,
            "weights": {},
            "fused_relu": 0,
            "debug_info": "",
            "top": "Add_113",
            "type": "elementwise",
            "name": "Add_113",
            "beta": 0
        },
        {
            "bottom": "Add_113,mask",
            "alpha": 1,
            "operation": 1,
            "weights": {},
            "fused_relu": 0,
            "debug_info": "",
            "nd_mode": true,
            "top": "Mul_114",
            "type": "elementwise",
            "name": "Mul_114",
            "beta": 0
        },
        {
            "nB": 64,
            "top": "Gemm_116",
            "has_biases": 1,
            "weights": {},
            "nC": 16,
            "blob_weights": 187,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "Mul_114,Mul_114",
            "blob_biases": 185,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_116",
            "has_prelu": 0
        },
        {
            "axis_mode": 1,
            "bottom": "Gemm_116",
            "weights": {},
            "mode": 0,
            "debug_info": "",
            "use_version": 1,
            "top": "ReduceSum_117",
            "type": "reduce",
            "name": "ReduceSum_117"
        },
        {
            "nB": 65,
            "top": "Gemm_121",
            "has_biases": 1,
            "weights": {},
            "nC": 64,
            "blob_weights": 191,
            "type": "inner_product",
            "has_relu": 1,
            "bottom": "Mul_22",
            "blob_biases": 189,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_121",
            "has_prelu": 0
        },
        {
            "nB": 64,
            "top": "Gemm_120",
            "has_biases": 1,
            "weights": {},
            "nC": 64,
            "blob_weights": 195,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "Gemm_121",
            "blob_biases": 193,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_120",
            "has_prelu": 0
        },
        {
            "nB": 65,
            "top": "Gemm_121_NEW5",
            "has_biases": 1,
            "weights": {},
            "nC": 64,
            "blob_weights": 199,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "Mul_22",
            "blob_biases": 197,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_121_NEW5",
            "has_prelu": 0
        },
        {
            "bottom": "Gemm_120,Gemm_121_NEW5",
            "alpha": 1,
            "operation": 0,
            "weights": {},
            "fused_relu": 0,
            "debug_info": "",
            "top": "Add_122",
            "type": "elementwise",
            "name": "Add_122",
            "beta": 0
        },
        {
            "bottom": "Add_122,mask",
            "alpha": 1,
            "operation": 1,
            "weights": {},
            "fused_relu": 0,
            "debug_info": "",
            "nd_mode": true,
            "top": "Mul_123",
            "type": "elementwise",
            "name": "Mul_123",
            "beta": 0
        },
        {
            "nB": 64,
            "top": "Gemm_125",
            "has_biases": 1,
            "weights": {},
            "nC": 16,
            "blob_weights": 203,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "Mul_123,Mul_123",
            "blob_biases": 201,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_125",
            "has_prelu": 0
        },
        {
            "axis_mode": 1,
            "bottom": "Gemm_125",
            "weights": {},
            "mode": 0,
            "debug_info": "",
            "use_version": 1,
            "top": "ReduceSum_126",
            "type": "reduce",
            "name": "ReduceSum_126"
        },
        {
            "nB": 65,
            "top": "Gemm_130",
            "has_biases": 1,
            "weights": {},
            "nC": 64,
            "blob_weights": 207,
            "type": "inner_product",
            "has_relu": 1,
            "bottom": "Mul_22",
            "blob_biases": 205,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_130",
            "has_prelu": 0
        },
        {
            "nB": 64,
            "top": "Gemm_129",
            "has_biases": 1,
            "weights": {},
            "nC": 64,
            "blob_weights": 211,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "Gemm_130",
            "blob_biases": 209,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_129",
            "has_prelu": 0
        },
        {
            "nB": 65,
            "top": "Gemm_130_NEW4",
            "has_biases": 1,
            "weights": {},
            "nC": 64,
            "blob_weights": 215,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "Mul_22",
            "blob_biases": 213,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_130_NEW4",
            "has_prelu": 0
        },
        {
            "bottom": "Gemm_129,Gemm_130_NEW4",
            "alpha": 1,
            "operation": 0,
            "weights": {},
            "fused_relu": 0,
            "debug_info": "",
            "top": "Add_131",
            "type": "elementwise",
            "name": "Add_131",
            "beta": 0
        },
        {
            "bottom": "Add_131,mask",
            "alpha": 1,
            "operation": 1,
            "weights": {},
            "fused_relu": 0,
            "debug_info": "",
            "nd_mode": true,
            "top": "Mul_132",
            "type": "elementwise",
            "name": "Mul_132",
            "beta": 0
        },
        {
            "nB": 64,
            "top": "Gemm_134",
            "has_biases": 1,
            "weights": {},
            "nC": 16,
            "blob_weights": 219,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "Mul_132,Mul_132",
            "blob_biases": 217,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_134",
            "has_prelu": 0
        },
        {
            "axis_mode": 1,
            "bottom": "Gemm_134",
            "weights": {},
            "mode": 0,
            "debug_info": "",
            "use_version": 1,
            "top": "ReduceSum_135",
            "type": "reduce",
            "name": "ReduceSum_135"
        },
        {
            "nB": 65,
            "top": "Gemm_139",
            "has_biases": 1,
            "weights": {},
            "nC": 64,
            "blob_weights": 223,
            "type": "inner_product",
            "has_relu": 1,
            "bottom": "Mul_22",
            "blob_biases": 221,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_139",
            "has_prelu": 0
        },
        {
            "nB": 64,
            "top": "Gemm_138",
            "has_biases": 1,
            "weights": {},
            "nC": 64,
            "blob_weights": 227,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "Gemm_139",
            "blob_biases": 225,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_138",
            "has_prelu": 0
        },
        {
            "nB": 65,
            "top": "Gemm_139_NEW3",
            "has_biases": 1,
            "weights": {},
            "nC": 64,
            "blob_weights": 231,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "Mul_22",
            "blob_biases": 229,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_139_NEW3",
            "has_prelu": 0
        },
        {
            "bottom": "Gemm_138,Gemm_139_NEW3",
            "alpha": 1,
            "operation": 0,
            "weights": {},
            "fused_relu": 0,
            "debug_info": "",
            "top": "Add_140",
            "type": "elementwise",
            "name": "Add_140",
            "beta": 0
        },
        {
            "bottom": "Add_140,mask",
            "alpha": 1,
            "operation": 1,
            "weights": {},
            "fused_relu": 0,
            "debug_info": "",
            "nd_mode": true,
            "top": "Mul_141",
            "type": "elementwise",
            "name": "Mul_141",
            "beta": 0
        },
        {
            "nB": 64,
            "top": "Gemm_143",
            "has_biases": 1,
            "weights": {},
            "nC": 16,
            "blob_weights": 235,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "Mul_141,Mul_141",
            "blob_biases": 233,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_143",
            "has_prelu": 0
        },
        {
            "axis_mode": 1,
            "bottom": "Gemm_143",
            "weights": {},
            "mode": 0,
            "debug_info": "",
            "use_version": 1,
            "top": "ReduceSum_144",
            "type": "reduce",
            "name": "ReduceSum_144"
        },
        {
            "nB": 65,
            "top": "Gemm_148",
            "has_biases": 1,
            "weights": {},
            "nC": 64,
            "blob_weights": 239,
            "type": "inner_product",
            "has_relu": 1,
            "bottom": "Mul_22",
            "blob_biases": 237,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_148",
            "has_prelu": 0
        },
        {
            "nB": 64,
            "top": "Gemm_147",
            "has_biases": 1,
            "weights": {},
            "nC": 64,
            "blob_weights": 243,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "Gemm_148",
            "blob_biases": 241,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_147",
            "has_prelu": 0
        },
        {
            "nB": 65,
            "top": "Gemm_148_NEW2",
            "has_biases": 1,
            "weights": {},
            "nC": 64,
            "blob_weights": 247,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "Mul_22",
            "blob_biases": 245,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_148_NEW2",
            "has_prelu": 0
        },
        {
            "bottom": "Gemm_147,Gemm_148_NEW2",
            "alpha": 1,
            "operation": 0,
            "weights": {},
            "fused_relu": 0,
            "debug_info": "",
            "top": "Add_149",
            "type": "elementwise",
            "name": "Add_149",
            "beta": 0
        },
        {
            "bottom": "Add_149,mask",
            "alpha": 1,
            "operation": 1,
            "weights": {},
            "fused_relu": 0,
            "debug_info": "",
            "nd_mode": true,
            "top": "Mul_150",
            "type": "elementwise",
            "name": "Mul_150",
            "beta": 0
        },
        {
            "nB": 64,
            "top": "Gemm_152",
            "has_biases": 1,
            "weights": {},
            "nC": 16,
            "blob_weights": 251,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "Mul_150,Mul_150",
            "blob_biases": 249,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_152",
            "has_prelu": 0
        },
        {
            "axis_mode": 1,
            "bottom": "Gemm_152",
            "weights": {},
            "mode": 0,
            "debug_info": "",
            "use_version": 1,
            "top": "ReduceSum_153",
            "type": "reduce",
            "name": "ReduceSum_153"
        },
        {
            "nB": 65,
            "top": "Gemm_157",
            "has_biases": 1,
            "weights": {},
            "nC": 64,
            "blob_weights": 255,
            "type": "inner_product",
            "has_relu": 1,
            "bottom": "Mul_22",
            "blob_biases": 253,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_157",
            "has_prelu": 0
        },
        {
            "nB": 64,
            "top": "Gemm_156",
            "has_biases": 1,
            "weights": {},
            "nC": 64,
            "blob_weights": 259,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "Gemm_157",
            "blob_biases": 257,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_156",
            "has_prelu": 0
        },
        {
            "nB": 65,
            "top": "Gemm_157_NEW1",
            "has_biases": 1,
            "weights": {},
            "nC": 64,
            "blob_weights": 263,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "Mul_22",
            "blob_biases": 261,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_157_NEW1",
            "has_prelu": 0
        },
        {
            "bottom": "Gemm_156,Gemm_157_NEW1",
            "alpha": 1,
            "operation": 0,
            "weights": {},
            "fused_relu": 0,
            "debug_info": "",
            "top": "Add_158",
            "type": "elementwise",
            "name": "Add_158",
            "beta": 0
        },
        {
            "bottom": "Add_158,mask",
            "alpha": 1,
            "operation": 1,
            "weights": {},
            "fused_relu": 0,
            "debug_info": "",
            "nd_mode": true,
            "top": "Mul_159",
            "type": "elementwise",
            "name": "Mul_159",
            "beta": 0
        },
        {
            "nB": 64,
            "top": "Gemm_161",
            "has_biases": 1,
            "weights": {},
            "nC": 16,
            "blob_weights": 267,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "Mul_159,Mul_159",
            "blob_biases": 265,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_161",
            "has_prelu": 0
        },
        {
            "axis_mode": 1,
            "bottom": "Gemm_161",
            "weights": {},
            "mode": 0,
            "debug_info": "",
            "use_version": 1,
            "top": "ReduceSum_162",
            "type": "reduce",
            "name": "ReduceSum_162"
        },
        {
            "nB": 65,
            "top": "Gemm_163",
            "has_biases": 1,
            "weights": {},
            "nC": 64,
            "blob_weights": 271,
            "type": "inner_product",
            "has_relu": 1,
            "bottom": "Mul_22",
            "blob_biases": 269,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_163",
            "has_prelu": 0
        },
        {
            "nB": 64,
            "top": "Gemm_165",
            "has_biases": 1,
            "weights": {},
            "nC": 64,
            "blob_weights": 275,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "Gemm_163",
            "blob_biases": 273,
            "has_tanh": 0,
            "debug_info": "",
            "name": "Gemm_165",
            "has_prelu": 0
        },
        {
            "nB": 65,
            "top": "Gemm_163_NEW0",
            "has_biases": 1,
            "weights": {},
            "nC": 64,
            "blob_weights": 279,
            "type": "inner_product",
            "has_relu": 0,
            "bottom": "Mul_22",
