{
  "storage" : "model.espresso.weights",
  "analyses" : {

  },
  "properties" : {

  },
  "format_version" : 200,
  "metadata_in_weights" : [

  ],
  "layers" : [
    {
      "bottom" : "",
      "k" : 1,
      "n" : 1,
      "weights" : {

      },
      "h" : 1,
      "debug_info" : "less_0",
      "constant_blob" : 1,
      "top" : "less_0_load_constant_1",
      "w" : 1,
      "type" : "load_constant",
      "name" : "less_0_load_constant_1"
    },
    {
      "bottom" : "highlightDateSecondsBeforeNow,less_0_load_constant_1",
      "alpha" : 1,
      "operation" : 103,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "less_0",
      "top" : "less_0",
      "type" : "elementwise",
      "name" : "less_0",
      "beta" : 0
    },
    {
      "bottom" : "",
      "k" : 1,
      "n" : 1,
      "weights" : {

      },
      "h" : 1,
      "debug_info" : "greater_equal_0",
      "constant_blob" : 3,
      "top" : "greater_equal_0_load_constant_2",
      "w" : 1,
      "type" : "load_constant",
      "name" : "greater_equal_0_load_constant_2"
    },
    {
      "bottom" : "earliestEngagementSecondsBeforeNow,greater_equal_0_load_constant_2",
      "alpha" : 1,
      "operation" : 106,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "greater_equal_0",
      "top" : "greater_equal_0",
      "type" : "elementwise",
      "name" : "greater_equal_0",
      "beta" : 0
    },
    {
      "bottom" : "",
      "k" : 1,
      "n" : 1,
      "weights" : {

      },
      "h" : 1,
      "debug_info" : "less_equal_0",
      "constant_blob" : 5,
      "top" : "less_equal_0_load_constant_3",
      "w" : 1,
      "type" : "load_constant",
      "name" : "less_equal_0_load_constant_3"
    },
    {
      "bottom" : "earliestEngagementSecondsBeforeNow,less_equal_0_load_constant_3",
      "alpha" : 1,
      "operation" : 104,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "less_equal_0",
      "top" : "less_equal_0",
      "type" : "elementwise",
      "name" : "less_equal_0",
      "beta" : 0
    },
    {
      "bottom" : "greater_equal_0,less_equal_0",
      "alpha" : 1,
      "operation" : 111,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "logical_or_0",
      "top" : "logical_or_0",
      "type" : "elementwise",
      "name" : "logical_or_0",
      "beta" : 0
    },
    {
      "bottom" : "less_0,logical_or_0",
      "alpha" : 1,
      "operation" : 110,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "logical_and_0",
      "top" : "logical_and_0",
      "type" : "elementwise",
      "name" : "logical_and_0",
      "beta" : 0
    },
    {
      "bottom" : "isManuallySyndicated,logical_and_0",
      "alpha" : 1,
      "operation" : 110,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "logical_and_1",
      "top" : "logical_and_1",
      "type" : "elementwise",
      "name" : "logical_and_1",
      "beta" : 0
    },
    {
      "bottom" : "logical_and_1",
      "alpha" : 16,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "mul_0",
      "top" : "mul_0",
      "type" : "elementwise",
      "name" : "mul_0",
      "beta" : 0
    },
    {
      "bottom" : "highlightDateSecondsBeforeNow",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "add_0",
      "top" : "add_0",
      "type" : "elementwise",
      "name" : "add_0",
      "beta" : 0
    },
    {
      "top" : "real_div_0_x_0",
      "w" : 1,
      "h" : 1,
      "name" : "real_div_0_x_0",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "real_div_0_x_0",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 7
    },
    {
      "bottom" : "real_div_0_x_0,add_0",
      "alpha" : 1,
      "operation" : 102,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "real_div_0",
      "nd_mode" : true,
      "top" : "real_div_0",
      "type" : "elementwise",
      "name" : "real_div_0",
      "beta" : 0
    },
    {
      "bottom" : "real_div_0",
      "alpha" : 3,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "mul_1",
      "top" : "mul_1",
      "type" : "elementwise",
      "name" : "mul_1",
      "beta" : 0
    },
    {
      "bottom" : "mul_1,mul_0",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "add_1",
      "top" : "add_1",
      "type" : "elementwise",
      "name" : "add_1",
      "beta" : 0
    },
    {
      "bottom" : "",
      "k" : 1,
      "n" : 1,
      "weights" : {

      },
      "h" : 1,
      "debug_info" : "less_equal_1",
      "constant_blob" : 9,
      "top" : "less_equal_1_load_constant_13",
      "w" : 1,
      "type" : "load_constant",
      "name" : "less_equal_1_load_constant_13"
    },
    {
      "bottom" : "earliestEngagementSecondsBeforeNow,less_equal_1_load_constant_13",
      "alpha" : 1,
      "operation" : 104,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "less_equal_1",
      "top" : "less_equal_1",
      "type" : "elementwise",
      "name" : "less_equal_1",
      "beta" : 0
    },
    {
      "bottom" : "less_equal_1,earliestEngagementSecondsBeforeNow,highlightDateSecondsBeforeNow",
      "alpha" : 1,
      "operation" : 101,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "select_0",
      "nd_mode" : true,
      "top" : "select_0",
      "type" : "elementwise",
      "name" : "select_0",
      "beta" : 0
    },
    {
      "bottom" : "isManuallySyndicated,select_0,creationDateSecondsBeforeNow",
      "alpha" : 1,
      "operation" : 101,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "select_1",
      "nd_mode" : true,
      "top" : "select_1",
      "type" : "elementwise",
      "name" : "select_1",
      "beta" : 0
    },
    {
      "bottom" : "select_1",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "add_2",
      "top" : "add_2",
      "type" : "elementwise",
      "name" : "add_2",
      "beta" : 0
    },
    {
      "top" : "real_div_1_x_0",
      "w" : 1,
      "h" : 1,
      "name" : "real_div_1_x_0",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "real_div_1_x_0",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 11
    },
    {
      "bottom" : "real_div_1_x_0,add_2",
      "alpha" : 1,
      "operation" : 102,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "real_div_1",
      "nd_mode" : true,
      "top" : "real_div_1",
      "type" : "elementwise",
      "name" : "real_div_1",
      "beta" : 0
    },
    {
      "bottom" : "real_div_1",
      "alpha" : 2,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "mul_2",
      "top" : "mul_2",
      "type" : "elementwise",
      "name" : "mul_2",
      "beta" : 0
    },
    {
      "bottom" : "logical_and_1,add_1,mul_2",
      "alpha" : 1,
      "operation" : 101,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "select_2",
      "nd_mode" : true,
      "top" : "select_2",
      "type" : "elementwise",
      "name" : "select_2",
      "beta" : 0
    },
    {
      "bottom" : "select_2",
      "alpha" : 0.033333335071802139,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "_inversed_real_div_2",
      "top" : "_inversed_real_div_2",
      "type" : "elementwise",
      "name" : "_inversed_real_div_2",
      "beta" : 0
    },
    {
      "bottom" : "",
      "k" : 1,
      "n" : 1,
      "weights" : {

      },
      "h" : 1,
      "debug_info" : "greater_0",
      "constant_blob" : 13,
      "top" : "greater_0_load_constant_22",
      "w" : 1,
      "type" : "load_constant",
      "name" : "greater_0_load_constant_22"
    },
    {
      "bottom" : "countHiddenInInterval:8760.0,greater_0_load_constant_22",
      "alpha" : 1,
      "operation" : 105,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "greater_0",
      "top" : "greater_0",
      "type" : "elementwise",
      "name" : "greater_0",
      "beta" : 0
    },
    {
      "bottom" : "greater_0",
      "alpha" : -1000,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "mul_3",
      "top" : "mul_3",
      "type" : "elementwise",
      "name" : "mul_3",
      "beta" : 0
    },
    {
      "bottom" : "mul_3,_inversed_real_div_2",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "add_3",
      "top" : "add_3",
      "type" : "elementwise",
      "name" : "add_3",
      "beta" : 0
    },
    {
      "bottom" : "isManuallySyndicated",
      "alpha" : 1,
      "operation" : 112,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "logical_not_0",
      "top" : "logical_not_0",
      "type" : "elementwise",
      "name" : "logical_not_0",
      "beta" : 0
    },
    {
      "bottom" : "logical_not_0,sentFromMe",
      "alpha" : 1,
      "operation" : 110,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "logical_and_2",
      "top" : "logical_and_2",
      "type" : "elementwise",
      "name" : "logical_and_2",
      "beta" : 0
    },
    {
      "top" : "select_3_a_0",
      "w" : 1,
      "h" : 1,
      "name" : "select_3_a_0",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "select_3_a_0",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 15
    },
    {
      "bottom" : "logical_and_2,select_3_a_0,add_3",
      "alpha" : 1,
      "operation" : 101,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "select_3",
      "nd_mode" : true,
      "top" : "select_3",
      "type" : "elementwise",
      "name" : "select_3",
      "beta" : 0
    },
    {
      "top" : "score_x_0",
      "w" : 1,
      "h" : 1,
      "name" : "score_x_0",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "score_x_0",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 17
    },
    {
      "name" : "score",
      "fused_relu" : 0,
      "beta" : 0,
      "operation" : 22,
      "type" : "elementwise",
      "alpha" : 1,
      "attributes" : {
        "is_output" : 1
      },
      "bottom" : "score_x_0,select_3",
      "debug_info" : "score",
      "nd_mode" : true,
      "weights" : {

      },
      "top" : "score"
    }
  ]
}