<pad>
<s>
</s>
<unk>
<
 
=
_
.
>
코
소
보
무
법
천
지
매
주
명
사
망
/
(
프
리
슈
티
나
-
연
합
뉴
스
)
유
고
방
에
서
포
화
가
멈
췄
음
도
불
구
하
치
안
이
확
되
못
한
데
따
른
자
달
있
다
제
미
셰
북
대
양
조
약
기
토
변
인
일
밝
혔
은
날
세
르
비
아
정
교
회
폭
발
건
생
실
을
시
범
들
단
죄
할
률
및
템
부
족
말
했
그
는
의
현
상
황
해
과
질
재
로
경
찰
력
설
군
둔
만
훌
륭
관
러
심
각
앙
적
것
니
라
면
감
럽
게
량
죽
어
으
통
능
강
엔
내
중
파
견
계
획
며
민
위
훈
련
원
편
난
밤
블
레
영
국
총
문
마
친
후
수
간
탄
개
터
졌
피
직
없
전
앞
번
초
외
곽
농
살
등
알
바
역
종
청
행
호
우
책
본
울
성
홍
오
집
숨
잠
됐
택
채
침
돼
철
특
히
또
를
롯
,
두
절
운
던
선
곡
께
복
완
료
될
예
산
물
빠
져
야
작
업
김
동
춘
공
급
끊
겼
취
장
거
신
닭
폐
축
잇
랐
당
된
려
진
박
봉
읍
씨
줄
었
여
맹
찬
형
휴
틀
최
넘
쏟
댐
붕
괴
임
류
차
람
백
학
남
왕
징
송
와
태
근
래
입
년
월
째
촌
덮
쳐
낚
객
분
평
육
룡
속
병
흙
더
깔
용
식
품
뤄
않
큰
겪
락
긴
떨
뜬
눈
샜
올
림
픽
모
항
척
늘
갑
런
텔
옥
투
숙
립
트
타
륙
충
령
까
풍
반
향
칠
닐
새
벽
필
핀
얀
섬
승
추
써
같
카
머
익
많
때
루
늦
출
테
잉
목
버
욕
크
둘
싸
갈
빚
처
드
별
린
끝
떠
놀
혹
창
잡
뷰
참
담
겨
격
퍼
활
너
독
존
록
허
손
켰
배
키
함
권
빌
클
턴
켜
웠
탈
환
슬
측
압
탱
몰
냈
름
점
표
응
쪽
악
샤
략
요
퇴
규
빼
앗
았
센
왔
흘
판
셔
곳
네
랍
룹
갖
순
금
체
협
얻
열
릴
벌
온
높
꺼
돌
억
증
빈
씀
커
섰
돈
닥
덜
솟
쓴
쳤
흑
쪼
럼
골
캘
캐
듀
콤
메
저
첫
톱
즌
ㅤ
ㅂ
막
극
디
언
케
뷔
쟁
쿠
굳
베
홀
뒷
휘
흔
결
준
렀
펄
패
앤
젤
닝
줬
팀
묵
움
애
몬
뒤
율
끌
렸
암
맑
끔
흐
멜
콕
멕
브
뤼
셀
델
페
노
샌
란
랑
푸
싱
톡
콩
룰
헤
쿄
콸
룸
론
밴
워
값
득
땅
빅
플
컨
션
혼
궈
였
엇
윌
컷
똑
끼
팬
폰
답
글
볍
옹
누
:
촉
례
흥
덧
붙
랜
즘
맺
났
셉
겠
즉
염
훨
씬
냉
풀
꺾
낮
녀
희
섭
팔
밀
논
쇠
석
잔
냥
뭔
액
험
술
츠
릭
뱅
접
혀
흡
덴
럭
슨
솔
빨
핑
념
싶
혁
좋
받
효
혜
널
갔
엄
느
색
큼
떤
넣
든
긍
웃
핵
킬
램
괄
광
뢰
옛
댈
깨
닫
힘
꾸
벗
십
걸
쇄
길
걷
좌
팍
탐
첨
갭
층
털
깥
착
놓
튼
렇
믿
햇
볕
삶
ㅁ
맛
궁
뱉
찍
뿐
욱
렘
엘
맞
렬
깊
냐
닌
밑
씩
얼
맥
옮
융
낸
앉
홈
밖
뽑
덕
헌
뜨
삼
잘
왼
습
볼
넨
먼
곤
납
곧
럴
갓
멩
짐
쌀
즈
랭
렁
녁
힐
혈
좀
끈
펼
찾
챔
봅
벨
픈
킹
옷
멘
검
랄
낙
옵
횡
탑
콘
뚱
펑
켓
랙
눠
헬
콥
잭
셸
룬
륜
훙
펜
폴
뇌
ㅇ
ㅏ
ㅎ
펴
낼
딜
껴
찌
랴
렵
몸
넋
웅
윤
균
닉
듭
짓
흠
귀
춰
쉬
칙
쓰
왈
묻
뚜
렷
싼
링
듯
룽
밍
탠
쩌
팡
탁
틱
먹
뮌
헨
컬
갤
쌓
푼
굴
킨
윈
긁
힌
칩
팎
띨
롱
덩
휩
쓸
좁
꼴
섯
켈
짜
묘
둑
꼽
벵
딩
몇
꿈
쉽
옆
쁜
뜻
뗐
슐
롤
첸
녜
쑨
옌
챈
벤
칭
꼭
뛸
므
엽
슷
뀌
돕
젖
옴
뭄
댄
떼
탕
콜
봤
겹
뿌
끄
빙
젊
틴
ㄲ
ㅡ
틋
$
컵
젠
톈
쿤
옐
얹
닛
혐
쩍
뿜
딪
둥
첩
샛
쏘
쯤
됨
ㄱ
ㅜ
ㅊ
퉁
룩
녹
걀
갇
렌
쫓
롬
쿨
멤
묶
벰
칸
붐
볐
깬
삭
딘
핫
겸
꼈
뤘
쏜
셋
팰
꿔
띄
컴
퓨
헛
갚
끗
랫
텁
릉
슴
햄
딸
빛
잦
흉
ㅣ
썩
펠
캠
첼
샬
쌍
롭
!
왜
덥
잖
뮈
눌
팩
님
칼
켄
듣
땀
띤
낱
봄
빗
릅
긋
렴
뭐
싹
틔
덤
멸
짙
쾌
낌
졸
맡
삐
꺽
낭
촘
툼
읽
셈
톰
&
;
컸
앨
캔
텍
떻
릿
뮤
펀
겐
쇼
씻
줘
갹
꽉
뜩
틈
슛
킥
ㄸ
찔
릎
랠
귤
샹
챙
릇
킴
쏠
괌
뺀
흩
둬
넌
팻
늠
밥
뛰
냄
헴
횔
넓
듬
녔
낡
닿
샘
돗
븐
쑤
봐
핸
뒀
숫
촛
쯔
뎌
띠
쿼
늄
톨
섹
쁘
팅
넷
캡
뻔
믹
찮
꼬
뻗
숲
륨
닷
탤
셜
ㅗ
쥐
붉
뇨
낳
콧
뷴
엥
깃
뛴
얽
헐
뜯
잣
넬
칫
톤
맨
찡
젝
걱
멀
딴
깎
넙
꿍
몽
촨
녕
샀
밸
촬
헝
콰
텃
밭
깝
탓
숭
떳
낄
텐
맏
팝
렛
ㅉ
ㅈ
짧
됩
맬
튀
컫
흰
굶
틸
횟
짚
벼
렉
숍
탬
둠
큐
춤
츰
겁
곶
꾼
즐
뽀
쑥
샐
굿
쉰
젓
앰
꼼
뼈
홋
쁨
섞
찼
밟
싣
엠
짝
퀵
툰
뙤
찜
샅
갱
꽃
썰
딥
쥔
땐
빔
돔
훔
엑
폼
튜
턱
팁
낵
썼
엉
샨
멋
낀
렐
몄
벳
붓
튿
곁
놔
퉈
탯
놈
캄
빵
쵸
캉
숴
텀
늙
퀴
몹
뗀
뱃
툴
콴
땄
봇
뗏
퀸
럿
ㄷ
덱
핼
놨
굽
힙
ㄴ
ㅠ
댜
숀
펙
퍅
ㅐ
뉘
윙
썽
듐
눅
굵
꿀
짢
뭉
탔
굉
펩
헵
꾀
헥
핍
ㅛ
툐
랬
뽕
킷
롄
깁
핏
뷘
앵
휼
돋
샷
벙
죌
왓
섣
퐁
줌
렙
셤
겉
잼
겔
횃
뿔
눴
닦
뎀
슝
죠
낫
밋
웡
딧
뺄
볜
픔
쾰
왁
땠
떡
맷
갯
윷
얄
뷜
꿋
팜
벡
엎
쿵
귄
뉜
멍
댓
쾨
쌌
깜
빡
뭘
궐
넵
첵
텅
엷
줍
펌
큘
퀀
쾅
삽
몫
낯
켠
겅
팽
젼
켤
퀑
뎐
쑹
ㅅ
퓰
텄
찢
땋
웍
깅
곱
휠
뀐
쩨
껑
늬
딕
샴
늪
댔
겜
뚝
힝
갬
뽐
슘
싯
좇
뺌
셨
괜
홉
찻
뭇
숱
삿
슭
겟
륀
깻
냇
둡
괘
돛
ㅕ
ㅑ
넥
늑
땔
쉴
솨
솜
깐
욜
잰
넴
젭
꿉
퍄
칵
퀼
엿
쩔
ㅖ
윔
뱌
뺨
윗
랏
캇
뤽
맴
얏
꿨
딛
잊
멧
굘
씌
맙
룻
먀
왑
엮
뻬
ㅍ
ㅢ
ㅋ
묜
'
《
》
~
훗
‘
’
%
*
『
』
「
」
?
웬
끓
웨
잎
–
숯
쭈
쉐
〈
〉
쥬
잃
뱀
|
・
냅
댑
녘
궤
`
싫
팸
훤
웁
얇
꽝
깡
섐
+
삯
곰
휜
덟
솥
팟
웰
앎
듈
넜
짠
웹
퓌
뮐
걔
쨌
퀄
앓
옳
탰
닮
∼
벅
맘
츄
츳
얘
묀
ㅚ
퀘
쟈
뜸
一
넛
곗
뜰
흄
훼
#
젬
켐
핥
슥
엾
딤
귓
햅
캬
꼰
랩
챌
츨
쳄
숏
쏴
딱
짱
볏
쭉
늴
펭
셴
푈
펫
솀
빴
푹
껍
캅
욘
—
튬
뮬
뢴
짤
뎬
꽤
뚫
찿
뱍
앱
닙
뻐
쿡
뎠
풋
졜
쩐
즙
맵
잿
씹
옅
퓐
얕
깼
핌
캴
ㆍ
셧
닸
샵
텡
쥘
껏
찐
찹
븀
갠
엡
꽂
폈
엣
넝
앳
읜
켁
뎅
륄
쿱
탭
뵈
깍
헀
댁
떴
^
놋
랗
쭤
뾰
쉼
챠
썬
꿰
밈
똥
횬
꿩
솝
킵
뵐
읰
짖
빽
욤
눕
웜
얌
볶
뺑
튈
댕
쉘
뇰
@
텟
푀
쌋
캣
힉
솅
윅
껸
땃
덫
냘
웻
쳠
엌
뀜
뼉
춥
뼛
춧
큄
팥
궂
녠
꺄
컹
핰
쥴
홑
얍
닯
쥰
섀
첞
좡
됭
뷸
엳
읊
튠
뵙
귝
밞
씸
왬
【
】
듦
홱
숟
똘
넹
슌
팃
괭
쿰
츤
폄
쥼
텝
듄
짬
믈
샄
뻥
짊
췌
젯
렝
쏙
촐
킁
큔
믐
뎁
꽹
튤
얗
띈
윳
봬
륵
밧
튕
뚤
뀔
쫄
흴
윽
눔
푤
껄
옻
솁
틍
셕
멎
잛
꿎
쬔
넉
훑
먄
솎
퍽
닢
톳
벚
뫼
짭
숑
껫
멱
폿
닳
헉
쩡
윰
뻘
잤
툭
긱
훠
옭
슔
끽
꿇
헹
죔
캥
헷
왠
뭍
눗
씁
셄
햐
쐐
푄
춀
챕
핬
훵
썸
웸
뻑
욧
챤
뜀
넸
톄
쎌
뮴
겋
룀
꽁
뗄
랸
큭
숄
괸
닻
깰
ㄳ
샥
밌
뇽
닕
잽
솽
띔
펍
훅
촙
잴
썹
땜
돀
뉠
믄
퉜
눙
놉
괵
뎃
뮨
굼
늉
△
껐
쫑
갗
뺏
줴
겊
삵
쾡
앴
탸
텼
잨
쳉
뿍
펨
컥
닜
붑
똔
귐
몆
귬
힛
쌉
쌈
홧
퀠
갸
셱
ㅌ
띵
짰
빤
쪄
휫
쟝
섦
푠
돤
묾
맣
깽
묄
쳇
쿳
읏
셍
삥
쟌
큉
헙
켕
챗
쳅
쨩
넗
켑
갉
▶
듸
뻤
읕
갛
귈
빕
쉔
뉨
혠
얭
껌
핝
뱁
쌩
ㅿ
ㅆ
씰
춍
굄
쭝
쌔
낟
딫
읋
됴
묽
휑
횻
찧
뒨
쁠
휨
쇤
쇳
뵘
늝
챘
곜
땡
ㄻ
돎
떵
뵤
씽
욥
왐
쎈
됄
꿘
햏
홰
읂
띘
옙
꼿
쌕
쌘
옄
섕
햘
늰
롼
텨
쵤
캑
겡
묠
읖
쳔
칡
뺐
젱
됬
낍
콱
휙
[
]
큽
쫌
쳣
봣
ㄹ
걍
됀
죤
썻
츙
앃
돠
섴
옶
웟
껀
씐
됫
겻
겄
뭡
ㅘ
퐝
쵝
횽
쨘
귑
앜
뜹
쥑
맜
욬
돜
욌
쨔
딨
쒸
쑬
쁩
쫭
쨋
쩝
읗
믾
츈
쟎
퉤
뭣
쩜
ㅓ
됍
닏
닼
껬
숩
꾹
졍
젛
좆
쫙
뭥
ㅝ
찝
꿧
ㅔ
껨
둿
쓔
곸
붜
졋
쬠
켬
켯
앝
튑
옜
펏
눞
욯
넢
껜
샾
롷
옿
랔
띱
죵
맟
냔
ㅙ
밷
뷱
셥
놧
굥
쫘
곺
쯧
졷
쬐
긔
낰
뷁
돨
둣
쑈
몀
혓
쨈
깸
빳
벋
튄
촤
챦
뺍
읺
봏
옇
멉
븅
잌
뾱
죙
짘
뻣
옼
쫗
됏
쎄
좃
닠
ㅃ
엊
썅
뙇
쫒
펐
돟
홓
뿅
짼
줫
풉
빋
쏼
됌
갼
뿡
쏭
쏩
뜷
◆
팠
쫀
▲
맸
멓
궜
쨉
줏
쓱
쟤
낑
똬
끕
셌
쨍
빻
냑
탉
팹
늣
웽
쉈
쐬
굣
뒹
툇
뙈
꽈
죗
벴
띕
퇀
뀝
푯
쐈
삑
밉
짦
삠
쭐
늅
쳬
띌
륌
룐
얜
쳰
뎨
큅
낏
헸
챨
젋
꺠
휀
왤
깤
냠
앖
겤
괞
끙
슼
좍
죶
붱
틩
칞
옘
땨
핡
둗
쌤
짹
삔
눼
픕
갰
앺
첮
짇
볻
젔
탖
릐
겈
뚬
흣
돵
꺅
꽥
씅
퍈
뇬
즤
쭙
쫍
붇
룔
죈
씼
엹
쀼
밂
됙
ᆞ
룅
쌰
꾐
잍
옝
뢸
엩
솓
멥
욀
궉
낢
랈
쫏
닀
쵭
퍌
싀
늤
쪘
쮸
덞
삘
쯩
쿈
꼍
뜼
슁
겯
─
│
붰
췰
욺
뱐
뇔
셩
넒
웩
왝
섈
풂
큇
꿴
얩
렜
튐
땝
윕
퇸
떫
빰
앚
떄
랖
뉩
찟
뼘
뽄
첬
섶
뽁
퓸
뗍
뇩
읭
굔
졀
뵀
끎
팼
졔
쟘
퇘
쒀
섥
젘
쉣
뚧
엤
벛
맄
ㅒ
ㅞ
ㅟ
똠
쾃
뒬
췃
퇄
웤
앋
띡
켔
믓
몃
얔
텋
탹
틑
롴
곻
슺
뭏
깟
햤
롸
읶
밨
뤠
랲
쭘
뜅
깹
닣
힣
헣
틉
깉
뜁
릏
줗
괍
횐
꼇
쟀
톻
헟
첳
롵
잗
쥭
읅
맇
뒈
슉
롣
훟
엏
맀
쑴
곀
랃
싰
츌
핮
뎈
겝
췬
샙
퐈
좨
넼
웈
깠
롹
촥
쬬
멨
뀨
픙
뎄
팓
쉑
륩
햔
먕
헿
뇐
짛
괼
슽
줜
샆
덯
븡
랰
뱄
읔
띀
붤
퓔
녓
퀜
몐
잀
옯
튔
왘
ㆆ
읁
춄
궬
쭌
쬘
앟
럈
곯
떰
곪
꼐
텬
묫
읠
돐
덖
툿
쿽
큠
꽌
켙
뵌
뗑
밣
읙
믕
껭
룝
긠
읈
뉼
쇽
듕
됸
즬
읤
랼
싴
돬
ㄵ
쩖
즁
댱
뢔
볓
쑝
욋
춫
흫
옸
쒜
핗
쁀
븨
춴
갘
먾
듷
켭
칮
놬
엗
ㅄ
쉿
꿸
땟
돝
툽
먁
녈
붸
쟉
븍
쥠
띴
볠
엶
폽
닰
띸
칄
엝
읐
귣
욷
쏫
쎔
읎
귿
돚
푱
얺
썪
뉸
훕
좐
톺
뭅
눝
벧
챵
띰
쎤
뿟
죨
읻
놘
뗌
똭
훝
앶
훽
죻
촹
뽜
퐉
뽈
츼
싳
퍙
핳
툉
쳑
렄
훓
츔
땁
탙
롰
옾
롶
톧
퓽
퓬
쳥
냨
짆
웝
췐
뼁
왱
핶
켸
닞
슙
횰
굀
왭
왹
휄
읨
쏨
삄
읝
곬
뵉
럇
젹
찯
햑
챡
궃
챧
푿
롲
곕
숬
봑
낞
촣
믜
긷
퀭
륑
쾀
잋
곘
섄
캤
겆
벱
뀄
섁
묏
홥
쉭
꾜
뉵
뚠
숌
졉
읡
춉
롥
븰
엀
녬
욈
긑
홏
꾾
맻
잏
뱡
챃
첯
텉
톼
톹
춯
퐇
촟
펗
홒
룟
솬
엜
쏄
앍
옰
윱
쉥
곈
휭
햝
햴
쳼
걘
떱
쐴
뵭
읳
싑
싄
햣
녤
곅
푁
렺
춈
밎
쎅
훃
탇
콬
츋
렿
폏
둏
깄
욮
븜
밐
렫
뵜
쉅
짴
휸
닺
텽
팯
딲
겓
햌
샊
얐
좔
뎡
혗
흨
폅
ㄺ
숖
흗
ㅸ
뵨
덛
묑
졘
쿌
핧
몌
쇨
빘
쟐
엕
읞
틤
닄
갊
잸
퉷
뭬
헠
낛
랻
귯
곂
겎
럱
끅
돳
튭
랥
읬
쩰
얶
툠
릝
룼
싈
욍
햊
젏
큥
넱
쐰
랂
쓩
눚
닽
찀
돰
핤
젆
ㆁ
튁
뇸
ㄼ
쳵
얃
뱔
뺴
퇼
햠
읥
췽
짅
헏
똻
띷
럳
짯
풓
렠
뜠
띩
굫
xDIGITx
xBULLETx
xQUOTEx
xOTHERx
