{
  "storage" : "model.espresso.weights",
  "properties" : {
    "ane_compiler_batch" : "1",
    "espresso.dispatch.v3_enable" : "0"
  },
  "configurations" : {
    "img_input_1_4_1_32_1700_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 1700,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_400_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 400,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_1950_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 1950,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_850_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 850,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_2200_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 2200,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_2450_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 2450,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_500_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 500,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_1600_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 1600,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_950_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 950,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_1850_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 1850,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_2100_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 2100,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_600_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 600,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_2350_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 2350,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_1500_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 1500,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_1750_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 1750,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_700_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 700,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_2000_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 2000,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_2250_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 2250,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_1400_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 1400,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_800_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 800,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_1650_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 1650,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_2150_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 2150,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_900_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 900,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_1300_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 1300,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_1550_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 1550,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_2050_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 2050,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_1200_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 1200,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_2900_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 2900,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_1450_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 1450,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_2800_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 2800,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_1100_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 1100,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_1350_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 1350,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_9_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 9,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_150_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 150,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_2700_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 2700,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_1000_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 1000,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_1250_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 1250,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_2950_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 2950,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_250_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 250,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_2600_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 2600,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_2850_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 2850,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_350_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 350,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_1150_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 1150,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_450_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 450,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_2500_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 2500,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_2750_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 2750,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_1050_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 1050,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_100_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 100,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_1900_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 1900,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_3000_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 3000,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_550_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 550,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_2400_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 2400,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_2650_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 2650,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_200_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 200,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_650_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 650,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_1800_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 1800,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_300_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 300,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_2300_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 2300,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_2550_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 2550,
          "n" : 4,
          "h" : 32
        }
      }
    },
    "img_input_1_4_1_32_750_" : {
      "input_shapes" : {
        "img_input" : {
          "k" : 1,
          "w" : 750,
          "n" : 4,
          "h" : 32
        }
      }
    }
  },
  "format_version" : 200,
  "analyses" : {

  },
  "layers" : [
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "cnn_block1_conv1",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "cnn_block1_conv1__activation___output",
      "blob_weights" : 3,
      "K" : 1,
      "blob_biases" : 1,
      "name" : "cnn_block1_conv1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "img_input",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "debug_info" : "cnn_block1_pool",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "cnn_block1_pool_output",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "cnn_block1_pool",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "cnn_block1_conv1__activation___output",
      "weights" : {

      },
      "pad_mode" : 0,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "cnn_block2_conv1",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "cnn_block2_conv1__activation___output",
      "blob_weights" : 7,
      "K" : 16,
      "blob_biases" : 5,
      "name" : "cnn_block2_conv1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "cnn_block1_pool_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "debug_info" : "cnn_block2_pool",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "cnn_block2_pool_output",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "cnn_block2_pool",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "cnn_block2_conv1__activation___output",
      "weights" : {

      },
      "pad_mode" : 0,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "cnn_block3_conv1",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "cnn_block3_act1_output",
      "blob_weights" : 11,
      "K" : 32,
      "blob_biases" : 9,
      "name" : "cnn_block3_conv1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "cnn_block2_pool_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "cnn_block3_conv2",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "cnn_block3_conv2__activation___output",
      "blob_weights" : 15,
      "K" : 64,
      "blob_biases" : 13,
      "name" : "cnn_block3_conv2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "cnn_block3_act1_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "debug_info" : "cnn_block3_pool",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "cnn_block3_pool_output",
      "top_shape_style" : 0,
      "stride_x" : 1,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "cnn_block3_pool",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "cnn_block3_conv2__activation___output",
      "weights" : {

      },
      "pad_mode" : 0,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "cnn_block4_conv1",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "cnn_block4_act1_output",
      "blob_weights" : 19,
      "K" : 64,
      "blob_biases" : 17,
      "name" : "cnn_block4_conv1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "cnn_block3_pool_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "cnn_block4_conv2",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "cnn_block4_conv2__activation___output",
      "blob_weights" : 23,
      "K" : 128,
      "blob_biases" : 21,
      "name" : "cnn_block4_conv2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "cnn_block4_act1_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "debug_info" : "cnn_block4_pool",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "cnn_block4_pool_output",
      "top_shape_style" : 0,
      "stride_x" : 1,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "cnn_block4_pool",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "cnn_block4_conv2__activation___output",
      "weights" : {

      },
      "pad_mode" : 0,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "cnn_block5_conv1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "cnn_feature_map_output",
      "blob_weights" : 27,
      "K" : 128,
      "blob_biases" : 25,
      "name" : "cnn_block5_conv1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "cnn_block4_pool_output",
      "weights" : {

      },
      "Nx" : 2,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 2,
      "n_parallel" : 1
    },
    {
      "axis_seq" : 0,
      "top" : "map_to_sequence_output",
      "name" : "map_to_sequence",
      "axis_n" : 3,
      "axis_h" : 1,
      "type" : "transpose",
      "axis_w" : 4,
      "bottom" : "cnn_feature_map_output",
      "axis_k" : 2,
      "debug_info" : "map_to_sequence",
      "weights" : {

      },
      "hint_fallback_from_ane" : 1
    },
    {
      "input_size" : 128,
      "arch" : 1,
      "quantization_scale_h" : 1,
      "internal_nonlinearity_bidir_beta" : 1,
      "quantization_scale_x" : 1,
      "hidden_size" : 128,
      "lstm_forget_bias" : 1,
      "nonlinearity_alpha" : 1,
      "nonlinearity_bidir_type" : 0,
      "attributes" : {
        "is_output" : 1
      },
      "coupled_input_forget" : 0,
      "quantization_simple_mode" : false,
      "internal_nonlinearity_bidir_alpha" : 1,
      "mode" : 0,
      "bias_vector_flag" : 1,
      "cell_clip_threshold" : 50000,
      "type" : "rnn_arch",
      "override_eng" : 1,
      "internal_nonlinearity_second_beta" : 1,
      "internal_nonlinearity_second_bidir_type" : 0,
      "internal_nonlinearity_alpha" : 1,
      "internal_nonlinearity_beta" : 1,
      "forget_bias" : 0,
      "weights" : {
        "W_h" : 29,
        "b" : 37,
        "b_reverse" : 39,
        "W_x_reverse" : 35,
        "W_x" : 33,
        "W_h_reverse" : 31
      },
      "lstm_has_peepholes" : 0,
      "beta" : 1,
      "quantization_mode" : 0,
      "name" : "rnn_block1_bilstm",
      "quantization_scale_h_reverse" : 0,
      "top" : "rnn_block1_bilstm_output_concatenated_bilstm_output,rnn_block1_bilstm_h_out,rnn_block1_bilstm_c_out,rnn_block1_bilstm_h_out_rev,rnn_block1_bilstm_c_out_rev",
      "alpha" : 1,
      "internal_nonlinearity_second_bidir_alpha" : 1,
      "quantization_scale_x_reverse" : 0,
      "internal_nonlinearity_second_bidir_beta" : 1,
      "max_batch_size" : 1,
      "debug_info" : "rnn_block1_bilstm",
      "nonlinearity_bidir_alpha" : 1,
      "nonlinearity_beta" : 1,
      "internal_nonlinearity_bidir_type" : 3,
      "internal_nonlinearity_second_alpha" : 1,
      "encoder_bidirectional_mode" : 1,
      "internal_nonlinearity_type" : 3,
      "bottom" : "map_to_sequence_output",
      "nonlinearity_type" : 0,
      "encoder_output_sequence" : 1,
      "nonlinearity_bidir_beta" : 1,
      "internal_nonlinearity_second_type" : 0
    },
    {
      "bottom" : "rnn_block1_bilstm_output_concatenated_bilstm_output",
      "cut" : 0,
      "weights" : {

      },
      "debug_info" : "rnn_block1_bilstm_split",
      "n_outputs" : 2,
      "top" : "rnn_block1_bilstm_output_forward,rnn_block1_bilstm_output_backward",
      "type" : "split",
      "name" : "rnn_block1_bilstm_split"
    },
    {
      "bottom" : "rnn_block1_bilstm_output_forward,rnn_block1_bilstm_output_backward",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "rnn_block1_bilstm_elementwise",
      "top" : "rnn_block1_bilstm_output",
      "type" : "elementwise",
      "name" : "rnn_block1_bilstm_elementwise",
      "beta" : 0
    },
    {
      "input_size" : 128,
      "arch" : 1,
      "quantization_scale_h" : 1,
      "internal_nonlinearity_bidir_beta" : 1,
      "quantization_scale_x" : 1,
      "hidden_size" : 128,
      "lstm_forget_bias" : 1,
      "nonlinearity_alpha" : 1,
      "nonlinearity_bidir_type" : 0,
      "attributes" : {
        "is_output" : 1
      },
      "coupled_input_forget" : 0,
      "quantization_simple_mode" : false,
      "internal_nonlinearity_bidir_alpha" : 1,
      "mode" : 0,
      "bias_vector_flag" : 1,
      "cell_clip_threshold" : 50000,
      "type" : "rnn_arch",
      "override_eng" : 1,
      "internal_nonlinearity_second_beta" : 1,
      "internal_nonlinearity_second_bidir_type" : 0,
      "internal_nonlinearity_alpha" : 1,
      "internal_nonlinearity_beta" : 1,
      "forget_bias" : 0,
      "weights" : {
        "W_h" : 41,
        "b" : 49,
        "b_reverse" : 51,
        "W_x_reverse" : 47,
        "W_x" : 45,
        "W_h_reverse" : 43
      },
      "lstm_has_peepholes" : 0,
      "beta" : 1,
      "quantization_mode" : 0,
      "name" : "rnn_block2_bilstm",
      "quantization_scale_h_reverse" : 0,
      "top" : "rnn_block2_bilstm_output_concatenated_bilstm_output,rnn_block2_bilstm_h_out,rnn_block2_bilstm_c_out,rnn_block2_bilstm_h_out_rev,rnn_block2_bilstm_c_out_rev",
      "alpha" : 1,
      "internal_nonlinearity_second_bidir_alpha" : 1,
      "quantization_scale_x_reverse" : 0,
      "internal_nonlinearity_second_bidir_beta" : 1,
      "max_batch_size" : 1,
      "debug_info" : "rnn_block2_bilstm",
      "nonlinearity_bidir_alpha" : 1,
      "nonlinearity_beta" : 1,
      "internal_nonlinearity_bidir_type" : 3,
      "internal_nonlinearity_second_alpha" : 1,
      "encoder_bidirectional_mode" : 1,
      "internal_nonlinearity_type" : 3,
      "bottom" : "rnn_block1_bilstm_output",
      "nonlinearity_type" : 0,
      "encoder_output_sequence" : 1,
      "nonlinearity_bidir_beta" : 1,
      "internal_nonlinearity_second_type" : 0
    },
    {
      "bottom" : "rnn_block2_bilstm_output_concatenated_bilstm_output",
      "cut" : 0,
      "weights" : {

      },
      "debug_info" : "rnn_block2_bilstm_split",
      "n_outputs" : 2,
      "top" : "rnn_block2_bilstm_output_forward,rnn_block2_bilstm_output_backward",
      "type" : "split",
      "name" : "rnn_block2_bilstm_split"
    },
    {
      "bottom" : "rnn_block2_bilstm_output_forward,rnn_block2_bilstm_output_backward",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "rnn_block2_bilstm_elementwise",
      "top" : "rnn_block2_bilstm_output",
      "type" : "elementwise",
      "name" : "rnn_block2_bilstm_elementwise",
      "beta" : 0
    },
    {
      "nB" : 128,
      "top" : "ip_clusters",
      "has_biases" : 1,
      "blob_biases" : 53,
      "nC" : 4211,
      "blob_weights" : 55,
      "weights" : {

      },
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "rnn_block2_bilstm_output",
      "debug_info" : "",
      "has_tanh" : 0,
      "hint_fallback_from_metal" : 1,
      "name" : "inner_product_0",
      "has_prelu" : 0
    },
    {
      "nB" : 128,
      "top" : "output_label_prob_map_after_topk,topk_indices",
      "has_biases" : 1,
      "argmax_tree_n_clusters" : 4211,
      "nC" : 19882,
      "fused_activation_mode" : 100002,
      "fused_activation_alpha" : 20,
      "weights" : {
        "3091\/1\/b" : 14015,
        "1947\/4\/W" : 6381,
        "3965\/1\/scatter_index" : 19837,
        "973\/8\/scatter_index" : 25153,
        "770\/8\/W" : 23799,
        "2320\/3\/b" : 8879,
        "3226\/1\/W" : 14913,
        "155\/13\/b" : 3737,
        "2882\/2\/scatter_index" : 12619,
        "1337\/6\/b" : 2321,
        "54\/16\/b" : 22265,
        "3841\/1\/W" : 19011,
        "1891\/4\/scatter_index" : 6013,
        "713\/9\/W" : 23421,
        "2475\/2\/W" : 9903,
        "3412\/1\/W" : 16155,
        "2926\/2\/b" : 12911,
        "4163\/1\/scatter_index" : 21163,
        "4137\/1\/W" : 20985,
        "1523\/6\/b" : 3563,
        "3767\/1\/b" : 18515,
        "2507\/2\/scatter_index" : 10123,
        "3143\/1\/scatter_index" : 14365,
        "1142\/7\/W" : 1023,
        "3338\/1\/b" : 15659,
        "2661\/2\/W" : 11145,
        "508\/10\/b" : 22055,
        "2116\/3\/W" : 7515,
        "26\/17\/b" : 10733,
        "1678\/5\/W" : 4587,
        "2152\/3\/scatter_index" : 7759,
        "1608\/5\/scatter_index" : 4129,
        "3953\/1\/b" : 19757,
        "1794\/4\/W" : 5361,
        "1068\/7\/b" : 527,
        "1190\/7\/scatter_index" : 1345,
        "3073\/1\/W" : 13893,
        "2587\/2\/b" : 10649,
        "2807\/2\/scatter_index" : 12121,
        "3524\/1\/b" : 16901,
        "3443\/1\/scatter_index" : 16363,
        "2302\/3\/W" : 8757,
        "1816\/4\/b" : 5513,
        "2360\/2\/scatter_index" : 9145,
        "1319\/6\/W" : 2199,
        "64\/15\/W" : 22929,
        "1816\/4\/scatter_index" : 5515,
        "1789\/4\/scatter_index" : 5329,
        "1980\/4\/W" : 6603,
        "744\/9\/scatter_index" : 23629,
        "1254\/7\/b" : 1769,
        "458\/10\/W" : 21717,
        "331\/11\/W" : 15471,
        "2773\/2\/b" : 11891,
        "3710\/1\/b" : 18143,
        "2228\/3\/b" : 8261,
        "1370\/6\/b" : 2543,
        "825\/8\/b" : 24167,
        "2988\/1\/scatter_index" : 13321,
        "2908\/2\/W" : 12789,
        "1505\/6\/W" : 3441,
        "3743\/1\/scatter_index" : 18361,
        "956\/8\/W" : 25035,
        "4006\/1\/b" : 20117,
        "3749\/1\/W" : 18393,
        "3185\/1\/b" : 14639,
        "2660\/2\/scatter_index" : 11143,
        "1621\/5\/W" : 4215,
        "2014\/4\/scatter_index" : 6841,
        "4170\/1\/W" : 21207,
        "213\/12\/W" : 7605,
        "901\/8\/W" : 24675,
        "2530\/2\/b" : 10277,
        "36\/16\/W" : 17397,
        "3213\/1\/scatter_index" : 14833,
        "3186\/1\/scatter_index" : 14647,
        "1761\/5\/scatter_index" : 5149,
        "2033\/4\/W" : 6963,
        "1547\/5\/b" : 3719,
        "1115\/7\/scatter_index" : 847,
        "3935\/1\/W" : 19635,
        "1088\/7\/scatter_index" : 661,
        "3371\/1\/b" : 15881,
        "4096\/1\/b" : 20711,
        "2222\/3\/scatter_index" : 8227,
        "2195\/3\/scatter_index" : 8041,
        "158\/13\/scatter_index" : 3937,
        "2569\/2\/W" : 10527,
        "2960\/2\/scatter_index" : 13141,
        "3506\/1\/W" : 16779,
        "183\/13\/b" : 5603,
        "40\/16\/scatter_index" : 20071,
        "676\/9\/W" : 23169,
        "1733\/5\/b" : 4961,
        "1323\/6\/scatter_index" : 2233,
        "1296\/6\/scatter_index" : 2047,
        "3513\/1\/scatter_index" : 16831,
        "3486\/1\/scatter_index" : 16645,
        "1236\/7\/W" : 1647,
        "2075\/3\/b" : 7241,
        "2755\/2\/W" : 11769,
        "2430\/2\/scatter_index" : 9613,
        "1352\/6\/W" : 2421,
        "621\/9\/W" : 22809,
        "102\/14\/W" : 207,
        "188\/13\/scatter_index" : 5935,
        "3596\/1\/W" : 17373,
        "931\/8\/scatter_index" : 24877,
        "2558\/2\/scatter_index" : 10459,
        "1888\/4\/W" : 5985,
        "764\/9\/b" : 23759,
        "2261\/3\/b" : 8483,
        "52\/16\/scatter_index" : 22135,
        "3167\/1\/W" : 14517,
        "3618\/1\/b" : 17525,
        "2941\/2\/W" : 13011,
        "1278\/6\/b" : 1925,
        "58\/15\/scatter_index" : 22531,
        "536\/10\/b" : 22241,
        "3813\/1\/scatter_index" : 18829,
        "3786\/1\/scatter_index" : 18643,
        "1659\/5\/scatter_index" : 4465,
        "3782\/1\/W" : 18615,
        "2730\/2\/scatter_index" : 11611,
        "2512\/2\/W" : 10155,
        "3353\/1\/W" : 15759,
        "2867\/2\/b" : 12515,
        "4078\/1\/W" : 20589,
        "2858\/2\/scatter_index" : 12457,
        "3804\/1\/b" : 18767,
        "1464\/6\/b" : 3167,
        "695\/9\/scatter_index" : 23299,
        "2983\/1\/b" : 13289,
        "1580\/5\/b" : 3941,
        "2438\/2\/b" : 9659,
        "4011\/1\/scatter_index" : 20155,
        "1867\/4\/scatter_index" : 5851,
        "418\/11\/b" : 21269,
        "1083\/7\/W" : 627,
        "788\/8\/b" : 23915,
        "165\/13\/scatter_index" : 4405,
        "1715\/5\/W" : 4839,
        "486\/10\/W" : 21903,
        "3279\/1\/b" : 15263,
        "2057\/3\/W" : 7119,
        "1831\/4\/W" : 5613,
        "1105\/7\/b" : 779,
        "3894\/1\/b" : 19361,
        "3110\/1\/W" : 14145,
        "2624\/2\/b" : 10901,
        "639\/9\/scatter_index" : 22927,
        "3465\/1\/b" : 16505,
        "864\/8\/W" : 24423,
        "2243\/3\/W" : 8361,
        "195\/13\/scatter_index" : 6403,
        "368\/11\/W" : 17931,
        "241\/12\/W" : 9471,
        "3036\/1\/b" : 13649,
        "2628\/2\/scatter_index" : 10927,
        "3264\/1\/scatter_index" : 15169,
        "2810\/2\/b" : 12143,
        "4021\/1\/W" : 20217,
        "1195\/7\/b" : 1373,
        "3651\/1\/b" : 17747,
        "2169\/3\/b" : 7865,
        "2300\/3\/scatter_index" : 8749,
        "2273\/3\/scatter_index" : 8563,
        "1943\/4\/b" : 6359,
        "1729\/5\/scatter_index" : 4933,
        "2849\/2\/W" : 12393,
        "952\/8\/b" : 25013,
        "1446\/6\/W" : 3045,
        "3222\/1\/b" : 14891,
        "1562\/5\/W" : 3819,
        "2928\/2\/scatter_index" : 12925,
        "1401\/6\/scatter_index" : 2755,
        "1374\/6\/scatter_index" : 2569,
        "3564\/1\/scatter_index" : 17167,
        "584\/9\/W" : 22557,
        "882\/8\/scatter_index" : 24547,
        "2481\/2\/scatter_index" : 9949,
        "2471\/2\/b" : 9881,
        "1937\/4\/scatter_index" : 6319,
        "122\/14\/scatter_index" : 1543,
        "130\/14\/W" : 2073,
        "4133\/1\/b" : 20963,
        "3876\/1\/W" : 19239,
        "2606\/2\/W" : 10779,
        "430\/10\/b" : 21539,
        "4209\/1\/scatter_index" : 21469,
        "2090\/3\/W" : 7341,
        "3034\/1\/scatter_index" : 13639,
        "1582\/5\/scatter_index" : 3955,
        "3447\/1\/W" : 16383,
        "672\/9\/b" : 23147,
        "3864\/1\/scatter_index" : 19165,
        "564\/10\/b" : 22427,
        "2112\/3\/b" : 7493,
        "1674\/5\/b" : 4565,
        "2781\/2\/scatter_index" : 11947,
        "3018\/1\/W" : 13527,
        "139\/14\/W" : 2667,
        "152\/14\/scatter_index" : 3541,
        "1177\/7\/W" : 1251,
        "826\/8\/scatter_index" : 24175,
        "1790\/4\/b" : 5339,
        "2696\/2\/W" : 11373,
        "439\/10\/b" : 21593,
        "919\/8\/b" : 24791,
        "1790\/4\/scatter_index" : 5341,
        "3633\/1\/W" : 17625,
        "1293\/6\/W" : 2025,
        "312\/11\/b" : 14207,
        "3334\/1\/scatter_index" : 15637,
        "1925\/4\/W" : 6237,
        "1236\/7\/scatter_index" : 1651,
        "3988\/1\/b" : 19985,
        "3204\/1\/W" : 14769,
        "2718\/2\/b" : 11525,
        "1315\/6\/b" : 2177,
        "2343\/3\/scatter_index" : 9031,
        "502\/10\/scatter_index" : 22021,
        "3559\/1\/b" : 17129,
        "2882\/2\/W" : 12615,
        "2406\/2\/scatter_index" : 9451,
        "2379\/2\/scatter_index" : 9265,
        "2337\/3\/W" : 8985,
        "15\/18\/W" : 3399,
        "2453\/2\/W" : 9759,
        "1444\/6\/scatter_index" : 3037,
        "2904\/2\/b" : 12767,
        "3634\/1\/scatter_index" : 17635,
        "4115\/1\/W" : 20841,
        "1501\/6\/b" : 3419,
        "3294\/1\/W" : 15363,
        "2551\/2\/scatter_index" : 10417,
        "1004\/8\/W" : 105,
        "3745\/1\/b" : 18371,
        "639\/9\/b" : 22925,
        "201\/13\/b" : 6809,
        "532\/10\/scatter_index" : 22219,
        "1120\/7\/W" : 879,
        "396\/11\/W" : 19797,
        "2379\/2\/b" : 9263,
        "2706\/2\/scatter_index" : 11449,
        "2679\/2\/scatter_index" : 11263,
        "3316\/1\/b" : 15515,
        "772\/8\/W" : 23811,
        "1652\/5\/scatter_index" : 4423,
        "430\/10\/scatter_index" : 21541,
        "1656\/5\/W" : 4443,
        "3480\/1\/W" : 16605,
        "3934\/1\/scatter_index" : 19633,
        "3931\/1\/b" : 19613,
        "1046\/7\/b" : 383,
        "715\/9\/W" : 23433,
        "2851\/2\/scatter_index" : 12415,
        "3051\/1\/W" : 13749,
        "2565\/2\/b" : 10505,
        "3502\/1\/b" : 16757,
        "562\/10\/scatter_index" : 22417,
        "860\/8\/b" : 24401,
        "278\/12\/W" : 11931,
        "2979\/2\/scatter_index" : 13261,
        "1860\/4\/scatter_index" : 5809,
        "2184\/3\/W" : 7965,
        "991\/8\/W" : 25269,
        "460\/10\/scatter_index" : 21739,
        "1232\/7\/b" : 1625,
        "1988\/4\/scatter_index" : 6655,
        "2751\/2\/b" : 11747,
        "4132\/1\/scatter_index" : 20959,
        "349\/11\/scatter_index" : 16669,
        "2206\/3\/b" : 8117,
        "1768\/5\/b" : 5189,
        "3592\/1\/b" : 17351,
        "2449\/2\/scatter_index" : 9733,
        "3112\/1\/scatter_index" : 14161,
        "1884\/4\/b" : 5963,
        "717\/9\/scatter_index" : 23449,
        "1387\/6\/W" : 2649,
        "3727\/1\/W" : 18249,
        "3163\/1\/b" : 14495,
        "777\/8\/scatter_index" : 23845,
        "2121\/3\/scatter_index" : 7555,
        "2094\/3\/scatter_index" : 7369,
        "490\/10\/scatter_index" : 21937,
        "1409\/6\/b" : 2801,
        "379\/11\/scatter_index" : 18667,
        "504\/10\/W" : 22029,
        "2296\/3\/b" : 8711,
        "2976\/2\/W" : 13239,
        "467\/10\/b" : 21779,
        "2011\/4\/W" : 6819,
        "2749\/2\/scatter_index" : 11731,
        "340\/11\/b" : 16073,
        "3913\/1\/W" : 19491,
        "3412\/1\/scatter_index" : 16159,
        "3385\/1\/scatter_index" : 15973,
        "4074\/1\/b" : 20567,
        "1028\/7\/W" : 261,
        "827\/8\/b" : 24179,
        "2547\/2\/W" : 10383,
        "4209\/1\/W" : 21465,
        "326\/11\/scatter_index" : 15139,
        "958\/8\/W" : 25047,
        "3388\/1\/W" : 15987,
        "3839\/1\/b" : 18995,
        "1499\/6\/b" : 3395,
        "1711\/5\/b" : 4817,
        "73\/15\/b" : 23531,
        "2053\/3\/b" : 7097,
        "960\/8\/scatter_index" : 25069,
        "1214\/7\/W" : 1503,
        "349\/11\/b" : 16667,
        "2733\/2\/W" : 11625,
        "222\/12\/b" : 8207,
        "1522\/6\/scatter_index" : 3559,
        "3712\/1\/scatter_index" : 18157,
        "1330\/6\/W" : 2277,
        "1495\/6\/scatter_index" : 3373,
        "3685\/1\/scatter_index" : 17971,
        "903\/8\/W" : 24687,
        "3574\/1\/W" : 17229,
        "1866\/4\/W" : 5841,
        "356\/11\/scatter_index" : 17137,
        "3145\/1\/W" : 14373,
        "2659\/2\/b" : 11129,
        "3155\/1\/scatter_index" : 14443,
        "1730\/5\/scatter_index" : 4945,
        "1057\/7\/scatter_index" : 457,
        "678\/9\/W" : 23181,
        "3760\/1\/W" : 18471,
        "2278\/3\/W" : 8589,
        "3985\/1\/scatter_index" : 19969,
        "904\/8\/scatter_index" : 24697,
        "45\/16\/b" : 21665,
        "2164\/3\/scatter_index" : 7837,
        "2394\/2\/W" : 9363,
        "3331\/1\/W" : 15615,
        "2845\/2\/b" : 12371,
        "4056\/1\/W" : 20445,
        "386\/11\/scatter_index" : 19135,
        "1442\/6\/b" : 3023,
        "623\/9\/W" : 22821,
        "2319\/3\/scatter_index" : 8869,
        "111\/14\/b" : 809,
        "3686\/1\/b" : 17975,
        "2416\/2\/b" : 9515,
        "3455\/1\/scatter_index" : 16441,
        "1978\/4\/b" : 6587,
        "1061\/7\/W" : 483,
        "3257\/1\/b" : 15119,
        "2580\/2\/W" : 10605,
        "4210\/1\/scatter_index" : 21481,
        "2372\/2\/scatter_index" : 9223,
        "668\/9\/scatter_index" : 23119,
        "1597\/5\/W" : 4047,
        "2527\/2\/scatter_index" : 10255,
        "3872\/1\/b" : 19217,
        "711\/9\/b" : 23411,
        "2602\/2\/b" : 10757,
        "1619\/5\/b" : 4199,
        "188\/13\/W" : 5931,
        "3443\/1\/b" : 16361,
        "4168\/1\/b" : 21191,
        "3755\/1\/scatter_index" : 18439,
        "2221\/3\/W" : 8217,
        "1628\/5\/scatter_index" : 4261,
        "38\/16\/scatter_index" : 18733,
        "2672\/2\/scatter_index" : 11221,
        "3014\/1\/b" : 13505,
        "532\/10\/W" : 22215,
        "1173\/7\/b" : 1229,
        "2827\/2\/scatter_index" : 12253,
        "495\/10\/b" : 21965,
        "2692\/2\/b" : 11351,
        "2147\/3\/b" : 7721,
        "1773\/5\/scatter_index" : 5227,
        "1921\/4\/b" : 6215,
        "2827\/2\/W" : 12249,
        "1836\/4\/scatter_index" : 5647,
        "1424\/6\/W" : 2901,
        "3200\/1\/b" : 14747,
        "3668\/1\/W" : 17853,
        "2972\/2\/scatter_index" : 13219,
        "414\/11\/W" : 21003,
        "866\/8\/W" : 24435,
        "2333\/3\/b" : 8963,
        "3239\/1\/W" : 14997,
        "377\/11\/b" : 18533,
        "1981\/4\/scatter_index" : 6613,
        "250\/12\/b" : 10073,
        "4111\/1\/b" : 20819,
        "3854\/1\/W" : 19095,
        "2034\/4\/scatter_index" : 6973,
        "3290\/1\/b" : 15341,
        "811\/8\/W" : 24075,
        "1000\/8\/b" : 83,
        "2488\/2\/W" : 9987,
        "855\/8\/scatter_index" : 24367,
        "3425\/1\/W" : 16239,
        "2939\/2\/b" : 12995,
        "7\/19\/scatter_index" : 23329,
        "954\/8\/b" : 25025,
        "1536\/6\/b" : 3647,
        "3233\/1\/scatter_index" : 14965,
        "1135\/7\/scatter_index" : 979,
        "259\/12\/b" : 10667,
        "1652\/5\/b" : 4421,
        "2242\/3\/scatter_index" : 8359,
        "1155\/7\/W" : 1107,
        "586\/9\/W" : 22569,
        "2674\/2\/W" : 11229,
        "1271\/6\/W" : 1881,
        "3611\/1\/W" : 17481,
        "2129\/3\/W" : 7599,
        "1903\/4\/W" : 6093,
        "3966\/1\/b" : 19841,
        "1343\/6\/scatter_index" : 2365,
        "3533\/1\/scatter_index" : 16963,
        "2180\/3\/b" : 7943,
        "3086\/1\/W" : 13977,
        "2450\/2\/scatter_index" : 9745,
        "3537\/1\/b" : 16985,
        "1906\/4\/scatter_index" : 6115,
        "1879\/4\/scatter_index" : 5929,
        "2860\/2\/W" : 12471,
        "674\/9\/b" : 23159,
        "2315\/3\/W" : 8841,
        "1829\/4\/b" : 5597,
        "3108\/1\/b" : 14129,
        "2431\/2\/W" : 9615,
        "3003\/1\/scatter_index" : 13435,
        "1993\/4\/W" : 6687,
        "148\/14\/b" : 3269,
        "1551\/5\/scatter_index" : 3751,
        "3272\/1\/W" : 15219,
        "2786\/2\/b" : 11975,
        "3833\/1\/scatter_index" : 18961,
        "3723\/1\/b" : 18227,
        "1383\/6\/b" : 2627,
        "2750\/2\/scatter_index" : 11743,
        "750\/9\/W" : 23667,
        "2357\/2\/b" : 9119,
        "85\/15\/scatter_index" : 24331,
        "1518\/6\/W" : 3525,
        "4019\/1\/b" : 20201,
        "560\/10\/W" : 22401,
        "1634\/5\/W" : 4299,
        "626\/9\/scatter_index" : 22843,
        "3198\/1\/b" : 14723,
        "2972\/2\/b" : 13217,
        "4183\/1\/W" : 21291,
        "3303\/1\/scatter_index" : 15433,
        "3276\/1\/scatter_index" : 15247,
        "1205\/7\/scatter_index" : 1447,
        "1024\/7\/b" : 239,
        "1178\/7\/scatter_index" : 1261,
        "435\/10\/W" : 21567,
        "2543\/2\/b" : 10361,
        "2312\/3\/scatter_index" : 8827,
        "2285\/3\/scatter_index" : 8641,
        "4205\/1\/b" : 21443,
        "167\/13\/scatter_index" : 4537,
        "2046\/4\/W" : 7047,
        "3948\/1\/W" : 19719,
        "3384\/1\/b" : 15965,
        "569\/10\/W" : 22455,
        "90\/15\/W" : 24663,
        "2162\/3\/W" : 7821,
        "3519\/1\/W" : 16863,
        "1210\/7\/b" : 1481,
        "1413\/6\/scatter_index" : 2833,
        "746\/9\/scatter_index" : 23641,
        "774\/8\/W" : 23823,
        "3603\/1\/scatter_index" : 17431,
        "1386\/6\/scatter_index" : 2647,
        "3576\/1\/scatter_index" : 17245,
        "317\/11\/W" : 14535,
        "2520\/2\/scatter_index" : 10213,
        "2493\/2\/scatter_index" : 10027,
        "1746\/5\/b" : 5045,
        "3570\/1\/b" : 17207,
        "2088\/3\/b" : 7325,
        "1249\/7\/W" : 1731,
        "1862\/4\/b" : 5819,
        "197\/13\/scatter_index" : 6535,
        "2768\/2\/W" : 11853,
        "717\/9\/W" : 23445,
        "2648\/2\/scatter_index" : 11059,
        "3705\/1\/W" : 18105,
        "1365\/6\/W" : 2505,
        "3141\/1\/b" : 14351,
        "969\/8\/scatter_index" : 25123,
        "1621\/5\/scatter_index" : 4219,
        "1594\/5\/scatter_index" : 4033,
        "862\/8\/b" : 24413,
        "287\/12\/b" : 12533,
        "160\/13\/b" : 4073,
        "3903\/1\/scatter_index" : 19429,
        "3876\/1\/scatter_index" : 19243,
        "2274\/3\/b" : 8567,
        "1749\/5\/scatter_index" : 5065,
        "2820\/2\/scatter_index" : 12211,
        "2793\/2\/scatter_index" : 12025,
        "993\/8\/W" : 25281,
        "2954\/2\/W" : 13095,
        "2390\/2\/b" : 9341,
        "4052\/1\/b" : 20423,
        "3795\/1\/W" : 18699,
        "2948\/2\/scatter_index" : 13057,
        "2525\/2\/W" : 10239,
        "206\/13\/W" : 7137,
        "813\/8\/scatter_index" : 24091,
        "3366\/1\/W" : 15843,
        "169\/13\/b" : 4667,
        "4101\/1\/scatter_index" : 20755,
        "1477\/6\/b" : 3251,
        "4074\/1\/scatter_index" : 20569,
        "1957\/4\/scatter_index" : 6451,
        "3817\/1\/b" : 18851,
        "2996\/1\/b" : 13373,
        "174\/13\/scatter_index" : 5005,
        "1593\/5\/b" : 4025,
        "2418\/2\/scatter_index" : 9529,
        "3981\/1\/W" : 19941,
        "770\/8\/scatter_index" : 23803,
        "2711\/2\/W" : 11481,
        "3054\/1\/scatter_index" : 13771,
        "1096\/7\/W" : 711,
        "513\/10\/b" : 22091,
        "1728\/5\/W" : 4923,
        "3552\/1\/W" : 17085,
        "1844\/4\/W" : 5697,
        "2063\/3\/scatter_index" : 7165,
        "1118\/7\/b" : 863,
        "933\/8\/scatter_index" : 24889,
        "829\/8\/b" : 24191,
        "3123\/1\/W" : 14229,
        "2637\/2\/b" : 10985,
        "3478\/1\/b" : 16589,
        "2718\/2\/scatter_index" : 11527,
        "3354\/1\/scatter_index" : 15769,
        "2256\/3\/W" : 8445,
        "1256\/7\/scatter_index" : 1783,
        "3049\/1\/b" : 13733,
        "463\/10\/W" : 21753,
        "2372\/2\/W" : 9219,
        "101\/14\/scatter_index" : 145,
        "2823\/2\/b" : 12227,
        "4034\/1\/W" : 20301,
        "1420\/6\/b" : 2879,
        "905\/8\/W" : 24699,
        "697\/9\/scatter_index" : 23311,
        "3664\/1\/b" : 17831,
        "1956\/4\/b" : 6443,
        "1459\/6\/W" : 3129,
        "1464\/6\/scatter_index" : 3169,
        "3235\/1\/b" : 14975,
        "3654\/1\/scatter_index" : 17767,
        "1575\/5\/W" : 3903,
        "2571\/2\/scatter_index" : 10549,
        "345\/11\/W" : 16401,
        "131\/14\/scatter_index" : 2143,
        "3850\/1\/b" : 19073,
        "2484\/2\/b" : 9965,
        "3124\/1\/scatter_index" : 14239,
        "3097\/1\/scatter_index" : 14053,
        "3421\/1\/b" : 16217,
        "1672\/5\/scatter_index" : 4555,
        "4146\/1\/b" : 21047,
        "1026\/7\/scatter_index" : 253,
        "3889\/1\/W" : 19323,
        "625\/9\/W" : 22833,
        "1761\/5\/W" : 5145,
        "2619\/2\/W" : 10863,
        "3954\/1\/scatter_index" : 19765,
        "2133\/3\/scatter_index" : 7633,
        "770\/8\/b" : 23801,
        "704\/9\/scatter_index" : 23365,
        "2871\/2\/scatter_index" : 12547,
        "2009\/4\/b" : 6803,
        "1151\/7\/b" : 1085,
        "227\/12\/W" : 8535,
        "2670\/2\/b" : 11207,
        "2125\/3\/b" : 7577,
        "1687\/5\/b" : 4649,
        "1880\/4\/scatter_index" : 5941,
        "2805\/2\/W" : 12105,
        "3424\/1\/scatter_index" : 16237,
        "3397\/1\/scatter_index" : 16051,
        "661\/9\/scatter_index" : 23077,
        "713\/9\/b" : 23423,
        "1402\/6\/W" : 2757,
        "3646\/1\/W" : 17709,
        "197\/13\/b" : 6533,
        "3082\/1\/b" : 13955,
        "1938\/4\/W" : 6321,
        "511\/10\/scatter_index" : 22081,
        "2311\/3\/b" : 8819,
        "3217\/1\/W" : 14853,
        "2469\/2\/scatter_index" : 9865,
        "1328\/6\/b" : 2261,
        "541\/10\/b" : 22277,
        "884\/8\/scatter_index" : 24559,
        "2895\/2\/W" : 12699,
        "1534\/6\/scatter_index" : 3637,
        "3832\/1\/W" : 18951,
        "3724\/1\/scatter_index" : 18235,
        "116\/14\/W" : 1137,
        "3697\/1\/scatter_index" : 18049,
        "1492\/6\/W" : 3351,
        "2641\/2\/scatter_index" : 11017,
        "2466\/2\/W" : 9843,
        "3403\/1\/W" : 16095,
        "2917\/2\/b" : 12851,
        "4128\/1\/W" : 20925,
        "541\/10\/scatter_index" : 22279,
        "1514\/6\/b" : 3503,
        "2769\/2\/scatter_index" : 11863,
        "3758\/1\/b" : 18455,
        "1630\/5\/b" : 4277,
        "1742\/5\/scatter_index" : 5023,
        "1133\/7\/W" : 963,
        "868\/8\/W" : 24447,
        "3329\/1\/b" : 15599,
        "2652\/2\/W" : 11085,
        "1805\/4\/scatter_index" : 5443,
        "3997\/1\/scatter_index" : 20047,
        "328\/11\/scatter_index" : 15271,
        "64\/15\/b" : 22931,
        "2107\/3\/W" : 7455,
        "491\/10\/W" : 21939,
        "1669\/5\/W" : 4527,
        "2941\/2\/scatter_index" : 13015,
        "3493\/1\/W" : 16689,
        "2042\/4\/b" : 7025,
        "3944\/1\/b" : 19697,
        "1785\/4\/W" : 5301,
        "813\/8\/W" : 24087,
        "571\/10\/scatter_index" : 22477,
        "1059\/7\/b" : 467,
        "3064\/1\/W" : 13833,
        "2578\/2\/b" : 10589,
        "3515\/1\/b" : 16841,
        "956\/8\/b" : 25037,
        "305\/12\/b" : 13739,
        "1807\/4\/b" : 5453,
        "2003\/4\/scatter_index" : 6769,
        "373\/11\/W" : 18267,
        "4195\/1\/scatter_index" : 21373,
        "2197\/3\/W" : 8049,
        "358\/11\/scatter_index" : 17269,
        "1971\/4\/W" : 6543,
        "1245\/7\/b" : 1709,
        "588\/9\/W" : 22581,
        "2539\/2\/scatter_index" : 10333,
        "901\/8\/b" : 24677,
        "3250\/1\/W" : 15075,
        "3202\/1\/scatter_index" : 14761,
        "3175\/1\/scatter_index" : 14575,
        "2764\/2\/b" : 11831,
        "36\/16\/b" : 17399,
        "3701\/1\/b" : 18083,
        "2219\/3\/b" : 8201,
        "1104\/7\/scatter_index" : 775,
        "1077\/7\/scatter_index" : 589,
        "655\/9\/scatter_index" : 23035,
        "1361\/6\/b" : 2483,
        "1897\/4\/b" : 6047,
        "2211\/3\/scatter_index" : 8155,
        "2184\/3\/scatter_index" : 7969,
        "255\/12\/W" : 10401,
        "3176\/1\/b" : 14579,
        "1612\/5\/W" : 4155,
        "388\/11\/scatter_index" : 19267,
        "2950\/2\/b" : 13073,
        "4161\/1\/W" : 21147,
        "676\/9\/b" : 23171,
        "2839\/2\/scatter_index" : 12331,
        "1312\/6\/scatter_index" : 2161,
        "1285\/6\/scatter_index" : 1975,
        "3791\/1\/b" : 18677,
        "3502\/1\/scatter_index" : 16759,
        "3475\/1\/scatter_index" : 16573,
        "2521\/2\/b" : 10217,
        "2024\/4\/W" : 6903,
        "2392\/2\/scatter_index" : 9355,
        "3926\/1\/W" : 19575,
        "1848\/4\/scatter_index" : 5725,
        "3362\/1\/b" : 15821,
        "621\/9\/b" : 22811,
        "4087\/1\/b" : 20651,
        "335\/11\/scatter_index" : 15739,
        "2140\/3\/W" : 7677,
        "752\/9\/W" : 23679,
        "1092\/7\/b" : 689,
        "998\/8\/scatter_index" : 25315,
        "1724\/5\/b" : 4901,
        "3802\/1\/scatter_index" : 18757,
        "3775\/1\/scatter_index" : 18571,
        "144\/14\/W" : 3003,
        "2066\/3\/b" : 7181,
        "1227\/7\/W" : 1587,
        "1840\/4\/b" : 5675,
        "2692\/2\/scatter_index" : 11353,
        "2746\/2\/W" : 11709,
        "444\/10\/b" : 21629,
        "2046\/4\/scatter_index" : 7051,
        "365\/11\/scatter_index" : 17737,
        "1343\/6\/W" : 2361,
        "2109\/3\/scatter_index" : 7471,
        "3587\/1\/W" : 17313,
        "1879\/4\/W" : 5925,
        "3245\/1\/scatter_index" : 15043,
        "578\/10\/b" : 22517,
        "2252\/3\/b" : 8423,
        "1147\/7\/scatter_index" : 1057,
        "3158\/1\/W" : 14457,
        "4000\/1\/scatter_index" : 20083,
        "842\/8\/scatter_index" : 24283,
        "3609\/1\/b" : 17465,
        "2932\/2\/W" : 12951,
        "1269\/6\/b" : 1865,
        "776\/8\/W" : 23835,
        "2254\/3\/scatter_index" : 8437,
        "4030\/1\/b" : 20279,
        "3773\/1\/W" : 18555,
        "326\/11\/b" : 15137,
        "395\/11\/scatter_index" : 19735,
        "2503\/2\/W" : 10095,
        "3344\/1\/W" : 15699,
        "2858\/2\/b" : 12455,
        "4069\/1\/W" : 20529,
        "1355\/6\/scatter_index" : 2443,
        "1455\/6\/b" : 3107,
        "3545\/1\/scatter_index" : 17041,
        "719\/9\/W" : 23457,
        "2462\/2\/scatter_index" : 9823,
        "3699\/1\/b" : 18059,
        "1571\/5\/b" : 3881,
        "2429\/2\/b" : 9599,
        "864\/8\/b" : 24425,
        "962\/8\/scatter_index" : 25081,
        "1074\/7\/W" : 567,
        "1706\/5\/W" : 4779,
        "208\/12\/b" : 7271,
        "2617\/2\/scatter_index" : 10855,
