{
  "storage" : "model.espresso.weights",
  "analyses" : {

  },
  "properties" : {

  },
  "format_version" : 200,
  "metadata_in_weights" : [

  ],
  "layers" : [
    {
      "has_prelu" : 0,
      "top" : "user_vector",
      "has_biases" : 1,
      "blob_weights_f16" : 3,
      "nC" : 200,
      "weights" : {

      },
      "type" : "inner_product",
      "has_relu" : 0,
      "attributes" : {
        "is_output" : 1
      },
      "bottom" : "aggregates",
      "debug_info" : "dense_2",
      "has_tanh" : 0,
      "blob_biases" : 1,
      "name" : "dense_2",
      "nB" : 4841
    }
  ]
}