{
  "transform_params" : {
    "data" : {
      "bias_a" : 0,
      "bias_g" : 0,
      "bias_r" : 0,
      "bias_b" : 0,
      "center_mean" : 0,
      "is_network_bgr" : 0,
      "scale" : 1
    }
  },
  "properties" : {

  },
  "configurations" : {
    "data_1_1_3_480_480_" : {
      "input_shapes" : {
        "data" : {
          "k" : 3,
          "w" : 480,
          "n" : 1,
          "h" : 480
        }
      }
    }
  },
  "format_version" : 200,
  "storage" : "model.espresso.weights",
  "layers" : [
    {
      "alpha" : 0.054797761142253876,
      "bottom" : "data",
      "operation" : 3,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "data__fix__underflow_____mobilenet0_conv0_fwd",
      "type" : "elementwise",
      "name" : "mobilenet0_conv0_fwd__fix__underflow___",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "mobilenet0_relu0_fwd",
      "blob_weights" : 3,
      "K" : 3,
      "blob_biases" : 1,
      "stride_x" : 2,
      "name" : "mobilenet0_conv0_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "data__fix__underflow_____mobilenet0_conv0_fwd",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "mobilenet0_relu1_fwd",
      "blob_weights" : 7,
      "K" : 32,
      "blob_biases" : 5,
      "name" : "mobilenet0_conv1_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "mobilenet0_relu0_fwd",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenet0_relu2_fwd",
      "blob_weights" : 11,
      "K" : 32,
      "blob_biases" : 9,
      "name" : "mobilenet0_conv2_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "mobilenet0_relu1_fwd",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "mobilenet0_relu3_fwd",
      "blob_weights" : 15,
      "K" : 64,
      "blob_biases" : 13,
      "stride_x" : 2,
      "name" : "mobilenet0_conv3_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "mobilenet0_relu2_fwd",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenet0_relu4_fwd",
      "K" : 64,
      "blob_biases" : 17,
      "quantization_lut_weights_blob" : 19,
      "name" : "mobilenet0_conv4_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "mobilenet0_relu3_fwd",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "quantization_ranges_blob" : 21
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "mobilenet0_relu5_fwd",
      "blob_weights" : 25,
      "K" : 128,
      "blob_biases" : 23,
      "name" : "mobilenet0_conv5_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "mobilenet0_relu4_fwd",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenet0_relu6_fwd",
      "K" : 128,
      "blob_biases" : 27,
      "quantization_lut_weights_blob" : 29,
      "name" : "mobilenet0_conv6_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "mobilenet0_relu5_fwd",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "quantization_ranges_blob" : 31
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "mobilenet0_relu7_fwd",
      "blob_weights" : 35,
      "K" : 128,
      "blob_biases" : 33,
      "stride_x" : 2,
      "name" : "mobilenet0_conv7_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "mobilenet0_relu6_fwd",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenet0_relu8_fwd",
      "K" : 128,
      "blob_biases" : 37,
      "quantization_lut_weights_blob" : 39,
      "name" : "mobilenet0_conv8_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "mobilenet0_relu7_fwd",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "quantization_ranges_blob" : 41
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "mobilenet0_relu9_fwd",
      "blob_weights" : 45,
      "K" : 256,
      "blob_biases" : 43,
      "name" : "mobilenet0_conv9_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 256,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "mobilenet0_relu8_fwd",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenet0_relu10_fwd",
      "K" : 256,
      "blob_biases" : 47,
      "quantization_lut_weights_blob" : 49,
      "name" : "mobilenet0_conv10_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "mobilenet0_relu9_fwd",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "quantization_ranges_blob" : 51
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "mobilenet0_relu11_fwd",
      "blob_weights" : 55,
      "K" : 256,
      "blob_biases" : 53,
      "stride_x" : 2,
      "name" : "mobilenet0_conv11_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 256,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "mobilenet0_relu10_fwd",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenet0_relu12_fwd",
      "K" : 256,
      "blob_biases" : 57,
      "quantization_lut_weights_blob" : 59,
      "name" : "mobilenet0_conv12_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "mobilenet0_relu11_fwd",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "quantization_ranges_blob" : 61
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "mobilenet0_relu13_fwd",
      "blob_weights" : 65,
      "K" : 512,
      "blob_biases" : 63,
      "name" : "mobilenet0_conv13_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 512,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "mobilenet0_relu12_fwd",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenet0_relu14_fwd",
      "K" : 512,
      "blob_biases" : 67,
      "quantization_lut_weights_blob" : 69,
      "name" : "mobilenet0_conv14_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "mobilenet0_relu13_fwd",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "quantization_ranges_blob" : 71
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "mobilenet0_relu15_fwd",
      "blob_weights" : 75,
      "K" : 512,
      "blob_biases" : 73,
      "name" : "mobilenet0_conv15_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 512,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "mobilenet0_relu14_fwd",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenet0_relu16_fwd",
      "K" : 512,
      "blob_biases" : 77,
      "quantization_lut_weights_blob" : 79,
      "name" : "mobilenet0_conv16_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "mobilenet0_relu15_fwd",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "quantization_ranges_blob" : 81
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "mobilenet0_relu17_fwd",
      "blob_weights" : 85,
      "K" : 512,
      "blob_biases" : 83,
      "name" : "mobilenet0_conv17_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 512,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "mobilenet0_relu16_fwd",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenet0_relu18_fwd",
      "K" : 512,
      "blob_biases" : 87,
      "quantization_lut_weights_blob" : 89,
      "name" : "mobilenet0_conv18_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "mobilenet0_relu17_fwd",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "quantization_ranges_blob" : 91
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "mobilenet0_relu19_fwd",
      "blob_weights" : 95,
      "K" : 512,
      "blob_biases" : 93,
      "name" : "mobilenet0_conv19_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 512,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "mobilenet0_relu18_fwd",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenet0_relu20_fwd",
      "K" : 512,
      "blob_biases" : 97,
      "quantization_lut_weights_blob" : 99,
      "name" : "mobilenet0_conv20_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "mobilenet0_relu19_fwd",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "quantization_ranges_blob" : 101
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "mobilenet0_relu21_fwd",
      "blob_weights" : 105,
      "K" : 512,
      "blob_biases" : 103,
      "name" : "mobilenet0_conv21_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 512,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "mobilenet0_relu20_fwd",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenet0_relu22_fwd",
      "K" : 512,
      "blob_biases" : 107,
      "quantization_lut_weights_blob" : 109,
      "name" : "mobilenet0_conv22_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "mobilenet0_relu21_fwd",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "quantization_ranges_blob" : 111
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "mobilenet0_relu23_fwd",
      "blob_weights" : 115,
      "K" : 512,
      "blob_biases" : 113,
      "stride_x" : 2,
      "name" : "mobilenet0_conv23_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 512,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "mobilenet0_relu22_fwd",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenet0_relu24_fwd",
      "K" : 512,
      "blob_biases" : 117,
      "quantization_lut_weights_blob" : 119,
      "name" : "mobilenet0_conv24_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 1024,
      "bottom" : "mobilenet0_relu23_fwd",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "quantization_ranges_blob" : 121
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "mobilenet0_relu25_fwd",
      "blob_weights" : 125,
      "K" : 1024,
      "blob_biases" : 123,
      "name" : "mobilenet0_conv25_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1024,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 1024,
      "bottom" : "mobilenet0_relu24_fwd",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenet0_relu26_fwd",
      "K" : 1024,
      "blob_biases" : 127,
      "quantization_lut_weights_blob" : 129,
      "name" : "mobilenet0_conv26_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 1024,
      "bottom" : "mobilenet0_relu25_fwd",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "quantization_ranges_blob" : 131
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "f_reduced_0_relu",
      "K" : 1024,
      "blob_biases" : 133,
      "quantization_lut_weights_blob" : 135,
      "name" : "f_reduced_0_conv",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "mobilenet0_relu26_fwd",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "quantization_ranges_blob" : 137
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "g_0before_pad",
      "blob_weights" : 139,
      "K" : 256,
      "stride_x" : 2,
      "name" : "g_0",
      "has_batch_norm" : 0,
      "type" : "deconvolution",
      "n_groups" : 256,
      "pad_t" : 0,
      "hint_fallback_from_metal" : 1,
      "stride_y" : 2,
      "has_biases" : 0,
      "C" : 256,
      "bottom" : "f_reduced_0_relu",
      "weights" : {

      },
      "Nx" : 4,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 4,
      "n_parallel" : 1
    },
    {
      "bottom" : "g_0before_pad",
      "t" : 1,
      "weights" : {

      },
      "l" : 1,
      "r" : 1,
      "top" : "g_0",
      "type" : "crop",
      "name" : "g_0_pad",
      "b" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "f_reduced_1_relu",
      "K" : 512,
      "blob_biases" : 141,
      "quantization_lut_weights_blob" : 143,
      "name" : "f_reduced_1_conv",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "mobilenet0_relu22_fwd",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "quantization_ranges_blob" : 145
    },
    {
      "weights" : {

      },
      "top" : "concats_1",
      "type" : "concat",
      "name" : "concats_1",
      "bottom" : "g_0,f_reduced_1_relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "convs_1_relu",
      "K" : 384,
      "blob_biases" : 147,
      "quantization_lut_weights_blob" : 149,
      "name" : "convs_1_conv",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "concats_1",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "quantization_ranges_blob" : 151
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "h_1_relu",
      "K" : 128,
      "blob_biases" : 153,
      "quantization_lut_weights_blob" : 155,
      "name" : "h_1_conv",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "convs_1_relu",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "quantization_ranges_blob" : 157
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "g_1before_pad",
      "blob_weights" : 159,
      "K" : 128,
      "stride_x" : 2,
      "name" : "g_1",
      "has_batch_norm" : 0,
      "type" : "deconvolution",
      "n_groups" : 128,
      "pad_t" : 0,
      "hint_fallback_from_metal" : 1,
      "stride_y" : 2,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "h_1_relu",
      "weights" : {

      },
      "Nx" : 4,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 4,
      "n_parallel" : 1
    },
    {
      "bottom" : "g_1before_pad",
      "t" : 1,
      "weights" : {

      },
      "l" : 1,
      "r" : 1,
      "top" : "g_1",
      "type" : "crop",
      "name" : "g_1_pad",
      "b" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "f_reduced_2_relu",
      "K" : 256,
      "blob_biases" : 161,
      "quantization_lut_weights_blob" : 163,
      "name" : "f_reduced_2_conv",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "mobilenet0_relu10_fwd",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "quantization_ranges_blob" : 165
    },
    {
      "weights" : {

      },
      "top" : "concats_2",
      "type" : "concat",
      "name" : "concats_2",
      "bottom" : "g_1,f_reduced_2_relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "convs_2_relu",
      "K" : 192,
      "blob_biases" : 167,
      "quantization_lut_weights_blob" : 169,
      "name" : "convs_2_conv",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "concats_2",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "quantization_ranges_blob" : 171
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "h_2_relu",
      "K" : 64,
      "blob_biases" : 173,
      "quantization_lut_weights_blob" : 175,
      "name" : "h_2_conv",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "convs_2_relu",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "quantization_ranges_blob" : 177
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "g_2before_pad",
      "blob_weights" : 179,
      "K" : 64,
      "stride_x" : 2,
      "name" : "g_2",
      "has_batch_norm" : 0,
      "type" : "deconvolution",
      "n_groups" : 64,
      "pad_t" : 0,
      "hint_fallback_from_metal" : 1,
      "stride_y" : 2,
      "has_biases" : 0,
      "C" : 64,
      "bottom" : "h_2_relu",
      "weights" : {

      },
      "Nx" : 4,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 4,
      "n_parallel" : 1
    },
    {
      "bottom" : "g_2before_pad",
      "t" : 1,
      "weights" : {

      },
      "l" : 1,
      "r" : 1,
      "top" : "g_2",
      "type" : "crop",
      "name" : "g_2_pad",
      "b" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "f_reduced_3_relu",
      "K" : 128,
      "blob_biases" : 181,
      "quantization_lut_weights_blob" : 183,
      "name" : "f_reduced_3_conv",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "mobilenet0_relu6_fwd",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "quantization_ranges_blob" : 185
    },
    {
      "weights" : {

      },
      "top" : "concats_3",
      "type" : "concat",
      "name" : "concats_3",
      "bottom" : "g_2,f_reduced_3_relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "convs_3_relu",
      "blob_weights" : 189,
      "K" : 96,
      "blob_biases" : 187,
      "name" : "convs_3_conv",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "concats_3",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "h_3_relu",
      "K" : 32,
      "blob_biases" : 191,
      "quantization_lut_weights_blob" : 193,
      "name" : "h_3_conv",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "convs_3_relu",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "quantization_ranges_blob" : 195
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "g_3_relu",
      "K" : 32,
      "blob_biases" : 197,
      "quantization_lut_weights_blob" : 199,
      "name" : "g_3_conv",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "h_3_relu",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "quantization_ranges_blob" : 201
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "f_score_act_conv",
      "blob_weights" : 205,
      "K" : 32,
      "blob_biases" : 203,
      "name" : "f_score_act_conv",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 1,
      "bottom" : "g_3_relu",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "mode" : 3,
      "weights" : {

      },
      "top" : "f_score_act_sigmoid_output",
      "type" : "activation",
      "name" : "f_score_act_sigmoid_output",
      "bottom" : "f_score_act_conv"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "geo_map_act_conv",
      "blob_weights" : 209,
      "K" : 32,
      "blob_biases" : 207,
      "name" : "geo_map_act_conv",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "g_3_relu",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "mode" : 3,
      "weights" : {

      },
      "top" : "geo_map_act_sigmoid",
      "type" : "activation",
      "name" : "geo_map_act_sigmoid",
      "bottom" : "geo_map_act_conv"
    },
    {
      "alpha" : 512,
      "bottom" : "geo_map_act_sigmoid",
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "_mulscalar0",
      "type" : "elementwise",
      "name" : "_mulscalar0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "angle_map_act_conv",
      "blob_weights" : 213,
      "K" : 32,
      "blob_biases" : 211,
      "name" : "angle_map_act_conv",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 1,
      "bottom" : "g_3_relu",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "mode" : 3,
      "weights" : {

      },
      "top" : "angle_map_act_sigmoid",
      "type" : "activation",
      "name" : "angle_map_act_sigmoid",
      "bottom" : "angle_map_act_conv"
    },
    {
      "alpha" : -0.5,
      "bottom" : "angle_map_act_sigmoid",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "_minusscalar0",
      "type" : "elementwise",
      "name" : "_minusscalar0",
      "beta" : 0
    },
    {
      "alpha" : 3.1415927410125732,
      "bottom" : "_minusscalar0",
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "_mulscalar1",
      "type" : "elementwise",
      "name" : "_mulscalar1",
      "beta" : 0
    },
    {
      "alpha" : 0.5,
      "bottom" : "_mulscalar1",
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "_divscalar0",
      "type" : "elementwise",
      "name" : "_divscalar0",
      "beta" : 0
    },
    {
      "weights" : {

      },
      "top" : "geometry_output",
      "type" : "concat",
      "name" : "geometry_output",
      "bottom" : "_mulscalar0,_divscalar0"
    }
  ]
}