<pad>
<unk>
<s>
</s>
い
の
て
な
た
し
っ
か
で
る
ん
に
と
、
ー
が
す
ら
.
は
。
う
ま
xDIGITx
xMATCHx
も
だ
く
れ
xTERM_EXCLAMATIONx
り
こ
ン
あ
け
よ
き
を
ち
さ
や
ど
お
そ
ス
xTERM_QUESTIONx
イ
xSPACEx
ゃ
わ
え
ね
ト
め
ル
ラ
み
つ
ッ
w
ク
日
人
リ
じ
ア
ろ
・
せ
タ
ロ
レ
マ
見
思
コ
今
出
ば
カ
時
シ
フ
ド
気
分
キ
言
大
チ
プ
バ
ジ
一
ご
メ
笑
ぎ
間
行
ャ
ょ
自
オ
ほ
事
生
テ
ず
ナ
本
グ
ム
中
ブ
方
ぁ
感
パ
前
何
来
好
手
ウ
上
私
ニ
子
入
べ
デ
サ
最
無
ツ
年
xMATHx
全
ィ
作
エ
回
ミ
ダ
ュ
会
げ
目
話
食
o
ビ
モ
ワ
良
e
ガ
ぶ
合
当
ハ
買
T
後
i
動
ズ
ョ
む
楽
通
理
ケ
t
高
ボ
愛
画
的
知
ネ
使
寝
持
味
セ
明
ベ
び
ざ
月
可
ぱ
変
部
S
ソ
体
家
定
ぐ
外
多
度
A
下
者
面
学
対
ピ
ひ
ぇ
a
近
ポ
国
場
ゲ
々
実
俺
女
ェ
新
意
終
金
ふ
xTERM_OTHERx
P
ホ
物
先
力
強
発
仕
同
r
性
D
ぞ
心
付
地
不
ノ
死
ヤ
〜
業
違
ァ
ォ
初
長
様
R
結
取
聞
考
ゆ
へ
期
欲
用
名
書
信
C
M
開
n
悪
以
切
/
ゴ
少
世
ギ
番
白
真
早
E
張
O
美
戦
m
起
ぜ
安
数
I
色
小
顔
内
所
配
ペ
N
休
待
過
代
L
ぼ
流
要
帰
誰
関
引
解
化
落
連
機
-
立
s
始
F
社
着
元
達
相
勝
神
現
読
描
夜
電
然
ぬ
飲
声
送
確
野
B
風
ヒ
成
界
屋
田
u
絶
車
音
二
込
売
教
能
万
山
直
続
語
正
G
文
題
足
天
活
次
身
集
ザ
夫
円
朝
覚
ぽ
頑
;
頭
予
普
男
ゅ
僕
願
加
返
店
消
問
調
l
限
絵
決
応
情
週
想
員
報
受
水
校
公
品
♪
素
道
泣
向
止
別
料
選
p
歌
c
主
半
友
毎
優
表
空
嫌
昨
曲
重
在
推
民
V
久
他
痛
特
h
d
記
原
丈
必
観
島
残
東
写
b
口
状
放
点
乗
構
増
経
有
草
個
三
眠
法
葉
k
緒
組
怖
H
嬉
W
線
置
飯
彼
急
K
完
位
常
呼
難
親
映
像
運
指
忘
づ
g
検
割
腹
態
進
染
保
石
転
字
海
説
果
夢
花
疲
君
ヴ
_
♡
平
ヨ
撮
交
宅
得
失
市
遊
政
xQUOTEx
歩
y
認
反
再
←
ゼ
格
減
京
参
治
太
ヘ
苦
病
単
ぴ
聴
ぉ
段
飛
利
更
U
制
髪
川
和
枚
投
換
伝
系
,
ぃ
式
幸
装
我
昼
質
約
頃
:
第
木
務
居
抜
ユ
追
型
習
台
存
肉
負
暇
魔
供
産
森
周
局
超
爆
黒
設
皆
勤
焼
係
試
遅
戻
離
似
Y
打
曜
突
議
給
絡
計
走
由
殺
服
酒
量
録
訳
念
雨
古
容
垢
断
氏
件
☆
備
望
母
命
布
'
倒
収
職
県
育
都
影
満
演
馬
遠
赤
速
敵
散
撃
歳
団
支
広
申
院
土
\
程
識
余
低
価
験
光
深
住
ぷ
視
降
未
&
際
ぅ
非
差
器
仲
xBULLETx
届
北
形
課
凄
共
逆
復
去
判
値
登
辛
探
助
許
粛
悲
星
振
論
告
園
種
v
頼
済
頂
士
役
末
基
義
座
壊
王
J
熱
>
X
率
効
勉
茶
奴
f
接
兄
況
震
恋
族
勢
除
冷
師
村
井
郎
医
編
藤
迷
火
越
働
青
練
呂
倍
攻
息
故
軽
注
具
洗
任
首
権
改
弱
触
昔
毛
営
精
困
寄
筋
雑
帯
介
麗
猫
若
客
興
守
沢
工
求
了
瞬
誕
途
西
側
十
夏
貰
極
授
修
輩
為
巻
怒
武
象
致
号
春
ヶ
害
類
援
示
費
版
科
販
整
派
礼
横
押
z
ゾ
逃
婚
適
査
綺
載
血
並
福
寒
英
準
担
術
案
千
ぺ
等
晴
球
移
激
温
岡
丸
替
囲
端
破
響
繋
辺
策
技
室
紙
細
父
謝
薬
防
両
健
資
米
例
悩
背
比
療
滅
危
片
駅
甘
症
姉
延
玉
退
党
浮
材
裏
談
払
処
御
恐
旅
松
抱
企
混
提
異
左
脳
貴
宮
右
護
総
弾
府
答
密
漫
鬼
邪
根
乳
被
掛
盛
便
納
図
圧
谷
ヌ
規
境
喜
渡
駄
館
姿
景
索
閉
犬
印
吸
緊
香
x
阪
商
才
捨
路
門
募
○
伸
短
司
補
ゥ
油
証
希
懐
独
舞
詰
荒
敗
製
弁
迎
購
弟
軍
察
午
四
鹿
塗
鳥
狂
夕
波
慢
衣
簡
静
禁
互
惑
涙
辞
労
環
Z
展
刺
造
謎
菜
五
隠
宣
耳
慣
枠
避
永
専
憶
魚
研
固
暴
充
裕
稿
積
階
微
脱
剣
秒
純
隊
吹
町
請
箱
娘
区
源
税
城
省
節
南
祭
鉄
厳
恥
誤
庫
嘘
与
罪
紹
鼻
亡
是
癖
豆
麻
吉
救
戸
章
雪
既
橋
評
闘
級
賞
#
妹
史
陽
銀
傷
乱
怪
芸
誘
歴
模
警
己
席
険
秋
快
歯
<
角
管
疑
崎
宿
胸
算
含
額
隣
折
桜
百
挙
|
各
携
悔
拡
暗
鳴
因
街
佐
争
釣
旦
束
薄
協
喋
吐
牛
那
条
厚
監
妙
建
統
刻
仮
億
華
域
奈
尊
江
崩
腕
否
討
康
志
握
揺
導
責
奥
`
眼
Q
択
坂
韓
催
褒
汚
稼
幼
列
酔
踊
毒
射
財
卒
尾
肌
詞
創
履
究
袋
順
叩
忙
児
掃
盤
施
驚
庭
八
障
濃
壁
酷
詳
炎
羽
耐
池
将
骨
晩
属
衛
操
犯
官
×
般
劇
柄
踏
扱
距
揃
菓
蔵
癒
獄
腐
伊
即
騒
諦
略
寂
暮
兵
飽
堂
∀
船
干
貯
講
券
殴
陰
底
板
富
荷
照
標
宝
輪
清
狙
善
@
災
睡
継
聖
借
齢
勘
従
腰
塩
票
―
削
抗
浜
句
゚
老
粉
杯
焦
♥
丁
捕
姫
臭
雰
冬
養
潰
雷
洋
偉
宇
寺
闇
咲
虫
刀
就
肩
貼
黄
留
称
埋
趣
測
州
株
複
★
́
溜
岩
批
欠
誌
祝
織
繰
泉
嫁
紅
占
幕
ヲ
湯
診
棒
卵
督
免
寿
停
窓
領
札
勇
敬
締
緑
鮮
恵
叫
奇
津
砂
跡
沼
依
穴
婦
功
獣
季
匂
瀬
液
鏡
黙
燃
林
徒
鍵
汗
床
凍
秘
及
露
龍
嵐
祈
尽
易
揚
植
河
層
令
妄
〇
酸
呟
譲
皮
樹
漢
豪
浴
律
倉
暑
汁
至
損
奮
臓
珍
里
唐
努
典
廃
飼
艦
霊
尻
虚
憩
羨
剤
宜
採
競
群
奏
悟
博
舎
巨
七
縁
包
豊
双
償
遣
缶
駆
魅
煮
候
鬱
欄
概
到
封
暖
渋
梅
也
承
豚
宙
陸
徹
哀
患
縮
妻
痩
沖
晒
鯖
秀
九
某
紀
衝
栄
拠
坊
童
噛
控
濯
委
乾
築
矢
偏
雀
凸
脚
臨
麺
煽
紫
萎
遺
賀
訪
萌
維
勧
雄
裁
迫
透
奪
縄
竜
筆
範
j
靴
幻
翔
炊
抑
宗
泊
看
添
胃
甲
°
昇
諸
躍
愚
六
港
挑
覧
旧
裸
煙
幅
釈
狩
糖
飾
ω
皇
歓
均
賛
益
磨
貧
魂
雲
貸
幹
則
掘
溶
乙
襲
惚
唯
須
阿
籍
璧
隈
如
殿
陣
需
竹
慮
輝
帝
溢
徳
刑
拝
痴
騎
炭
巡
審
郵
掲
粧
眺
呪
ぢ
拾
舗
湾
匹
喧
刊
岸
鎖
漏
鍋
較
菌
央
噌
彙
把
鈴
契
盗
狭
喉
柔
忍
寧
斗
副
妖
嘩
浅
房
敷
彩
舐
農
乃
湧
漁
−
臣
潜
羅
滑
丼
昭
欺
詐
隔
績
拒
仙
献
執
訴
浦
傾
爪
屈
革
懸
狼
伏
針
銃
召
賢
之
述
鑑
氷
摘
桃
妊
偽
憧
兼
沈
徴
↓
喫
嬢
抵
慎
粋
貢
縛
塚
智
呑
祖
獲
著
戯
椅
勿
招
舌
挨
拶
喚
q
蓮
憲
仏
威
疫
唱
冊
↑
厨
玄
弊
衆
摂
航
麦
駐
杉
膝
浸
梨
緩
澤
仁
噂
沸
捗
脂
賃
閣
儀
貞
熊
灯
遇
猛
挟
銭
馴
絞
穏
畑
◎
涼
亜
頻
垂
盾
畜
械
墓
机
帳
剥
棚
鶏
糸
卓
鶴
滞
貫
塾
輸
序
皿
寮
還
翼
枕
融
覗
●
雇
蘭
亀
旨
糞
☀
貨
署
偶
拳
泥
僚
漬
裂
妬
排
熟
譜
孫
撫
傘
戒
刷
旬
掴
匠
■
硬
跳
揮
沙
訓
眉
圏
菅
湿
蹴
肢
倫
砲
芝
翌
繁
抽
誠
項
枝
遂
没
啓
潤
孤
埼
冒
芋
醒
叶
醤
刃
尚
侵
餃
兆
往
稚
云
xCURRENCYx
※
雅
肝
堀
却
伴
恩
預
隙
仰
遭
虎
鍛
帽
虐
潮
濡
罰
郷
冗
桁
縦
偵
稲
逸
拓
騙
欧
咳
蒼
敢
浪
酬
虹
股
肺
析
庁
嫉
茨
零
紛
劣
剛
凛
炒
̄
忠
惨
拍
撤
▽
棄
喰
殊
堪
晶
烈
蒸
錯
拭
疎
覇
岐
礎
随
脇
袖
餅
俳
堕
爽
沿
娠
惜
幌
憎
詩
揉
渉
粘
誇
逮
軒
哲
軸
核
髭
怠
脈
蜜
俗
弓
呆
逢
伺
慌
恒
縫
奨
浄
湖
柱
儲
泳
孔
征
擬
苗
餌
塊
葬
併
莉
盟
贅
吾
燥
摩
芽
ゎ
斬
蛇
朗
霧
飴
弥
陥
励
滝
斉
絆
膨
捜
酢
暫
綾
腸
潟
脅
翻
歪
斜
彦
巣
猿
籠
菊
憂
兎
卍
曇
鼓
牧
唇
槍
又
捉
贈
ゞ
蓄
垣
泡
軟
胡
粒
殆
柳
灰
犠
冥
弄
瓶
婆
恨
肪
潔
枯
卑
抹
牲
凝
胞
塔
乏
砕
蜂
債
厄
逝
網
殻
矛
披
羊
顎
擦
寸
汰
敏
葛
藍
淡
塁
穂
粗
尋
扉
慶
促
壮
愉
慰
尿
冠
侍
瞳
邦
昧
肯
ヽ
腫
括
誉
弦
挿
肥
妥
幾
峰
徐
鈍
拘
塞
隆
託
剰
禍
旗
覆
悠
堅
勃
孝
斎
幽
薫
謀
搭
伐
畳
箇
駒
筒
頬
琴
扇
銘
顧
架
凹
腺
賊
蓋
珠
鉱
撲
班
膚
戚
疾
隅
紋
丹
刈
噴
郡
誓
符
謙
傍
祥
韻
遡
漂
丘
謹
賭
喪
椎
阻
壇
ヅ
錬
殖
貝
囚
寛
淫
克
鎮
鎌
佳
磁
岳
綿
稽
赦
践
膜
嗅
挫
伯
荘
繊
凶
阜
罵
牙
紺
訂
宴
薦
炉
澄
顕
藻
茂
衰
伎
嘆
措
俊
擁
隷
鋭
慈
朱
詮
箸
鉛
唄
崖
迅
凡
瑠
叱
旋
邸
滴
拙
ヂ
漠
穫
昆
該
曖
僧
陶
鋼
溺
祉
蚊
妨
崇
軌
亭
胆
棋
乞
洞
鉢
ヾ
騰
盆
懲
掌
紳
彫
槽
飢
ヮ
茎
諭
奉
泰
廊
綱
閲
棺
培
糧
戴
捻
棟
簿
傑
笛
煩
窮
彰
酵
宛
蛍
累
搾
酎
媒
巧
峠
錦
髄
緯
庶
逐
渇
醜
苛
藩
据
陳
濁
綻
匿
柿
栃
盲
詠
径
憤
釜
忌
廉
芳
娯
曹
栽
痕
ヵ
溝
頓
錠
蛮
芯
煎
暁
涯
肘
矯
銅
壱
滋
璃
辱
窟
叔
恭
鐘
暦
宵
桑
゙
諾
墨
尺
搬
朴
郭
玩
惰
痢
胴
呈
ゐ
循
汎
訟
僅
蔽
唾
耗
蔑
懇
慨
訃
悦
襟
帆
舟
閑
遮
渦
串
艶
秩
爵
曽
骸
拷
耕
柵
篤
醸
拉
賠
ゝ
裾
巾
猟
悼
墜
郊
餓
隻
辣
酌
陛
霜
貪
姓
弐
喝
漆
栓
侮
宰
胎
刹
遍
勲
貌
閥
媛
拐
堤
填
怨
呉
箋
墳
楼
峡
且
紡
雌
褐
尉
慄
甚
猶
貿
赴
但
謡
艇
廷
瓦
咽
繕
ゑ
吟
賄
愁
碁
傲
幣
尼
鯨
禅
ヱ
陵
妃
洪
剖
惧
唆
喩
膳
虜
臆
卸
枢
羞
穀
窒
朽
泌
睦
准
嚇
斑
扶
遷
腎
渓
慕
賜
脊
享
梗
俵
附
畿
衡
遜
轄
畏
帥
侶
詣
碑
摯
姻
采
嘲
翁
坪
臼
奔
叙
嗣
硫
倣
瞭
肖
岬
瘍
漸
壌
后
旺
哺
絹
踪
升
薪
汽
憾
婿
硝
勾
朕
窃
淑
窯
侯
濫
塀
麓
頒
屯
糾
弔
毀
寡
冶
畔
弧
桟
舶
礁
緻
勅
丙
庸
俸
殉
坑
賂
抄
賓
氾
堆
儒
厘
遵
繭
酪
鋳
吏
恣
賦
ゔ
畝
斤
ヰ
斥
諮
租
蚕
罷
衷
嫡
虞
款
迭
痘
舷
墾
倹
嘱
憬
劾
謄
謁
陪
詔
諧
塑
逓
沃
錮
璽
楷
